[Killed] ConditionalExpression
routes/auth.js:22:7
   const { userType, email } = req.body;
   const Model = models[userType];
 
-  if (!Model) {
+  if (false) {
     return res.status(400).json({ message: 'Invalid user type specified.' });
   }
killedBy: Auth Routes POST /signup should return 400 if invalid user type
statusReason: expected 500 to be 400 // Object.is equality

[Survived] ObjectLiteral
routes/auth.js:28:45
   try {
     const patientExists = await Patient.findOne({ email });
     const doctorExists = await Doctor.findOne({ email });
-    const adminExists = await Admin.findOne({ email });
+    const adminExists = await Admin.findOne({});
 
     if (patientExists || doctorExists || adminExists) {

[Killed] ConditionalExpression
routes/auth.js:30:9
     const doctorExists = await Doctor.findOne({ email });
     const adminExists = await Admin.findOne({ email });
 
-    if (patientExists || doctorExists || adminExists) {
+    if (false) {
       return res.status(400).json({ message: 'User with this email already exists.' });
     }
killedBy: Auth Routes POST /signup should return 400 if email already exists
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
routes/auth.js:30:9
     const doctorExists = await Doctor.findOne({ email });
     const adminExists = await Admin.findOne({ email });
 
-    if (patientExists || doctorExists || adminExists) {
+    if (false || adminExists) {
       return res.status(400).json({ message: 'User with this email already exists.' });
     }
killedBy: Auth Routes POST /signup should return 400 if email already exists
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
routes/auth.js:49:9
       <p>If you did not create this account, please ignore this email.</p>
     `;
     
-    try {
-      await sendEmail({
-        email: user.email,
-        subject: 'IntelliConsult - Email Verification',
-        html: message,
-      });
-      
-      res.status(201).json({ 
-        message: `Registration successful! Please check your email at ${user.email} to verify your account.` 
-      });
-      
-    } catch (emailError) {
+    try {} catch (emailError) {
       console.error(emailError);
       await Model.findByIdAndDelete(user._id);
killedBy: Auth Routes POST /signup should register a new patient successfully
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/auth.js:52:18
     try {
       await sendEmail({
         email: user.email,
-        subject: 'IntelliConsult - Email Verification',
+        subject: "",
         html: message,
       });
killedBy: Auth Routes POST /signup should register a new patient successfully
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
routes/auth.js:60:26
         message: `Registration successful! Please check your email at ${user.email} to verify your account.` 
       });
       
-    } catch (emailError) {
-      console.error(emailError);
-      await Model.findByIdAndDelete(user._id);
-      return res.status(500).json({ message: 'Failed to send verification email. Please try signing up again.' });
-    }
+    } catch (emailError) {}
     
   } catch (error) {
killedBy: Auth Routes POST /signup should return 500 if email sending fails
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/auth.js:66:19
       return res.status(500).json({ message: 'Failed to send verification email. Please try signing up again.' });
     }
     
-  } catch (error) {
-    console.error('Signup Error:', error);
-    if (error.name === 'ValidationError') {
-        let messages = Object.values(error.errors).map(val => val.message);
-        return res.status(400).json({ message: messages.join(', ') });
-    }
-    res.status(500).json({ message: 'Server error during signup.', error: error.message });
-  }
+  } catch (error) {}
 });
 
killedBy: Auth Routes POST /signup should return 400 if validation fails
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
routes/auth.js:68:9
     
   } catch (error) {
     console.error('Signup Error:', error);
-    if (error.name === 'ValidationError') {
+    if (false) {
         let messages = Object.values(error.errors).map(val => val.message);
         return res.status(400).json({ message: messages.join(', ') });
killedBy: Auth Routes POST /signup should return 400 if validation fails
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
routes/auth.js:68:43
     
   } catch (error) {
     console.error('Signup Error:', error);
-    if (error.name === 'ValidationError') {
-        let messages = Object.values(error.errors).map(val => val.message);
-        return res.status(400).json({ message: messages.join(', ') });
-    }
+    if (error.name === 'ValidationError') {}
     res.status(500).json({ message: 'Server error during signup.', error: error.message });
   }
killedBy: Auth Routes POST /signup should return 400 if validation fails
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ArrowFunction
routes/auth.js:69:56
   } catch (error) {
     console.error('Signup Error:', error);
     if (error.name === 'ValidationError') {
-        let messages = Object.values(error.errors).map(val => val.message);
+        let messages = Object.values(error.errors).map(() => undefined);
         return res.status(400).json({ message: messages.join(', ') });
     }
killedBy: Auth Routes POST /signup should return 400 if validation fails
statusReason: expected '' to contain 'Password must be at least 8 characters'

[Killed] StringLiteral
routes/auth.js:72:37
         let messages = Object.values(error.errors).map(val => val.message);
         return res.status(400).json({ message: messages.join(', ') });
     }
-    res.status(500).json({ message: 'Server error during signup.', error: error.message });
+    res.status(500).json({ message: "", error: error.message });
   }
 });
killedBy: Auth Routes POST /signup should handle server errors during signup
statusReason: expected '' to contain 'Server error during signup'

[Killed] ObjectLiteral
routes/auth.js:87:38
       
     const query = {
       emailVerificationToken: hashedToken,
-      emailVerificationTokenExpires: { $gt: Date.now() }
+      emailVerificationTokenExpires: {}
     };
 
killedBy: Auth Routes GET /verify-email/:token should verify email with valid token
statusReason: expected 'https://smart-healthcare-appointment-…' to contain 'verified=true'

[Killed] ConditionalExpression
routes/auth.js:90:16
       emailVerificationTokenExpires: { $gt: Date.now() }
     };
 
-    let user = await Patient.findOne(query) ||
-               await Doctor.findOne(query) ||
-               await Admin.findOne(query);
+    let user = false;
     
     if (!user) {
killedBy: Auth Routes GET /verify-email/:token should verify email with valid token
statusReason: expected 'https://smart-healthcare-appointment-…' to contain 'verified=true'

[Killed] ConditionalExpression
routes/auth.js:90:16
       emailVerificationTokenExpires: { $gt: Date.now() }
     };
 
-    let user = await Patient.findOne(query) ||
-               await Doctor.findOne(query) ||
+    let user = false ||
                await Admin.findOne(query);
     
killedBy: Auth Routes GET /verify-email/:token should verify email with valid token
statusReason: expected 'https://smart-healthcare-appointment-…' to contain 'verified=true'

[Killed] BooleanLiteral
routes/auth.js:98:28
       return res.redirect('https://smart-healthcare-appointment-and-triage.onrender.com/login?verified=false');
     }
     
-    user.isEmailVerified = true;
+    user.isEmailVerified = false;
     user.emailVerificationToken = undefined;
     user.emailVerificationTokenExpires = undefined;
killedBy: Auth Routes GET /verify-email/:token should verify email with valid token
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
routes/auth.js:105:19
     
     res.redirect('https://smart-healthcare-appointment-and-triage.onrender.com/login?verified=true');
     
-  } catch (error) {
-    console.error('Email verification error:', error);
-    res.redirect('https://smart-healthcare-appointment-and-triage.onrender.com/login?verified=false');
-  }
+  } catch (error) {}
 });
 
killedBy: Auth Routes GET /verify-email/:token should handle server errors during verification
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/auth.js:116:44
   const Model = models[userType];
   
   if (!Model) {
-    return res.status(400).json({ message: 'Invalid user type specified.' });
+    return res.status(400).json({ message: "" });
   }
 
killedBy: Auth Routes POST /forgot-password should return 400 for invalid user type
statusReason: expected '' to be 'Invalid user type specified.' // Object.is equality

[Killed] ObjectLiteral
routes/auth.js:123:35
     const user = await Model.findOne({ email });
 
     if (!user) {
-      return res.status(200).json({ message: 'If an account with that email exists, a password reset link has been sent.' });
+      return res.status(200).json({});
     }
 
killedBy: Auth Routes POST /forgot-password should return generic message for non-existent user
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
routes/auth.js:126:9
       return res.status(200).json({ message: 'If an account with that email exists, a password reset link has been sent.' });
     }
 
-    if (user.googleId && !user.password) {
+    if (true) {
       return res.status(200).json({ message: 'This account is registered with Google. Please log in using Google.' });
     }
killedBy: Auth Routes POST /forgot-password should send reset email for valid patient
statusReason: expected 'This account is registered with Googl…' to contain 'password reset link has been sent'

[Killed] ConditionalExpression
routes/auth.js:126:9
       return res.status(200).json({ message: 'If an account with that email exists, a password reset link has been sent.' });
     }
 
-    if (user.googleId && !user.password) {
+    if (false) {
       return res.status(200).json({ message: 'This account is registered with Google. Please log in using Google.' });
     }
killedBy: Auth Routes POST /forgot-password should handle Google-only accounts
statusReason: expected 'If an account with that email exists,…' to contain 'registered with Google'

[Survived] BooleanLiteral
routes/auth.js:132:43
 
     const resetToken = user.createPasswordResetToken();
     
-    await user.save({ validateBeforeSave: false });
+    await user.save({ validateBeforeSave: true });
 
     const resetURL = `https://smart-healthcare-appointment-and-triage.onrender.com/reset-password/${resetToken}`;

[Survived] ObjectLiteral
routes/auth.js:132:21
 
     const resetToken = user.createPasswordResetToken();
     
-    await user.save({ validateBeforeSave: false });
+    await user.save({});
 
     const resetURL = `https://smart-healthcare-appointment-and-triage.onrender.com/reset-password/${resetToken}`;

[Killed] ObjectLiteral
routes/auth.js:143:21
       <p>If you did not request this, please ignore this email.</p>
     `;
 
-    await sendEmail({
-      email: user.email,
-      subject: 'IntelliConsult - Password Reset',
-      html: message,
-    });
+    await sendEmail({});
 
     res.status(200).json({ message: 'If an account with that email exists, a password reset link has been sent.' });
killedBy: Auth Routes POST /forgot-password should send reset email for valid patient
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
routes/auth.js:151:19
 
     res.status(200).json({ message: 'If an account with that email exists, a password reset link has been sent.' });
 
-  } catch (error) {
-    console.error('Forgot Password Error:', error);
-    res.status(200).json({ message: 'If an account with that email exists, a password reset link has been sent.' });
-  }
+  } catch (error) {}
 });
 
killedBy: Auth Routes POST /forgot-password should handle errors gracefully
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
routes/auth.js:153:26
 
   } catch (error) {
     console.error('Forgot Password Error:', error);
-    res.status(200).json({ message: 'If an account with that email exists, a password reset link has been sent.' });
+    res.status(200).json({});
   }
 });
killedBy: Auth Routes POST /forgot-password should handle errors gracefully
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
routes/auth.js:162:39
     const { password, confirmPassword } = req.body;
     const unhashedToken = req.params.token;
 
-    if (password !== confirmPassword) {
-      return res.status(400).json({ message: 'Passwords do not match.' });
-    }
+    if (password !== confirmPassword) {}
 
     const hashedToken = crypto
killedBy: Auth Routes PUT /reset-password/:token should return 400 if passwords do not match
statusReason: expected 200 to be 400 // Object.is equality

[Killed] StringLiteral
routes/auth.js:169:15
     const hashedToken = crypto
       .createHash('sha256')
       .update(unhashedToken)
-      .digest('hex');
+      .digest("");
 
     const query = {
killedBy: Auth Routes PUT /reset-password/:token should reset password with valid token
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
routes/auth.js:180:16
                await Doctor.findOne(query) ||
                await Admin.findOne(query);
 
-    if (!user) {
-      return res.status(400).json({ message: 'Token is invalid or has expired.' });
-    }
+    if (!user) {}
 
     user.password = password;
killedBy: Auth Routes PUT /reset-password/:token should return 400 for invalid token
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BooleanLiteral
routes/auth.js:187:28
     user.password = password;
     user.passwordResetToken = undefined;
     user.passwordResetTokenExpires = undefined;
-    user.isEmailVerified = true; 
+    user.isEmailVerified = false; 
 
     await user.save();
killedBy: Auth Routes PUT /reset-password/:token should reset password with valid token
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
routes/auth.js:193:19
 
     res.status(200).json({ message: 'Password reset successful! You can now log in.' });
 
-  } catch (error) {
-    console.error('Reset Password Error:', error);
-    if (error.name === 'ValidationError') {
-        let messages = Object.values(error.errors).map(val => val.message);
-        return res.status(400).json({ message: messages.join(', ') });
-    }
-    res.status(500).json({ message: 'An error occurred while resetting your password.' });
-  }
+  } catch (error) {}
 });
 
killedBy: Auth Routes PUT /reset-password/:token should return 400 for validation errors
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
routes/auth.js:195:9
 
   } catch (error) {
     console.error('Reset Password Error:', error);
-    if (error.name === 'ValidationError') {
+    if (error.name !== 'ValidationError') {
         let messages = Object.values(error.errors).map(val => val.message);
         return res.status(400).json({ message: messages.join(', ') });
killedBy: Auth Routes PUT /reset-password/:token should return 400 for validation errors
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
routes/auth.js:195:43
 
   } catch (error) {
     console.error('Reset Password Error:', error);
-    if (error.name === 'ValidationError') {
-        let messages = Object.values(error.errors).map(val => val.message);
-        return res.status(400).json({ message: messages.join(', ') });
-    }
+    if (error.name === 'ValidationError') {}
     res.status(500).json({ message: 'An error occurred while resetting your password.' });
   }
killedBy: Auth Routes PUT /reset-password/:token should return 400 for validation errors
statusReason: expected 500 to be 400 // Object.is equality

[Killed] StringLiteral
routes/auth.js:204:13
 });
 
 
-router.post('/login', async (req, res) => {
+router.post("", async (req, res) => {
   const { email, password, userType } = req.body;
   const Model = models[userType];
killedBy: Auth Routes POST /login should login patient successfully
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/auth.js:208:7
   const { email, password, userType } = req.body;
   const Model = models[userType];
 
-  if (!Model) {
+  if (true) {
     return res.status(400).json({ message: 'Invalid user type specified.' });
   }
killedBy: Auth Routes POST /login should login patient successfully
statusReason: expected 400 to be 200 // Object.is equality

[Survived] ObjectLiteral
routes/auth.js:212:38
     return res.status(400).json({ message: 'Invalid user type specified.' });
   }
   try {
-    const user = await Model.findOne({ email });
+    const user = await Model.findOne({});
     if (!user) {
       return res.status(400).json({ message: 'Invalid credentials or user role.' });

[Killed] ConditionalExpression
routes/auth.js:213:9
   }
   try {
     const user = await Model.findOne({ email });
-    if (!user) {
+    if (true) {
       return res.status(400).json({ message: 'Invalid credentials or user role.' });
     }
killedBy: Auth Routes POST /login should login patient successfully
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/auth.js:213:9
   }
   try {
     const user = await Model.findOne({ email });
-    if (!user) {
+    if (false) {
       return res.status(400).json({ message: 'Invalid credentials or user role.' });
     }
killedBy: Auth Routes POST /login should return 400 for non-existent user
statusReason: expected 500 to be 400 // Object.is equality

[Killed] StringLiteral
routes/auth.js:218:46
     }
     
     if (user.googleId && !user.password) {
-      return res.status(400).json({ message: 'This account is registered with Google. Please use Google Sign In.' });
+      return res.status(400).json({ message: "" });
     }
     
killedBy: Auth Routes POST /login should return 400 for Google-only accounts
statusReason: expected '' to contain 'registered with Google'

[Killed] BooleanLiteral
routes/auth.js:221:9
       return res.status(400).json({ message: 'This account is registered with Google. Please use Google Sign In.' });
     }
     
-    if (!user.password) {
+    if (user.password) {
        return res.status(400).json({ message: 'Invalid account. No password set.' });
     }
killedBy: Auth Routes POST /login should login patient successfully
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
routes/auth.js:221:25
       return res.status(400).json({ message: 'This account is registered with Google. Please use Google Sign In.' });
     }
     
-    if (!user.password) {
-       return res.status(400).json({ message: 'Invalid account. No password set.' });
-    }
+    if (!user.password) {}
 
     const isMatch = await bcrypt.compare(password, user.password);
killedBy: Auth Routes POST /login should return 400 for account with no password
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ObjectLiteral
routes/auth.js:222:36
     }
     
     if (!user.password) {
-       return res.status(400).json({ message: 'Invalid account. No password set.' });
+       return res.status(400).json({});
     }
 
killedBy: Auth Routes POST /login should return 400 for account with no password
statusReason: expected undefined to be 'Invalid account. No password set.' // Object.is equality

[Killed] BooleanLiteral
routes/auth.js:226:9
     }
 
     const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch) {
+    if (isMatch) {
       return res.status(400).json({ message: 'Invalid credentials.' });
     }
killedBy: Auth Routes POST /login should login patient successfully
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/auth.js:226:9
     }
 
     const isMatch = await bcrypt.compare(password, user.password);
-    if (!isMatch) {
+    if (true) {
       return res.status(400).json({ message: 'Invalid credentials.' });
     }
killedBy: Auth Routes POST /login should login patient successfully
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
routes/auth.js:229:36
     if (!isMatch) {
       return res.status(400).json({ message: 'Invalid credentials.' });
     }
-    if (user.isVerified === false) {
-      return res.status(403).json({ 
-        message: 'Your account has been suspended or is currently under review. Please contact support.' 
-      });
-    }
+    if (user.isVerified === false) {}
 
     if (!user.isEmailVerified) {
killedBy: Auth Routes POST /login should return 403 for suspended account
statusReason: expected 200 to be 403 // Object.is equality

[Killed] BooleanLiteral
routes/auth.js:229:29
     if (!isMatch) {
       return res.status(400).json({ message: 'Invalid credentials.' });
     }
-    if (user.isVerified === false) {
+    if (user.isVerified === true) {
       return res.status(403).json({ 
         message: 'Your account has been suspended or is currently under review. Please contact support.' 
killedBy: Auth Routes POST /login should login patient successfully
statusReason: expected 403 to be 200 // Object.is equality

[Killed] StringLiteral
routes/auth.js:231:18
     }
     if (user.isVerified === false) {
       return res.status(403).json({ 
-        message: 'Your account has been suspended or is currently under review. Please contact support.' 
+        message: "" 
       });
     }
killedBy: Auth Routes POST /login should return 403 for suspended account
statusReason: expected '' to contain 'suspended'

[Killed] BlockStatement
routes/auth.js:235:32
       });
     }
 
-    if (!user.isEmailVerified) {
-      return res.status(401).json({ 
-        message: 'Your email is not verified. Please check your inbox for the verification link.' 
-      });
-    }
+    if (!user.isEmailVerified) {}
 
     const token = jwt.sign(
killedBy: Auth Routes POST /login should return 401 for unverified email
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ConditionalExpression
routes/auth.js:235:9
       });
     }
 
-    if (!user.isEmailVerified) {
+    if (false) {
       return res.status(401).json({ 
         message: 'Your email is not verified. Please check your inbox for the verification link.' 
killedBy: Auth Routes POST /login should return 401 for unverified email
statusReason: expected 200 to be 401 // Object.is equality

[Survived] ObjectLiteral
routes/auth.js:242:7
     }
 
     const token = jwt.sign(
-      { userId: user._id, userType: user.userType },
+      {},
       process.env.JWT_SECRET,
       { expiresIn: '1h' }

[Killed] BlockStatement
routes/auth.js:247:34
       { expiresIn: '1h' }
     );
 
-    if (!user.isProfileComplete) {
-        return res.status(200).json({ 
-          token, 
-          profileComplete: false, 
-          message: 'Login successful, please complete your profile.' 
-        });
-    }
+    if (!user.isProfileComplete) {}
 
     res.status(200).json({ 
killedBy: Auth Routes POST /login should return token with profileComplete false for incomplete profile
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
routes/auth.js:247:9
       { expiresIn: '1h' }
     );
 
-    if (!user.isProfileComplete) {
+    if (user.isProfileComplete) {
         return res.status(200).json({ 
           token, 
killedBy: Auth Routes POST /login should login patient successfully
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
routes/auth.js:248:37
     );
 
     if (!user.isProfileComplete) {
-        return res.status(200).json({ 
-          token, 
-          profileComplete: false, 
-          message: 'Login successful, please complete your profile.' 
-        });
+        return res.status(200).json({});
     }
 
killedBy: Auth Routes POST /login should return token with profileComplete false for incomplete profile
statusReason: expected undefined to be truthy

[Killed] BooleanLiteral
routes/auth.js:250:28
     if (!user.isProfileComplete) {
         return res.status(200).json({ 
           token, 
-          profileComplete: false, 
+          profileComplete: true, 
           message: 'Login successful, please complete your profile.' 
         });
killedBy: Auth Routes POST /login should return token with profileComplete false for incomplete profile
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
routes/auth.js:255:26
         });
     }
 
-    res.status(200).json({ 
-      token, 
-      profileComplete: true, 
-      message: 'Logged in successfully!' 
-    });
+    res.status(200).json({});
   } catch (error) {
     console.error('Login Error:', error);
killedBy: Auth Routes POST /login should login patient successfully
statusReason: expected undefined to be truthy

[Killed] BooleanLiteral
routes/auth.js:257:24
 
     res.status(200).json({ 
       token, 
-      profileComplete: true, 
+      profileComplete: false, 
       message: 'Logged in successfully!' 
     });
killedBy: Auth Routes POST /login should login patient successfully
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
routes/auth.js:260:19
       profileComplete: true, 
       message: 'Logged in successfully!' 
     });
-  } catch (error) {
-    console.error('Login Error:', error);
-    res.status(500).json({ message: 'Server error during login.', error: error.message });
-  }
+  } catch (error) {}
 });
 
killedBy: Auth Routes POST /login should handle server errors during login
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] StringLiteral
routes/auth.js:261:19
       message: 'Logged in successfully!' 
     });
   } catch (error) {
-    console.error('Login Error:', error);
+    console.error("", error);
     res.status(500).json({ message: 'Server error during login.', error: error.message });
   }

[Killed] ObjectLiteral
routes/auth.js:262:26
     });
   } catch (error) {
     console.error('Login Error:', error);
-    res.status(500).json({ message: 'Server error during login.', error: error.message });
+    res.status(500).json({});
   }
 });
killedBy: Auth Routes POST /login should handle server errors during login
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
routes/auth.js:266:12
   }
 });
 
-router.get('/google', passport.authenticate('google', { 
+router.get("", passport.authenticate('google', { 
     scope: ['profile', 'email'],
     session: false 
killedBy: Mutation Coverage Tests for admin.js Console error mutations should log error with specific message when database error occurs in get user
statusReason: expected "error" to be called with arguments: [ StringMatching{…}, Any<Error> ]

Number of calls: 0

[Killed] StringLiteral
routes/auth.js:266:45
   }
 });
 
-router.get('/google', passport.authenticate('google', { 
+router.get('/google', passport.authenticate("", { 
     scope: ['profile', 'email'],
     session: false 
killedBy: Auth Routes GET /google should redirect to Google authentication
statusReason: expected [ 200, 302 ] to include 404

[Survived] BooleanLiteral
routes/auth.js:268:14
 
 router.get('/google', passport.authenticate('google', { 
     scope: ['profile', 'email'],
-    session: false 
+    session: true 
 }));
 

[Killed] StringLiteral
routes/auth.js:271:12
     session: false 
 }));
 
-router.get('/google/callback',
+router.get("",
   passport.authenticate('google', {
     failureRedirect: 'https://smart-healthcare-appointment-and-triage.onrender.com/login?error=google_failed', 
killedBy: Auth Routes GET /google/callback should handle Google callback with complete profile
statusReason: expected 404 to be 302 // Object.is equality

[Survived] ObjectLiteral
routes/auth.js:272:35
 }));
 
 router.get('/google/callback',
-  passport.authenticate('google', {
-    failureRedirect: 'https://smart-healthcare-appointment-and-triage.onrender.com/login?error=google_failed', 
-    failureMessage: true,
-    session: false 
-  }),
+  passport.authenticate('google', {}),
   (req, res) => {
     const user = req.user;
