[Survived] ArrowFunction
routes/SummaryRoutes.js:7:26
 const protect = require('../middleware/auth');
 const Appointment = require('../models/Appointment');
 
-const createGroqClient = () => new Groq({
-  apiKey: process.env.GROQ_API_KEY
-});
+const createGroqClient = () => undefined;
 
 let groq = createGroqClient();

[Killed] BlockStatement
routes/SummaryRoutes.js:19:34
   const allSymptoms = appointment.symptomsList ? [...appointment.symptomsList] : [];
   
   // Add "Other" symptoms if present
-  if (appointment.symptomsOther) {
-    allSymptoms.push(appointment.symptomsOther);
-  }
+  if (appointment.symptomsOther) {}
 
   // BACKWARD COMPATIBILITY: Check the old 'symptoms' string field
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Light headedness'

[Killed] ConditionalExpression
routes/SummaryRoutes.js:19:7
   const allSymptoms = appointment.symptomsList ? [...appointment.symptomsList] : [];
   
   // Add "Other" symptoms if present
-  if (appointment.symptomsOther) {
+  if (true) {
     allSymptoms.push(appointment.symptomsOther);
   }
killedBy: GET /api/summary/appointment/:appointmentId applies fallback text for empty lists and legacy symptom string
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Legacy legacy array symptom'

[Killed] EqualityOperator
routes/SummaryRoutes.js:25:7
 
   // BACKWARD COMPATIBILITY: Check the old 'symptoms' string field
   // If the list is empty but the old field has data, use it
-  if (allSymptoms.length === 0) {
+  if (allSymptoms.length !== 0) {
     if (Array.isArray(appointment.symptoms) && appointment.symptoms.length > 0) {
       allSymptoms.push(...appointment.symptoms);
killedBy: GET /api/summary/appointment/:appointmentId applies fallback text for empty lists and legacy symptom string
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Legacy legacy array symptom'

[Killed] BlockStatement
routes/SummaryRoutes.js:25:33
 
   // BACKWARD COMPATIBILITY: Check the old 'symptoms' string field
   // If the list is empty but the old field has data, use it
-  if (allSymptoms.length === 0) {
-    if (Array.isArray(appointment.symptoms) && appointment.symptoms.length > 0) {
-      allSymptoms.push(...appointment.symptoms);
-    } else if (appointment.symptoms && typeof appointment.symptoms === 'string') {
-      allSymptoms.push(appointment.symptoms);
-    }
-  }
+  if (allSymptoms.length === 0) {}
   // -----------------------------
 
killedBy: GET /api/summary/appointment/:appointmentId applies fallback text for empty lists and legacy symptom string
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Legacy legacy array symptom'

[Killed] BlockStatement
routes/SummaryRoutes.js:26:81
   // BACKWARD COMPATIBILITY: Check the old 'symptoms' string field
   // If the list is empty but the old field has data, use it
   if (allSymptoms.length === 0) {
-    if (Array.isArray(appointment.symptoms) && appointment.symptoms.length > 0) {
-      allSymptoms.push(...appointment.symptoms);
-    } else if (appointment.symptoms && typeof appointment.symptoms === 'string') {
+    if (Array.isArray(appointment.symptoms) && appointment.symptoms.length > 0) {} else if (appointment.symptoms && typeof appointment.symptoms === 'string') {
       allSymptoms.push(appointment.symptoms);
     }
killedBy: GET /api/summary/appointment/:appointmentId applies fallback text for empty lists and legacy symptom string
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Legacy legacy array symptom'

[Killed] EqualityOperator
routes/SummaryRoutes.js:26:48
   // BACKWARD COMPATIBILITY: Check the old 'symptoms' string field
   // If the list is empty but the old field has data, use it
   if (allSymptoms.length === 0) {
-    if (Array.isArray(appointment.symptoms) && appointment.symptoms.length > 0) {
+    if (Array.isArray(appointment.symptoms) && appointment.symptoms.length <= 0) {
       allSymptoms.push(...appointment.symptoms);
     } else if (appointment.symptoms && typeof appointment.symptoms === 'string') {
killedBy: GET /api/summary/appointment/:appointmentId applies fallback text for empty lists and legacy symptom string
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Legacy legacy array symptom'

[Survived] EqualityOperator
routes/SummaryRoutes.js:28:40
   if (allSymptoms.length === 0) {
     if (Array.isArray(appointment.symptoms) && appointment.symptoms.length > 0) {
       allSymptoms.push(...appointment.symptoms);
-    } else if (appointment.symptoms && typeof appointment.symptoms === 'string') {
+    } else if (appointment.symptoms && typeof appointment.symptoms !== 'string') {
       allSymptoms.push(appointment.symptoms);
     }

[Survived] ConditionalExpression
routes/SummaryRoutes.js:28:16
   if (allSymptoms.length === 0) {
     if (Array.isArray(appointment.symptoms) && appointment.symptoms.length > 0) {
       allSymptoms.push(...appointment.symptoms);
-    } else if (appointment.symptoms && typeof appointment.symptoms === 'string') {
+    } else if (false) {
       allSymptoms.push(appointment.symptoms);
     }

[Killed] ConditionalExpression
routes/SummaryRoutes.js:35:26
   // -----------------------------
 
   // severe symptoms
-  const severeSymptoms = appointment.severeSymptomsCheck || [];
+  const severeSymptoms = true;
 
   // ... (conditions logic) ...
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Loss of consciousness'

[Killed] ConditionalExpression
routes/SummaryRoutes.js:35:26
   // -----------------------------
 
   // severe symptoms
-  const severeSymptoms = appointment.severeSymptomsCheck || [];
+  const severeSymptoms = false;
 
   // ... (conditions logic) ...
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Loss of consciousness'

[Killed] ConditionalExpression
routes/SummaryRoutes.js:38:22
   const severeSymptoms = appointment.severeSymptomsCheck || [];
 
   // ... (conditions logic) ...
-  const conditions = appointment.preExistingConditions || [];
+  const conditions = false;
   const conditionsOther = appointment.preExistingConditionsOther || '';
   const allConditions = [...conditions];
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/SummaryRoutes.js:38:22
   const severeSymptoms = appointment.severeSymptomsCheck || [];
 
   // ... (conditions logic) ...
-  const conditions = appointment.preExistingConditions || [];
+  const conditions = true;
   const conditionsOther = appointment.preExistingConditionsOther || '';
   const allConditions = [...conditions];
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/SummaryRoutes.js:39:27
 
   // ... (conditions logic) ...
   const conditions = appointment.preExistingConditions || [];
-  const conditionsOther = appointment.preExistingConditionsOther || '';
+  const conditionsOther = false;
   const allConditions = [...conditions];
   if (conditionsOther) allConditions.push(conditionsOther);
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Thyroid disorder'

[Killed] LogicalOperator
routes/SummaryRoutes.js:39:27
 
   // ... (conditions logic) ...
   const conditions = appointment.preExistingConditions || [];
-  const conditionsOther = appointment.preExistingConditionsOther || '';
+  const conditionsOther = appointment.preExistingConditionsOther && '';
   const allConditions = [...conditions];
   if (conditionsOther) allConditions.push(conditionsOther);
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Thyroid disorder'

[Killed] ConditionalExpression
routes/SummaryRoutes.js:41:7
   const conditions = appointment.preExistingConditions || [];
   const conditionsOther = appointment.preExistingConditionsOther || '';
   const allConditions = [...conditions];
-  if (conditionsOther) allConditions.push(conditionsOther);
+  if (false) allConditions.push(conditionsOther);
 
   // ... (family history logic) ...
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Thyroid disorder'

[Survived] ConditionalExpression
routes/SummaryRoutes.js:41:7
   const conditions = appointment.preExistingConditions || [];
   const conditionsOther = appointment.preExistingConditionsOther || '';
   const allConditions = [...conditions];
-  if (conditionsOther) allConditions.push(conditionsOther);
+  if (true) allConditions.push(conditionsOther);
 
   // ... (family history logic) ...

[Killed] ConditionalExpression
routes/SummaryRoutes.js:44:25
   if (conditionsOther) allConditions.push(conditionsOther);
 
   // ... (family history logic) ...
-  const familyHistory = appointment.familyHistory || [];
+  const familyHistory = false;
   const familyHistoryOther = appointment.familyHistoryOther || '';
   const allFamilyHistory = [...familyHistory];
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/SummaryRoutes.js:44:25
   if (conditionsOther) allConditions.push(conditionsOther);
 
   // ... (family history logic) ...
-  const familyHistory = appointment.familyHistory || [];
+  const familyHistory = true;
   const familyHistoryOther = appointment.familyHistoryOther || '';
   const allFamilyHistory = [...familyHistory];
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/SummaryRoutes.js:45:30
 
   // ... (family history logic) ...
   const familyHistory = appointment.familyHistory || [];
-  const familyHistoryOther = appointment.familyHistoryOther || '';
+  const familyHistoryOther = false;
   const allFamilyHistory = [...familyHistory];
   if (familyHistoryOther) allFamilyHistory.push(familyHistoryOther);
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Stroke'

[Killed] LogicalOperator
routes/SummaryRoutes.js:45:30
 
   // ... (family history logic) ...
   const familyHistory = appointment.familyHistory || [];
-  const familyHistoryOther = appointment.familyHistoryOther || '';
+  const familyHistoryOther = appointment.familyHistoryOther && '';
   const allFamilyHistory = [...familyHistory];
   if (familyHistoryOther) allFamilyHistory.push(familyHistoryOther);
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Stroke'

[Killed] ConditionalExpression
routes/SummaryRoutes.js:47:7
   const familyHistory = appointment.familyHistory || [];
   const familyHistoryOther = appointment.familyHistoryOther || '';
   const allFamilyHistory = [...familyHistory];
-  if (familyHistoryOther) allFamilyHistory.push(familyHistoryOther);
+  if (false) allFamilyHistory.push(familyHistoryOther);
 
   // ... (age calculation from previous fix) ...
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Stroke'

[Survived] ConditionalExpression
routes/SummaryRoutes.js:47:7
   const familyHistory = appointment.familyHistory || [];
   const familyHistoryOther = appointment.familyHistoryOther || '';
   const allFamilyHistory = [...familyHistory];
-  if (familyHistoryOther) allFamilyHistory.push(familyHistoryOther);
+  if (true) allFamilyHistory.push(familyHistoryOther);
 
   // ... (age calculation from previous fix) ...

[Survived] BlockStatement
routes/SummaryRoutes.js:51:30
 
   // ... (age calculation from previous fix) ...
   let age = 'Not provided';
-  if (appointment.birthDate) {
-     // ... (age logic)
-     const birthDate = new Date(appointment.birthDate);
-     const today = new Date();
-     age = today.getFullYear() - birthDate.getFullYear();
-     // ... (rest of age calculation)
-  }
+  if (appointment.birthDate) {}
 
   return `

[Survived] ConditionalExpression
routes/SummaryRoutes.js:51:7
 
   // ... (age calculation from previous fix) ...
   let age = 'Not provided';
-  if (appointment.birthDate) {
+  if (false) {
      // ... (age logic)
      const birthDate = new Date(appointment.birthDate);

[Survived] ArithmeticOperator
routes/SummaryRoutes.js:55:12
      // ... (age logic)
      const birthDate = new Date(appointment.birthDate);
      const today = new Date();
-     age = today.getFullYear() - birthDate.getFullYear();
+     age = today.getFullYear() + birthDate.getFullYear();
      // ... (rest of age calculation)
   }

[Survived] ConditionalExpression
routes/SummaryRoutes.js:63:11
 PATIENT CONSULTATION SUMMARY REQUEST:
 
 PATIENT BASIC DETAILS:
-- Name: ${appointment.patientNameForVisit || 'Not provided'}
+- Name: ${false}
 - Age: ${age}
 - Sex: ${appointment.sex || 'Not provided'}

[Survived] LogicalOperator
routes/SummaryRoutes.js:63:11
 PATIENT CONSULTATION SUMMARY REQUEST:
 
 PATIENT BASIC DETAILS:
-- Name: ${appointment.patientNameForVisit || 'Not provided'}
+- Name: ${appointment.patientNameForVisit && 'Not provided'}
 - Age: ${age}
 - Sex: ${appointment.sex || 'Not provided'}

[Killed] ConditionalExpression
routes/SummaryRoutes.js:65:10
 PATIENT BASIC DETAILS:
 - Name: ${appointment.patientNameForVisit || 'Not provided'}
 - Age: ${age}
-- Sex: ${appointment.sex || 'Not provided'}
+- Sex: ${false}
 
 CHIEF COMPLAINT:
killedBy: GET /api/summary/appointment/:appointmentId applies fallback text for empty lists and legacy symptom string
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Sex: Not provided'

[Killed] LogicalOperator
routes/SummaryRoutes.js:65:10
 PATIENT BASIC DETAILS:
 - Name: ${appointment.patientNameForVisit || 'Not provided'}
 - Age: ${age}
-- Sex: ${appointment.sex || 'Not provided'}
+- Sex: ${appointment.sex && 'Not provided'}
 
 CHIEF COMPLAINT:
killedBy: GET /api/summary/appointment/:appointmentId applies fallback text for empty lists and legacy symptom string
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Sex: Not provided'

[Survived] ConditionalExpression
routes/SummaryRoutes.js:68:3
 - Sex: ${appointment.sex || 'Not provided'}
 
 CHIEF COMPLAINT:
-${appointment.primaryReason || appointment.reasonForVisit || 'Not specified'}  <-- FIX 2: Check both fields
+${true}  <-- FIX 2: Check both fields
 
 CURRENT SYMPTOMS:

[Survived] LogicalOperator
routes/SummaryRoutes.js:68:3
 - Sex: ${appointment.sex || 'Not provided'}
 
 CHIEF COMPLAINT:
-${appointment.primaryReason || appointment.reasonForVisit || 'Not specified'}  <-- FIX 2: Check both fields
+${(appointment.primaryReason || appointment.reasonForVisit) && 'Not specified'}  <-- FIX 2: Check both fields
 
 CURRENT SYMPTOMS:

[Killed] ArrowFunction
routes/SummaryRoutes.js:71:44
 ${appointment.primaryReason || appointment.reasonForVisit || 'Not specified'}  <-- FIX 2: Check both fields
 
 CURRENT SYMPTOMS:
-${allSymptoms.length > 0 ? allSymptoms.map(s => `- ${s}`).join('\n') : '- None reported'}
+${allSymptoms.length > 0 ? allSymptoms.map(() => undefined).join('\n') : '- None reported'}
 
 SYMPTOM BEGINNING:
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Light headedness'

[Killed] ConditionalExpression
routes/SummaryRoutes.js:71:3
 ${appointment.primaryReason || appointment.reasonForVisit || 'Not specified'}  <-- FIX 2: Check both fields
 
 CURRENT SYMPTOMS:
-${allSymptoms.length > 0 ? allSymptoms.map(s => `- ${s}`).join('\n') : '- None reported'}
+${false ? allSymptoms.map(s => `- ${s}`).join('\n') : '- None reported'}
 
 SYMPTOM BEGINNING:
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Light headedness'

[Survived] LogicalOperator
routes/SummaryRoutes.js:74:3
 ${allSymptoms.length > 0 ? allSymptoms.map(s => `- ${s}`).join('\n') : '- None reported'}
 
 SYMPTOM BEGINNING:
-${appointment.symptomsBegin || 'Not specified'}
+${appointment.symptomsBegin && 'Not specified'}
   
 SEVERE SYMPTOMS :

[Survived] ConditionalExpression
routes/SummaryRoutes.js:74:3
 ${allSymptoms.length > 0 ? allSymptoms.map(s => `- ${s}`).join('\n') : '- None reported'}
 
 SYMPTOM BEGINNING:
-${appointment.symptomsBegin || 'Not specified'}
+${true}
   
 SEVERE SYMPTOMS :

[Killed] ArrowFunction
routes/SummaryRoutes.js:77:50
 ${appointment.symptomsBegin || 'Not specified'}
   
 SEVERE SYMPTOMS :
-${severeSymptoms.length > 0 ? severeSymptoms.map(s => `- ${s}`).join('\n') : '- None reported'}
+${severeSymptoms.length > 0 ? severeSymptoms.map(() => undefined).join('\n') : '- None reported'}
 
 MEDICAL HISTORY:
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Loss of consciousness'

[Killed] EqualityOperator
routes/SummaryRoutes.js:77:3
 ${appointment.symptomsBegin || 'Not specified'}
   
 SEVERE SYMPTOMS :
-${severeSymptoms.length > 0 ? severeSymptoms.map(s => `- ${s}`).join('\n') : '- None reported'}
+${severeSymptoms.length <= 0 ? severeSymptoms.map(s => `- ${s}`).join('\n') : '- None reported'}
 
 MEDICAL HISTORY:
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Loss of consciousness'

[Killed] EqualityOperator
routes/SummaryRoutes.js:81:3
 
 MEDICAL HISTORY:
 Pre-existing Conditions:
-${allConditions.length > 0 ? allConditions.map(c => `- ${c}`).join('\n') : '- None'}
+${allConditions.length <= 0 ? allConditions.map(c => `- ${c}`).join('\n') : '- None'}
 
 Past Surgeries/Hospitalizations:
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Thyroid disorder'

[Killed] ArrowFunction
routes/SummaryRoutes.js:81:48
 
 MEDICAL HISTORY:
 Pre-existing Conditions:
-${allConditions.length > 0 ? allConditions.map(c => `- ${c}`).join('\n') : '- None'}
+${allConditions.length > 0 ? allConditions.map(() => undefined).join('\n') : '- None'}
 
 Past Surgeries/Hospitalizations:
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Thyroid disorder'

[Survived] ConditionalExpression
routes/SummaryRoutes.js:84:3
 ${allConditions.length > 0 ? allConditions.map(c => `- ${c}`).join('\n') : '- None'}
 
 Past Surgeries/Hospitalizations:
-${appointment.pastSurgeries || 'None'}
+${true}
 
 Family Medical History:

[Survived] LogicalOperator
routes/SummaryRoutes.js:84:3
 ${allConditions.length > 0 ? allConditions.map(c => `- ${c}`).join('\n') : '- None'}
 
 Past Surgeries/Hospitalizations:
-${appointment.pastSurgeries || 'None'}
+${appointment.pastSurgeries && 'None'}
 
 Family Medical History:

[Killed] EqualityOperator
routes/SummaryRoutes.js:87:3
 ${appointment.pastSurgeries || 'None'}
 
 Family Medical History:
-${allFamilyHistory.length > 0 ? allFamilyHistory.map(h => `- ${h}`).join('\n') : '- None'}
+${allFamilyHistory.length <= 0 ? allFamilyHistory.map(h => `- ${h}`).join('\n') : '- None'}
 
 Current Medications:
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Stroke'

[Killed] ConditionalExpression
routes/SummaryRoutes.js:87:3
 ${appointment.pastSurgeries || 'None'}
 
 Family Medical History:
-${allFamilyHistory.length > 0 ? allFamilyHistory.map(h => `- ${h}`).join('\n') : '- None'}
+${false ? allFamilyHistory.map(h => `- ${h}`).join('\n') : '- None'}
 
 Current Medications:
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Stroke'

[Survived] LogicalOperator
routes/SummaryRoutes.js:90:3
 ${allFamilyHistory.length > 0 ? allFamilyHistory.map(h => `- ${h}`).join('\n') : '- None'}
 
 Current Medications:
-${appointment.medications || 'None'}
+${appointment.medications && 'None'}
 
 Allergies:

[Survived] ConditionalExpression
routes/SummaryRoutes.js:90:3
 ${allFamilyHistory.length > 0 ? allFamilyHistory.map(h => `- ${h}`).join('\n') : '- None'}
 
 Current Medications:
-${appointment.medications || 'None'}
+${true}
 
 Allergies:

[Survived] ConditionalExpression
routes/SummaryRoutes.js:93:3
 ${appointment.medications || 'None'}
 
 Allergies:
-${appointment.allergies || 'None'}
+${false}
 `;
 };

[Survived] LogicalOperator
routes/SummaryRoutes.js:93:3
 ${appointment.medications || 'None'}
 
 Allergies:
-${appointment.allergies || 'None'}
+${appointment.allergies && 'None'}
 `;
 };

[Killed] BlockStatement
routes/SummaryRoutes.js:112:7
 
 Keep it professional and concise.`;
 
-  try {
-    const chatCompletion = await groq.chat.completions.create({
-      messages: [{ role: 'user', content: prompt }],
-      model: 'llama-3.3-70b-versatile',
-      temperature: 0,
-    });
-
-    return chatCompletion.choices[0]?.message?.content || 'Unable to generate summary';
-  } catch (error) {
+  try {} catch (error) {
     console.error('Groq API Error:', error);
     throw error;
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
routes/SummaryRoutes.js:113:63
 Keep it professional and concise.`;
 
   try {
-    const chatCompletion = await groq.chat.completions.create({
-      messages: [{ role: 'user', content: prompt }],
-      model: 'llama-3.3-70b-versatile',
-      temperature: 0,
-    });
+    const chatCompletion = await groq.chat.completions.create({});
 
     return chatCompletion.choices[0]?.message?.content || 'Unable to generate summary';
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ObjectLiteral
routes/SummaryRoutes.js:114:18
 
   try {
     const chatCompletion = await groq.chat.completions.create({
-      messages: [{ role: 'user', content: prompt }],
+      messages: [{}],
       model: 'llama-3.3-70b-versatile',
       temperature: 0,
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] OptionalChaining
routes/SummaryRoutes.js:119:12
       temperature: 0,
     });
 
-    return chatCompletion.choices[0]?.message?.content || 'Unable to generate summary';
+    return chatCompletion.choices[0].message?.content || 'Unable to generate summary';
   } catch (error) {
     console.error('Groq API Error:', error);
killedBy: GET /api/summary/appointment/:appointmentId falls back to default summary text when Groq returns no choices
statusReason: expected 500 to be 200 // Object.is equality

[Killed] LogicalOperator
routes/SummaryRoutes.js:119:12
       temperature: 0,
     });
 
-    return chatCompletion.choices[0]?.message?.content || 'Unable to generate summary';
+    return chatCompletion.choices[0]?.message?.content && 'Unable to generate summary';
   } catch (error) {
     console.error('Groq API Error:', error);
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 'Unable to generate summary' to be 'AI summary output' // Object.is equality

[Killed] BlockStatement
routes/SummaryRoutes.js:120:19
     });
 
     return chatCompletion.choices[0]?.message?.content || 'Unable to generate summary';
-  } catch (error) {
-    console.error('Groq API Error:', error);
-    throw error;
-  }
+  } catch (error) {}
 };
 
killedBy: GET /api/summary/appointment/:appointmentId preserves error message when Groq throws validation issue
statusReason: expected 200 to be 500 // Object.is equality

[Survived] StringLiteral
routes/SummaryRoutes.js:121:19
 
     return chatCompletion.choices[0]?.message?.content || 'Unable to generate summary';
   } catch (error) {
-    console.error('Groq API Error:', error);
+    console.error("", error);
     throw error;
   }

[Killed] BooleanLiteral
routes/SummaryRoutes.js:130:9
   try {
     const appointment = await Appointment.findById(req.params.appointmentId);
     
-    if (!appointment) {
+    if (appointment) {
       return res.status(404).json({ message: 'Appointment not found' });
     }
killedBy: GET /api/summary/appointment/:appointmentId returns 404 when appointment does not exist
statusReason: expected 500 to be 404 // Object.is equality

[Killed] BlockStatement
routes/SummaryRoutes.js:130:23
   try {
     const appointment = await Appointment.findById(req.params.appointmentId);
     
-    if (!appointment) {
-      return res.status(404).json({ message: 'Appointment not found' });
-    }
+    if (!appointment) {}
 
     // Check if summary already exists
killedBy: GET /api/summary/appointment/:appointmentId returns 404 when appointment does not exist
statusReason: expected 500 to be 404 // Object.is equality

[Killed] ObjectLiteral
routes/SummaryRoutes.js:131:35
     const appointment = await Appointment.findById(req.params.appointmentId);
     
     if (!appointment) {
-      return res.status(404).json({ message: 'Appointment not found' });
+      return res.status(404).json({});
     }
 
killedBy: GET /api/summary/appointment/:appointmentId returns 404 when appointment does not exist
statusReason: expected undefined to be 'Appointment not found' // Object.is equality

[Killed] StringLiteral
routes/SummaryRoutes.js:131:46
     const appointment = await Appointment.findById(req.params.appointmentId);
     
     if (!appointment) {
-      return res.status(404).json({ message: 'Appointment not found' });
+      return res.status(404).json({ message: "" });
     }
 
killedBy: GET /api/summary/appointment/:appointmentId returns 404 when appointment does not exist
statusReason: expected '' to be 'Appointment not found' // Object.is equality

[Killed] BlockStatement
routes/SummaryRoutes.js:135:36
     }
 
     // Check if summary already exists
-    if (appointment.doctorSummary) {
-      return res.json({
-        success: true,
-        summary: appointment.doctorSummary,
-        cached: true
-      });
-    }
+    if (appointment.doctorSummary) {}
 
     // Generate new summary
killedBy: GET /api/summary/appointment/:appointmentId returns cached summary and skips Groq call when already stored
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/SummaryRoutes.js:135:9
     }
 
     // Check if summary already exists
-    if (appointment.doctorSummary) {
+    if (true) {
       return res.json({
         success: true,
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
routes/SummaryRoutes.js:137:18
     // Check if summary already exists
     if (appointment.doctorSummary) {
       return res.json({
-        success: true,
+        success: false,
         summary: appointment.doctorSummary,
         cached: true

[Killed] BooleanLiteral
routes/SummaryRoutes.js:139:17
       return res.json({
         success: true,
         summary: appointment.doctorSummary,
-        cached: true
+        cached: false
       });
     }
killedBy: GET /api/summary/appointment/:appointmentId returns cached summary and skips Groq call when already stored
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
routes/SummaryRoutes.js:153:16
     await appointment.save();
 
     res.json({
-      success: true,
+      success: false,
       summary: summary,
       cached: false
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected false to be true // Object.is equality
