[Survived] BooleanLiteral
routes/auth.js:274:21
 router.get('/google/callback',
   passport.authenticate('google', {
     failureRedirect: 'https://smart-healthcare-appointment-and-triage.onrender.com/login?error=google_failed', 
-    failureMessage: true,
+    failureMessage: false,
     session: false 
   }),

[Survived] BooleanLiteral
routes/auth.js:275:14
   passport.authenticate('google', {
     failureRedirect: 'https://smart-healthcare-appointment-and-triage.onrender.com/login?error=google_failed', 
     failureMessage: true,
-    session: false 
+    session: true 
   }),
   (req, res) => {

[Killed] BlockStatement
routes/auth.js:277:17
     failureMessage: true,
     session: false 
   }),
-  (req, res) => {
-    const user = req.user;
-    const userType = user.userType; 
-
-    const token = jwt.sign(
-      { userId: user.id, userType: userType },
-      process.env.JWT_SECRET,
-      { expiresIn: '1h' }
-    );
-
-    let redirectPath;
-    if (!user.isProfileComplete) {
-      redirectPath = '/complete-profile'; 
-    } else {
-      switch (userType) {
-        case 'doctor': redirectPath = '/doctor/dashboard'; break;
-        case 'patient': redirectPath = '/patient/dashboard'; break;
-        case 'admin': redirectPath = '/admin/dashboard'; break; 
-        default: redirectPath = '/'; 
-      }
-    }
-
-    res.redirect(`https://smart-healthcare-appointment-and-triage.onrender.com/auth/callback?token=${token}&userType=${userType}&next=${encodeURIComponent(redirectPath)}`);
-  }
+  (req, res) => {}
 );
 
killedBy: Auth Routes GET /google/callback should handle Google callback with complete profile
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/auth.js:284:20
     const token = jwt.sign(
       { userId: user.id, userType: userType },
       process.env.JWT_SECRET,
-      { expiresIn: '1h' }
+      { expiresIn: "" }
     );
 
killedBy: Auth Routes GET /google/callback should handle Google callback with complete profile
statusReason: expected 500 to be 302 // Object.is equality

[Killed] BlockStatement
routes/auth.js:288:34
     );
 
     let redirectPath;
-    if (!user.isProfileComplete) {
-      redirectPath = '/complete-profile'; 
-    } else {
+    if (!user.isProfileComplete) {} else {
       switch (userType) {
         case 'doctor': redirectPath = '/doctor/dashboard'; break;
killedBy: Auth Routes GET /google/callback should redirect to complete profile for incomplete user
statusReason: expected 'https://smart-healthcare-appointment-…' to contain 'complete-profile'

[Killed] ConditionalExpression
routes/auth.js:288:9
     );
 
     let redirectPath;
-    if (!user.isProfileComplete) {
+    if (true) {
       redirectPath = '/complete-profile'; 
     } else {
killedBy: Auth Routes GET /google/callback should handle Google callback with complete profile
statusReason: expected 'https://smart-healthcare-appointment-…' to contain 'dashboard'

[Killed] StringLiteral
routes/auth.js:289:22
 
     let redirectPath;
     if (!user.isProfileComplete) {
-      redirectPath = '/complete-profile'; 
+      redirectPath = ""; 
     } else {
       switch (userType) {
killedBy: Auth Routes GET /google/callback should redirect to complete profile for incomplete user
statusReason: expected 'https://smart-healthcare-appointment-…' to contain 'complete-profile'

[Killed] BlockStatement
routes/auth.js:290:12
     let redirectPath;
     if (!user.isProfileComplete) {
       redirectPath = '/complete-profile'; 
-    } else {
-      switch (userType) {
-        case 'doctor': redirectPath = '/doctor/dashboard'; break;
-        case 'patient': redirectPath = '/patient/dashboard'; break;
-        case 'admin': redirectPath = '/admin/dashboard'; break; 
-        default: redirectPath = '/'; 
-      }
-    }
+    } else {}
 
     res.redirect(`https://smart-healthcare-appointment-and-triage.onrender.com/auth/callback?token=${token}&userType=${userType}&next=${encodeURIComponent(redirectPath)}`);
killedBy: Auth Routes GET /google/callback should handle Google callback with complete profile
statusReason: expected 'https://smart-healthcare-appointment-…' to contain 'dashboard'

[NoCoverage] ConditionalExpression
routes/auth.js:292:9
       redirectPath = '/complete-profile'; 
     } else {
       switch (userType) {
-        case 'doctor': redirectPath = '/doctor/dashboard'; break;
+        case 'doctor':
         case 'patient': redirectPath = '/patient/dashboard'; break;
         case 'admin': redirectPath = '/admin/dashboard'; break; 

[NoCoverage] StringLiteral
routes/auth.js:292:39
       redirectPath = '/complete-profile'; 
     } else {
       switch (userType) {
-        case 'doctor': redirectPath = '/doctor/dashboard'; break;
+        case 'doctor': redirectPath = ""; break;
         case 'patient': redirectPath = '/patient/dashboard'; break;
         case 'admin': redirectPath = '/admin/dashboard'; break; 

[Survived] ConditionalExpression
routes/auth.js:293:9
     } else {
       switch (userType) {
         case 'doctor': redirectPath = '/doctor/dashboard'; break;
-        case 'patient': redirectPath = '/patient/dashboard'; break;
+        case 'patient':
         case 'admin': redirectPath = '/admin/dashboard'; break; 
         default: redirectPath = '/'; 

[Killed] StringLiteral
routes/auth.js:293:14
     } else {
       switch (userType) {
         case 'doctor': redirectPath = '/doctor/dashboard'; break;
-        case 'patient': redirectPath = '/patient/dashboard'; break;
+        case "": redirectPath = '/patient/dashboard'; break;
         case 'admin': redirectPath = '/admin/dashboard'; break; 
         default: redirectPath = '/'; 
killedBy: Auth Routes GET /google/callback should handle Google callback with complete profile
statusReason: expected 'https://smart-healthcare-appointment-…' to contain 'dashboard'

[NoCoverage] ConditionalExpression
routes/auth.js:294:9
       switch (userType) {
         case 'doctor': redirectPath = '/doctor/dashboard'; break;
         case 'patient': redirectPath = '/patient/dashboard'; break;
-        case 'admin': redirectPath = '/admin/dashboard'; break; 
+        case 'admin': 
         default: redirectPath = '/'; 
       }

[NoCoverage] ConditionalExpression
routes/auth.js:295:9
         case 'doctor': redirectPath = '/doctor/dashboard'; break;
         case 'patient': redirectPath = '/patient/dashboard'; break;
         case 'admin': redirectPath = '/admin/dashboard'; break; 
-        default: redirectPath = '/'; 
+        default: 
       }
     }
