[Killed] BooleanLiteral
routes/SummaryRoutes.js:155:15
     res.json({
       success: true,
       summary: summary,
-      cached: false
+      cached: true
     });
 
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
routes/SummaryRoutes.js:158:19
       cached: false
     });
 
-  } catch (error) {
-    console.error('Error generating summary:', error);
-    res.status(500).json({ 
-      success: false,
-      message: 'Failed to generate summary',
-      error: error.message 
-    });
-  }
+  } catch (error) {}
 });
 
killedBy: GET /api/summary/appointment/:appointmentId applies fallback text for empty lists and legacy symptom string
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
routes/SummaryRoutes.js:160:26
 
   } catch (error) {
     console.error('Error generating summary:', error);
-    res.status(500).json({ 
-      success: false,
-      message: 'Failed to generate summary',
-      error: error.message 
-    });
+    res.status(500).json({});
   }
 });
killedBy: GET /api/summary/appointment/:appointmentId preserves error message when Groq throws validation issue
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
routes/SummaryRoutes.js:161:16
   } catch (error) {
     console.error('Error generating summary:', error);
     res.status(500).json({ 
-      success: false,
+      success: true,
       message: 'Failed to generate summary',
       error: error.message 
killedBy: GET /api/summary/appointment/:appointmentId preserves error message when Groq throws validation issue
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
routes/SummaryRoutes.js:168:38
   }
 });
 
-router.__setGroqClient = (client) => {
-  groq = client;
-};
+router.__setGroqClient = (client) => {};
 
 router.__resetGroqClient = () => {
killedBy: GET /api/summary/appointment/:appointmentId generates and caches AI summary for rich clinical data
statusReason: expected 500 to be 200 // Object.is equality

[Survived] BlockStatement
routes/SummaryRoutes.js:172:34
   groq = client;
 };
 
-router.__resetGroqClient = () => {
-  groq = createGroqClient();
-};
+router.__resetGroqClient = () => {};
 
 module.exports = router;
