[Killed] BooleanLiteral
routes/appointments.js:22:9
   try {
     const { doctorId } = req.params;
     const doctor = await Doctor.findById(doctorId);
-    if (!doctor) {
+    if (doctor) {
       return res.status(404).json({ message: 'Doctor not found.' });
     }
killedBy: Appointment Routes GET /available-slots/:doctorId should return available slots for a doctor
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:22:9
   try {
     const { doctorId } = req.params;
     const doctor = await Doctor.findById(doctorId);
-    if (!doctor) {
+    if (false) {
       return res.status(404).json({ message: 'Doctor not found.' });
     }
killedBy: Appointment Routes GET /available-slots/:doctorId should return 404 if doctor not found
statusReason: expected 500 to be 404 // Object.is equality

[Survived] StringLiteral
routes/appointments.js:23:46
     const { doctorId } = req.params;
     const doctor = await Doctor.findById(doctorId);
     if (!doctor) {
-      return res.status(404).json({ message: 'Doctor not found.' });
+      return res.status(404).json({ message: "" });
     }
 

[Survived] BlockStatement
routes/appointments.js:32:39
     });
 
     const bookedSlots = new Set();
-    bookedAppointments.forEach(apt => {
-      const dateTimeString = `${new Date(apt.date).toDateString()}_${apt.time}`;
-      bookedSlots.add(dateTimeString);
-    });
+    bookedAppointments.forEach(apt => {});
 
     const blockedTimes = doctor.blockedTimes || [];

[Killed] ConditionalExpression
routes/appointments.js:37:26
       bookedSlots.add(dateTimeString);
     });
 
-    const blockedTimes = doctor.blockedTimes || [];
+    const blockedTimes = false;
 
     const availableSlots = [];
killedBy: Appointment Routes GET /available-slots/:doctorId should return available slots for a doctor
statusReason: expected 500 to be 200 // Object.is equality

[Killed] LogicalOperator
routes/appointments.js:37:26
       bookedSlots.add(dateTimeString);
     });
 
-    const blockedTimes = doctor.blockedTimes || [];
+    const blockedTimes = doctor.blockedTimes && [];
 
     const availableSlots = [];
killedBy: Appointment Routes GET /available-slots/:doctorId should respect blocked time boundaries using slotTime comparison
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
routes/appointments.js:41:24
 
     const availableSlots = [];
     const slotDuration = 60; 
-    const daysOfWeek = ["sunday", "monday", "tuesday", "wednesday", "thursday", "friday", "saturday"];
+    const daysOfWeek = [];
     const today = new Date();
 
killedBy: Appointment Routes GET /available-slots/:doctorId should return available slots for a doctor
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
routes/appointments.js:41:35
 
     const availableSlots = [];
     const slotDuration = 60; 
-    const daysOfWeek = ["sunday", "monday", "tuesday", "wednesday", "thursday", "friday", "saturday"];
+    const daysOfWeek = ["sunday", "", "tuesday", "wednesday", "thursday", "friday", "saturday"];
     const today = new Date();
 
killedBy: Appointment Routes GET /available-slots/:doctorId should support workingHours stored as a Map (exercise .get(dayKey) path)
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
routes/appointments.js:44:21
     const daysOfWeek = ["sunday", "monday", "tuesday", "wednesday", "thursday", "friday", "saturday"];
     const today = new Date();
 
-    for (let i = 0; i < 14; i++) { 
+    for (let i = 0; false; i++) { 
       const date = new Date(today);
       date.setDate(today.getDate() + i);
killedBy: Appointment Routes GET /available-slots/:doctorId should return available slots for a doctor
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
routes/appointments.js:44:21
     const daysOfWeek = ["sunday", "monday", "tuesday", "wednesday", "thursday", "friday", "saturday"];
     const today = new Date();
 
-    for (let i = 0; i < 14; i++) { 
+    for (let i = 0; i >= 14; i++) { 
       const date = new Date(today);
       date.setDate(today.getDate() + i);
killedBy: Appointment Routes GET /available-slots/:doctorId should return available slots for a doctor
statusReason: expected 0 to be greater than 0

[Killed] MethodExpression
routes/appointments.js:46:7
 
     for (let i = 0; i < 14; i++) { 
       const date = new Date(today);
-      date.setDate(today.getDate() + i);
+      date.setTime(today.getDate() + i);
       
       const dayKey = daysOfWeek[date.getDay()];
killedBy: Appointment Routes GET /available-slots/:doctorId should respect blocked time boundaries using slotTime comparison
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
routes/appointments.js:46:20
 
     for (let i = 0; i < 14; i++) { 
       const date = new Date(today);
-      date.setDate(today.getDate() + i);
+      date.setDate(today.getDate() - i);
       
       const dayKey = daysOfWeek[date.getDay()];

[Killed] ConditionalExpression
routes/appointments.js:51:11
       const dayKey = daysOfWeek[date.getDay()];
       const daySchedule = doctor.workingHours.get(dayKey);
 
-      if (daySchedule && daySchedule.enabled) {
+      if (true) {
         const [startHour, startMin] = daySchedule.start.split(':').map(Number);
         const [endHour, endMin] = daySchedule.end.split(':').map(Number);
killedBy: Appointment Routes GET /available-slots/:doctorId should return available slots for a doctor
statusReason: expected 500 to be 200 // Object.is equality

[Killed] LogicalOperator
routes/appointments.js:51:11
       const dayKey = daysOfWeek[date.getDay()];
       const daySchedule = doctor.workingHours.get(dayKey);
 
-      if (daySchedule && daySchedule.enabled) {
+      if (daySchedule || daySchedule.enabled) {
         const [startHour, startMin] = daySchedule.start.split(':').map(Number);
         const [endHour, endMin] = daySchedule.end.split(':').map(Number);
killedBy: Appointment Routes GET /available-slots/:doctorId should return available slots for a doctor
statusReason: expected 500 to be 200 // Object.is equality

[Killed] MethodExpression
routes/appointments.js:55:36
         const [startHour, startMin] = daySchedule.start.split(':').map(Number);
         const [endHour, endMin] = daySchedule.end.split(':').map(Number);
 
-        const startTime = new Date(date.setHours(startHour, startMin, 0, 0));
+        const startTime = new Date(date.setMinutes(startHour, startMin, 0, 0));
         const endTime = new Date(date.setHours(endHour, endMin, 0, 0));
 
killedBy: Appointment Routes GET /available-slots/:doctorId should respect blocked time boundaries using slotTime comparison
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
routes/appointments.js:56:34
         const [endHour, endMin] = daySchedule.end.split(':').map(Number);
 
         const startTime = new Date(date.setHours(startHour, startMin, 0, 0));
-        const endTime = new Date(date.setHours(endHour, endMin, 0, 0));
+        const endTime = new Date(date.setMinutes(endHour, endMin, 0, 0));
 
         let currentSlotTime = new Date(startTime);
killedBy: Appointment Routes GET /available-slots/:doctorId should respect blocked time boundaries using slotTime comparison
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
routes/appointments.js:59:16
         const endTime = new Date(date.setHours(endHour, endMin, 0, 0));
 
         let currentSlotTime = new Date(startTime);
-        while (currentSlotTime < endTime) {
+        while (currentSlotTime >= endTime) {
           const timeString = currentSlotTime.toLocaleTimeString('en-US', {
             hour: '2-digit',
killedBy: Appointment Routes GET /available-slots/:doctorId should return available slots for a doctor
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
routes/appointments.js:59:16
         const endTime = new Date(date.setHours(endHour, endMin, 0, 0));
 
         let currentSlotTime = new Date(startTime);
-        while (currentSlotTime < endTime) {
+        while (false) {
           const timeString = currentSlotTime.toLocaleTimeString('en-US', {
             hour: '2-digit',
killedBy: Appointment Routes GET /available-slots/:doctorId should return available slots for a doctor
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
routes/appointments.js:61:19
         let currentSlotTime = new Date(startTime);
         while (currentSlotTime < endTime) {
           const timeString = currentSlotTime.toLocaleTimeString('en-US', {
-            hour: '2-digit',
+            hour: "",
             minute: '2-digit',
             hour12: true
killedBy: Appointment Routes GET /available-slots/:doctorId should return available slots for a doctor
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BooleanLiteral
routes/appointments.js:63:21
           const timeString = currentSlotTime.toLocaleTimeString('en-US', {
             hour: '2-digit',
             minute: '2-digit',
-            hour12: true
+            hour12: false
           });
           const dateString = currentSlotTime.toDateString();
killedBy: Appointment Routes Extra mutation-killing tests available-slots time string must include AM/PM (hour12 true behavior)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
routes/appointments.js:67:27
           });
           const dateString = currentSlotTime.toDateString();
           const dateTimeString = `${dateString}_${timeString}`;
-          let isBlocked = false;
+          let isBlocked = true;
           for (const block of blockedTimes) {
             const blockDate = new Date(block.date).toDateString();
killedBy: Appointment Routes GET /available-slots/:doctorId should return available slots for a doctor
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
routes/appointments.js:68:45
           const dateString = currentSlotTime.toDateString();
           const dateTimeString = `${dateString}_${timeString}`;
           let isBlocked = false;
-          for (const block of blockedTimes) {
-            const blockDate = new Date(block.date).toDateString();
-            if (blockDate === dateString) {
-              const slotTime = currentSlotTime.toTimeString().substring(0, 5); // "HH:MM"
-              if (slotTime >= block.startTime && slotTime < block.endTime) {
-                isBlocked = true;
-                break;
-              }
-            }
-          }
+          for (const block of blockedTimes) {}
           if (!bookedSlots.has(dateTimeString) && !isBlocked) {
             availableSlots.push({
killedBy: Appointment Routes GET /available-slots/:doctorId should respect blocked time boundaries using slotTime comparison
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:70:17
           let isBlocked = false;
           for (const block of blockedTimes) {
             const blockDate = new Date(block.date).toDateString();
-            if (blockDate === dateString) {
+            if (false) {
               const slotTime = currentSlotTime.toTimeString().substring(0, 5); // "HH:MM"
               if (slotTime >= block.startTime && slotTime < block.endTime) {
killedBy: Appointment Routes GET /available-slots/:doctorId should respect blocked time boundaries using slotTime comparison
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
routes/appointments.js:70:43
           let isBlocked = false;
           for (const block of blockedTimes) {
             const blockDate = new Date(block.date).toDateString();
-            if (blockDate === dateString) {
-              const slotTime = currentSlotTime.toTimeString().substring(0, 5); // "HH:MM"
-              if (slotTime >= block.startTime && slotTime < block.endTime) {
-                isBlocked = true;
-                break;
-              }
-            }
+            if (blockDate === dateString) {}
           }
           if (!bookedSlots.has(dateTimeString) && !isBlocked) {
killedBy: Appointment Routes GET /available-slots/:doctorId should respect blocked time boundaries using slotTime comparison
statusReason: expected true to be false // Object.is equality

[Survived] MethodExpression
routes/appointments.js:71:32
           for (const block of blockedTimes) {
             const blockDate = new Date(block.date).toDateString();
             if (blockDate === dateString) {
-              const slotTime = currentSlotTime.toTimeString().substring(0, 5); // "HH:MM"
+              const slotTime = currentSlotTime.toTimeString(); // "HH:MM"
               if (slotTime >= block.startTime && slotTime < block.endTime) {
                 isBlocked = true;

[Killed] LogicalOperator
routes/appointments.js:72:19
             const blockDate = new Date(block.date).toDateString();
             if (blockDate === dateString) {
               const slotTime = currentSlotTime.toTimeString().substring(0, 5); // "HH:MM"
-              if (slotTime >= block.startTime && slotTime < block.endTime) {
+              if (slotTime >= block.startTime || slotTime < block.endTime) {
                 isBlocked = true;
                 break;
killedBy: Appointment Routes GET /available-slots/:doctorId should respect blocked time boundaries using slotTime comparison
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:72:19
             const blockDate = new Date(block.date).toDateString();
             if (blockDate === dateString) {
               const slotTime = currentSlotTime.toTimeString().substring(0, 5); // "HH:MM"
-              if (slotTime >= block.startTime && slotTime < block.endTime) {
+              if (true) {
                 isBlocked = true;
                 break;
killedBy: Appointment Routes GET /available-slots/:doctorId should respect blocked time boundaries using slotTime comparison
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
routes/appointments.js:73:29
             if (blockDate === dateString) {
               const slotTime = currentSlotTime.toTimeString().substring(0, 5); // "HH:MM"
               if (slotTime >= block.startTime && slotTime < block.endTime) {
-                isBlocked = true;
+                isBlocked = false;
                 break;
               }
killedBy: Appointment Routes GET /available-slots/:doctorId should respect blocked time boundaries using slotTime comparison
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:78:15
               }
             }
           }
-          if (!bookedSlots.has(dateTimeString) && !isBlocked) {
+          if (true) {
             availableSlots.push({
               date: currentSlotTime.toISOString().split('T')[0],
killedBy: Appointment Routes GET /available-slots/:doctorId should respect blocked time boundaries using slotTime comparison
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:78:15
               }
             }
           }
-          if (!bookedSlots.has(dateTimeString) && !isBlocked) {
+          if (false) {
             availableSlots.push({
               date: currentSlotTime.toISOString().split('T')[0],
killedBy: Appointment Routes GET /available-slots/:doctorId should return available slots for a doctor
statusReason: expected 0 to be greater than 0

[Killed] ObjectLiteral
routes/appointments.js:79:33
             }
           }
           if (!bookedSlots.has(dateTimeString) && !isBlocked) {
-            availableSlots.push({
-              date: currentSlotTime.toISOString().split('T')[0],
-              time: timeString
-            });
+            availableSlots.push({});
           }
           
killedBy: Appointment Routes GET /available-slots/:doctorId should return available slots for a doctor
statusReason: expected {} to have property "date"

[Killed] StringLiteral
routes/appointments.js:80:57
           }
           if (!bookedSlots.has(dateTimeString) && !isBlocked) {
             availableSlots.push({
-              date: currentSlotTime.toISOString().split('T')[0],
+              date: currentSlotTime.toISOString().split("")[0],
               time: timeString
             });
killedBy: Appointment Routes GET /available-slots/:doctorId should respect blocked time boundaries using slotTime comparison
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
routes/appointments.js:85:11
             });
           }
           
-          currentSlotTime.setMinutes(currentSlotTime.getMinutes() + slotDuration);
+          currentSlotTime.setHours(currentSlotTime.getMinutes() + slotDuration);
         }
       }
killedBy: Appointment Routes GET /available-slots/:doctorId should respect blocked time boundaries using slotTime comparison
statusReason: expected false to be true // Object.is equality

[Timeout] ArithmeticOperator
routes/appointments.js:85:38
             });
           }
           
-          currentSlotTime.setMinutes(currentSlotTime.getMinutes() + slotDuration);
+          currentSlotTime.setMinutes(currentSlotTime.getMinutes() - slotDuration);
         }
       }

[Killed] BlockStatement
routes/appointments.js:90:17
       }
     }
     res.json(availableSlots);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 // @route   GET api/appointments/my-appointments
killedBy: Appointment Routes GET /available-slots/:doctorId should handle server errors
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/appointments.js:92:26
     res.json(availableSlots);
   } catch (err) {
     console.error(err.message);
-    res.status(500).send('Server Error');
+    res.status(500).send("");
   }
 });
killedBy: Appointment Routes GET /available-slots/:doctorId should handle server errors
statusReason: expected '' to be 'Server Error' // Object.is equality

[Killed] BlockStatement
routes/appointments.js:98:68
 // @route   GET api/appointments/my-appointments
 // @desc    Get all appointments for the logged-in patient
 // @access  Private (Patient only)
-router.get('/my-appointments', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'patient') {
-    return res.status(403).json({ message: 'Access denied. Not a patient.' });
-  }
-  try {
-    const appointments = await Appointment.find({ patient: req.user.userId })
-      .populate('doctor', 'fullName specialization')
-      .sort({ date: -1 });
-
-    res.json(appointments);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
-});
+router.get('/my-appointments', authMiddleware, async (req, res) => {});
 
 router.get('/doctor', authMiddleware, async (req, res) => {
killedBy: Appointment Routes GET /my-appointments should return appointments for logged-in patient
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/appointments.js:98:12
 // @route   GET api/appointments/my-appointments
 // @desc    Get all appointments for the logged-in patient
 // @access  Private (Patient only)
-router.get('/my-appointments', authMiddleware, async (req, res) => {
+router.get("", authMiddleware, async (req, res) => {
   if (req.user.userType !== 'patient') {
     return res.status(403).json({ message: 'Access denied. Not a patient.' });
killedBy: Appointment Routes GET /my-appointments should return appointments for logged-in patient
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:99:7
 // @desc    Get all appointments for the logged-in patient
 // @access  Private (Patient only)
 router.get('/my-appointments', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'patient') {
+  if (true) {
     return res.status(403).json({ message: 'Access denied. Not a patient.' });
   }
killedBy: Appointment Routes GET /my-appointments should return appointments for logged-in patient
statusReason: expected 403 to be 200 // Object.is equality

[Killed] EqualityOperator
routes/appointments.js:99:7
 // @desc    Get all appointments for the logged-in patient
 // @access  Private (Patient only)
 router.get('/my-appointments', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'patient') {
+  if (req.user.userType === 'patient') {
     return res.status(403).json({ message: 'Access denied. Not a patient.' });
   }
killedBy: Appointment Routes GET /my-appointments should return appointments for logged-in patient
statusReason: expected 403 to be 200 // Object.is equality

[Killed] BlockStatement
routes/appointments.js:102:7
   if (req.user.userType !== 'patient') {
     return res.status(403).json({ message: 'Access denied. Not a patient.' });
   }
-  try {
-    const appointments = await Appointment.find({ patient: req.user.userId })
-      .populate('doctor', 'fullName specialization')
-      .sort({ date: -1 });
-
-    res.json(appointments);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server Error');
killedBy: Appointment Routes GET /my-appointments should return appointments for logged-in patient
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
routes/appointments.js:103:32
     return res.status(403).json({ message: 'Access denied. Not a patient.' });
   }
   try {
-    const appointments = await Appointment.find({ patient: req.user.userId })
-      .populate('doctor', 'fullName specialization')
-      .sort({ date: -1 });
+    const appointments = await Appointment.find({
+  patient: req.user.userId
+}).populate('doctor', 'fullName specialization');
 
     res.json(appointments);
killedBy: Appointment Routes GET /my-appointments should handle server errors for my-appointments (simulate Appointment.find chain rejection)
statusReason: expected 200 to be 500 // Object.is equality

[Killed] StringLiteral
routes/appointments.js:104:17
   }
   try {
     const appointments = await Appointment.find({ patient: req.user.userId })
-      .populate('doctor', 'fullName specialization')
+      .populate("", 'fullName specialization')
       .sort({ date: -1 });
 
killedBy: Appointment Routes GET /my-appointments should return appointments for logged-in patient
statusReason: expected 500 to be 200 // Object.is equality

[Killed] UnaryOperator
routes/appointments.js:105:21
   try {
     const appointments = await Appointment.find({ patient: req.user.userId })
       .populate('doctor', 'fullName specialization')
-      .sort({ date: -1 });
+      .sort({ date: +1 });
 
     res.json(appointments);
killedBy: Appointment Routes Extra mutation-killing tests my-appointments patient endpoint should return appointments sorted descending by date
statusReason: expected 1577836800000 to be greater than 1640995200000

[Killed] BlockStatement
routes/appointments.js:108:17
       .sort({ date: -1 });
 
     res.json(appointments);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: Appointment Routes GET /my-appointments should handle server errors for my-appointments (simulate Appointment.find chain rejection)
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/appointments.js:114:59
   }
 });
 
-router.get('/doctor', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
-    return res.status(403).json({ message: 'Access denied. Not a doctor.' });
-  }
-  try {
-    const appointments = await Appointment.find({ doctor: req.user.userId })
-      .populate('patient', 'fullName email') // Get patient details
-      .sort({ date: 1 });
-    
-    // Filter out appointments where patient is null (deleted patient references)
-    const validAppointments = appointments.filter(appointment => appointment.patient);
-    
-    res.json(validAppointments);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
-});
+router.get('/doctor', authMiddleware, async (req, res) => {});
 
 // @route   POST api/appointments/book
killedBy: Appointment Routes GET /my-appointments should deny access to doctor endpoint if user is not a doctor
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/appointments.js:114:12
   }
 });
 
-router.get('/doctor', authMiddleware, async (req, res) => {
+router.get("", authMiddleware, async (req, res) => {
   if (req.user.userType !== 'doctor') {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
killedBy: Appointment Routes GET /my-appointments should deny access to doctor endpoint if user is not a doctor
statusReason: expected 404 to be 403 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:115:7
 });
 
 router.get('/doctor', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
+  if (true) {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
killedBy: Appointment Routes GET /my-appointments doctor endpoint should filter out appointments with null patient (mock Appointment.find return containing null patient)
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:115:7
 });
 
 router.get('/doctor', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
+  if (false) {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
killedBy: Appointment Routes GET /my-appointments should deny access to doctor endpoint if user is not a doctor
statusReason: expected 500 to be 403 // Object.is equality

[Killed] StringLiteral
routes/appointments.js:116:44
 
 router.get('/doctor', authMiddleware, async (req, res) => {
   if (req.user.userType !== 'doctor') {
-    return res.status(403).json({ message: 'Access denied. Not a doctor.' });
+    return res.status(403).json({ message: "" });
   }
   try {
killedBy: Appointment Routes GET /my-appointments should deny access to doctor endpoint if user is not a doctor
statusReason: expected { message: '' } to deeply equal { Object (message) }

[Killed] BlockStatement
routes/appointments.js:118:7
   if (req.user.userType !== 'doctor') {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
-  try {
-    const appointments = await Appointment.find({ doctor: req.user.userId })
-      .populate('patient', 'fullName email') // Get patient details
-      .sort({ date: 1 });
-    
-    // Filter out appointments where patient is null (deleted patient references)
-    const validAppointments = appointments.filter(appointment => appointment.patient);
-    
-    res.json(validAppointments);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server Error');
killedBy: Appointment Routes GET /my-appointments doctor endpoint should filter out appointments with null patient (mock Appointment.find return containing null patient)
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
routes/appointments.js:119:32
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
   try {
-    const appointments = await Appointment.find({ doctor: req.user.userId })
-      .populate('patient', 'fullName email') // Get patient details
-      .sort({ date: 1 });
+    const appointments = await Appointment.find({
+  doctor: req.user.userId
+}).populate('patient', 'fullName email') // Get patient details;
     
     // Filter out appointments where patient is null (deleted patient references)
killedBy: Appointment Routes GET /my-appointments doctor endpoint should filter out appointments with null patient (mock Appointment.find return containing null patient)
statusReason: expected 500 to be 200 // Object.is equality

[Killed] StringLiteral
routes/appointments.js:120:17
   }
   try {
     const appointments = await Appointment.find({ doctor: req.user.userId })
-      .populate('patient', 'fullName email') // Get patient details
+      .populate("", 'fullName email') // Get patient details
       .sort({ date: 1 });
     
killedBy: Appointment Routes GET /my-appointments should return appointments for logged-in doctor
statusReason: expected 500 to be 200 // Object.is equality
