[Killed] BlockStatement
routes/admin.js:20:15
 
     let doctorQuery = {};
     
-    if (name) {
-      doctorQuery.fullName = { $regex: '^' + name, $options: 'i' };
-    }
+    if (name) {}
     if (email) {
       doctorQuery.email = { $regex: '^' + email, $options: 'i' };
killedBy: Admin Routes (Vitest) GET /api/admin/users should filter doctors by name
statusReason: expected 2 to be 1 // Object.is equality

[Killed] StringLiteral
routes/admin.js:21:40
     let doctorQuery = {};
     
     if (name) {
-      doctorQuery.fullName = { $regex: '^' + name, $options: 'i' };
+      doctorQuery.fullName = { $regex: "" + name, $options: 'i' };
     }
     if (email) {
killedBy: Mutation Coverage Tests for admin.js Regex search pattern mutations should search doctors by name with exact regex prefix (not empty string)
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
routes/admin.js:23:9
     if (name) {
       doctorQuery.fullName = { $regex: '^' + name, $options: 'i' };
     }
-    if (email) {
+    if (true) {
       doctorQuery.email = { $regex: '^' + email, $options: 'i' };
     }
killedBy: Admin Routes (Vitest) GET /api/admin/users should return all doctors and patients
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
routes/admin.js:23:16
     if (name) {
       doctorQuery.fullName = { $regex: '^' + name, $options: 'i' };
     }
-    if (email) {
-      doctorQuery.email = { $regex: '^' + email, $options: 'i' };
-    }
+    if (email) {}
     if (license) {
       doctorQuery.licenseNumber = { $regex: '^'+license, $options: 'i' };
killedBy: Mutation Coverage Tests for admin.js Regex search pattern mutations should search doctors by email with exact regex prefix
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ObjectLiteral
routes/admin.js:24:27
       doctorQuery.fullName = { $regex: '^' + name, $options: 'i' };
     }
     if (email) {
-      doctorQuery.email = { $regex: '^' + email, $options: 'i' };
+      doctorQuery.email = {};
     }
     if (license) {
killedBy: Admin Routes (Vitest) GET /api/admin/users should filter doctors by email
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
routes/admin.js:26:18
     if (email) {
       doctorQuery.email = { $regex: '^' + email, $options: 'i' };
     }
-    if (license) {
-      doctorQuery.licenseNumber = { $regex: '^'+license, $options: 'i' };
-    }
+    if (license) {}
     if (specialization && specialization !== 'all') {
       doctorQuery.specialization = specialization;
killedBy: Mutation Coverage Tests for admin.js Regex search pattern mutations should search doctors by license with exact regex prefix
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
routes/admin.js:26:9
     if (email) {
       doctorQuery.email = { $regex: '^' + email, $options: 'i' };
     }
-    if (license) {
+    if (false) {
       doctorQuery.licenseNumber = { $regex: '^'+license, $options: 'i' };
     }
killedBy: Mutation Coverage Tests for admin.js Regex search pattern mutations should search doctors by license with exact regex prefix
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ObjectLiteral
routes/admin.js:27:35
       doctorQuery.email = { $regex: '^' + email, $options: 'i' };
     }
     if (license) {
-      doctorQuery.licenseNumber = { $regex: '^'+license, $options: 'i' };
+      doctorQuery.licenseNumber = {};
     }
     if (specialization && specialization !== 'all') {
killedBy: Admin Routes (Vitest) GET /api/admin/users should filter doctors by license number
statusReason: expected 500 to be 200 // Object.is equality

[Survived] StringLiteral
routes/admin.js:27:45
       doctorQuery.email = { $regex: '^' + email, $options: 'i' };
     }
     if (license) {
-      doctorQuery.licenseNumber = { $regex: '^'+license, $options: 'i' };
+      doctorQuery.licenseNumber = { $regex: ""+license, $options: 'i' };
     }
     if (specialization && specialization !== 'all') {

[Killed] EqualityOperator
routes/admin.js:29:27
     if (license) {
       doctorQuery.licenseNumber = { $regex: '^'+license, $options: 'i' };
     }
-    if (specialization && specialization !== 'all') {
+    if (specialization && specialization === 'all') {
       doctorQuery.specialization = specialization;
     }
killedBy: Admin Routes (Vitest) GET /api/admin/users should filter doctors by specialization
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
routes/admin.js:29:9
     if (license) {
       doctorQuery.licenseNumber = { $regex: '^'+license, $options: 'i' };
     }
-    if (specialization && specialization !== 'all') {
+    if (false) {
       doctorQuery.specialization = specialization;
     }
killedBy: Admin Routes (Vitest) GET /api/admin/users should filter doctors by specialization
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
routes/admin.js:32:19
     if (specialization && specialization !== 'all') {
       doctorQuery.specialization = specialization;
     }
-    if (status && status !== 'all') {
+    if (status && status === 'all') {
       doctorQuery.isVerified = (status === 'verified');
     }
killedBy: Admin Routes (Vitest) GET /api/admin/users should filter doctors by verification status
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
routes/admin.js:32:9
     if (specialization && specialization !== 'all') {
       doctorQuery.specialization = specialization;
     }
-    if (status && status !== 'all') {
+    if (true) {
       doctorQuery.isVerified = (status === 'verified');
     }
killedBy: Admin Routes (Vitest) GET /api/admin/users should not filter when status is "all"
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
routes/admin.js:33:33
       doctorQuery.specialization = specialization;
     }
     if (status && status !== 'all') {
-      doctorQuery.isVerified = (status === 'verified');
+      doctorQuery.isVerified = (true);
     }
 
killedBy: Mutation Coverage Tests for admin.js Query filter conditional mutations should filter by status "pending" (not verified)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
routes/admin.js:33:33
       doctorQuery.specialization = specialization;
     }
     if (status && status !== 'all') {
-      doctorQuery.isVerified = (status === 'verified');
+      doctorQuery.isVerified = (status !== 'verified');
     }
 
killedBy: Admin Routes (Vitest) GET /api/admin/users should filter doctors by verification status
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
routes/admin.js:38:22
 
     let patientQuery = {};
     
-    if (patientName) {
-      patientQuery.fullName = { $regex: '^' + patientName, $options: 'i' };
-    }
+    if (patientName) {}
     if (patientEmail) {
       patientQuery.email = { $regex: '^' + patientEmail, $options: 'i' };
killedBy: Admin Routes (Vitest) GET /api/admin/users should filter patients by name
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
routes/admin.js:38:9
 
     let patientQuery = {};
     
-    if (patientName) {
+    if (false) {
       patientQuery.fullName = { $regex: '^' + patientName, $options: 'i' };
     }
killedBy: Admin Routes (Vitest) GET /api/admin/users should filter patients by name
statusReason: expected 2 to be 1 // Object.is equality

[Killed] StringLiteral
routes/admin.js:39:70
     let patientQuery = {};
     
     if (patientName) {
-      patientQuery.fullName = { $regex: '^' + patientName, $options: 'i' };
+      patientQuery.fullName = { $regex: '^' + patientName, $options: "" };
     }
     if (patientEmail) {
killedBy: Mutation Coverage Tests for admin.js Regex search pattern mutations should verify regex options for patient name search are case-insensitive
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
routes/admin.js:41:23
     if (patientName) {
       patientQuery.fullName = { $regex: '^' + patientName, $options: 'i' };
     }
-    if (patientEmail) {
-      patientQuery.email = { $regex: '^' + patientEmail, $options: 'i' };
-    }
+    if (patientEmail) {}
     if (patientDateFrom) {
       patientQuery.createdAt = { ...patientQuery.createdAt, $gte: new Date(patientDateFrom) };
killedBy: Admin Routes (Vitest) GET /api/admin/users should filter patients by email
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
routes/admin.js:41:9
     if (patientName) {
       patientQuery.fullName = { $regex: '^' + patientName, $options: 'i' };
     }
-    if (patientEmail) {
+    if (false) {
       patientQuery.email = { $regex: '^' + patientEmail, $options: 'i' };
     }
killedBy: Admin Routes (Vitest) GET /api/admin/users should filter patients by email
statusReason: expected 2 to be 1 // Object.is equality

[Killed] StringLiteral
routes/admin.js:42:68
       patientQuery.fullName = { $regex: '^' + patientName, $options: 'i' };
     }
     if (patientEmail) {
-      patientQuery.email = { $regex: '^' + patientEmail, $options: 'i' };
+      patientQuery.email = { $regex: '^' + patientEmail, $options: "" };
     }
     if (patientDateFrom) {
killedBy: Mutation Coverage Tests for admin.js Regex search pattern mutations should verify regex options for patient email search are case-insensitive
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
routes/admin.js:44:26
     if (patientEmail) {
       patientQuery.email = { $regex: '^' + patientEmail, $options: 'i' };
     }
-    if (patientDateFrom) {
-      patientQuery.createdAt = { ...patientQuery.createdAt, $gte: new Date(patientDateFrom) };
-    }
+    if (patientDateFrom) {}
     if (patientDateTo) {
       patientQuery.createdAt = { ...patientQuery.createdAt, $lte: new Date(patientDateTo + 'T23:59:59') };
killedBy: Admin Routes (Vitest) GET /api/admin/users should filter patients by date range
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
routes/admin.js:44:9
     if (patientEmail) {
       patientQuery.email = { $regex: '^' + patientEmail, $options: 'i' };
     }
-    if (patientDateFrom) {
+    if (true) {
       patientQuery.createdAt = { ...patientQuery.createdAt, $gte: new Date(patientDateFrom) };
     }
killedBy: Admin Routes (Vitest) GET /api/admin/users should return all doctors and patients
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/admin.js:47:9
     if (patientDateFrom) {
       patientQuery.createdAt = { ...patientQuery.createdAt, $gte: new Date(patientDateFrom) };
     }
-    if (patientDateTo) {
+    if (true) {
       patientQuery.createdAt = { ...patientQuery.createdAt, $lte: new Date(patientDateTo + 'T23:59:59') };
     }
killedBy: Admin Routes (Vitest) GET /api/admin/users should return all doctors and patients
statusReason: expected 500 to be 200 // Object.is equality

[Survived] ConditionalExpression
routes/admin.js:47:9
     if (patientDateFrom) {
       patientQuery.createdAt = { ...patientQuery.createdAt, $gte: new Date(patientDateFrom) };
     }
-    if (patientDateTo) {
+    if (false) {
       patientQuery.createdAt = { ...patientQuery.createdAt, $lte: new Date(patientDateTo + 'T23:59:59') };
     }

[Killed] MethodExpression
routes/admin.js:52:7
     }
 
     const [patients, doctors] = await Promise.all([
-      Patient.find(patientQuery).select('-password').sort({ createdAt: -1 }),
+      Patient.find(patientQuery).select('-password'),
       Doctor.find(doctorQuery).select('-password').sort({ createdAt: -1 })
     ]);
killedBy: Mutation Coverage Tests for admin.js Sorting mutations should sort patients by createdAt descending (newest first)
statusReason: expected 'Old Patient' to be 'New Patient' // Object.is equality

[Killed] UnaryOperator
routes/admin.js:52:72
     }
 
     const [patients, doctors] = await Promise.all([
-      Patient.find(patientQuery).select('-password').sort({ createdAt: -1 }),
+      Patient.find(patientQuery).select('-password').sort({ createdAt: +1 }),
       Doctor.find(doctorQuery).select('-password').sort({ createdAt: -1 })
     ]);
killedBy: Mutation Coverage Tests for admin.js Sorting mutations should sort patients by createdAt descending (newest first)
statusReason: expected 'Old Patient' to be 'New Patient' // Object.is equality

[Killed] MethodExpression
routes/admin.js:53:7
 
     const [patients, doctors] = await Promise.all([
       Patient.find(patientQuery).select('-password').sort({ createdAt: -1 }),
-      Doctor.find(doctorQuery).select('-password').sort({ createdAt: -1 })
+      Doctor.find(doctorQuery).select('-password')
     ]);
 
killedBy: Mutation Coverage Tests for admin.js Sorting mutations should sort doctors by createdAt descending (newest first)
statusReason: expected 'Dr. Old' to be 'Dr. New' // Object.is equality

[Killed] UnaryOperator
routes/admin.js:53:70
 
     const [patients, doctors] = await Promise.all([
       Patient.find(patientQuery).select('-password').sort({ createdAt: -1 }),
-      Doctor.find(doctorQuery).select('-password').sort({ createdAt: -1 })
+      Doctor.find(doctorQuery).select('-password').sort({ createdAt: +1 })
     ]);
 
killedBy: Mutation Coverage Tests for admin.js Sorting mutations should sort doctors by createdAt descending (newest first)
statusReason: expected 'Dr. Old' to be 'Dr. New' // Object.is equality

[Killed] BlockStatement
routes/admin.js:57:17
     ]);
 
     res.json({ patients, doctors });
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: Admin Routes (Vitest) GET /api/admin/users should handle server errors
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/admin.js:63:84
   }
 });
 
-router.get('/appointments', [authMiddleware, adminMiddleware], async (req, res) => {
-  try {
-    const appointments = await Appointment.find()
-      .populate('patient', 'fullName email')
-      .populate('doctor', 'fullName email specialization')
-      .sort({ date: -1 });
-
-    res.json(appointments);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
-});
+router.get('/appointments', [authMiddleware, adminMiddleware], async (req, res) => {});
 
 router.put('/verify-doctor/:id', [authMiddleware, adminMiddleware], async (req, res) => {
killedBy: Admin Routes (Vitest) GET /api/admin/appointments should return all appointments with populated fields
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ArrayDeclaration
routes/admin.js:63:29
   }
 });
 
-router.get('/appointments', [authMiddleware, adminMiddleware], async (req, res) => {
+router.get('/appointments', [], async (req, res) => {
   try {
     const appointments = await Appointment.find()

[Killed] BlockStatement
routes/admin.js:64:7
 });
 
 router.get('/appointments', [authMiddleware, adminMiddleware], async (req, res) => {
-  try {
-    const appointments = await Appointment.find()
-      .populate('patient', 'fullName email')
-      .populate('doctor', 'fullName email specialization')
-      .sort({ date: -1 });
-
-    res.json(appointments);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server Error');
killedBy: Admin Routes (Vitest) GET /api/admin/appointments should return all appointments with populated fields
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
routes/admin.js:65:32
 
 router.get('/appointments', [authMiddleware, adminMiddleware], async (req, res) => {
   try {
-    const appointments = await Appointment.find()
-      .populate('patient', 'fullName email')
-      .populate('doctor', 'fullName email specialization')
-      .sort({ date: -1 });
+    const appointments = await Appointment.find().populate('patient', 'fullName email').populate('doctor', 'fullName email specialization');
 
     res.json(appointments);
killedBy: Admin Routes (Vitest) GET /api/admin/appointments should handle server errors
statusReason: expected 200 to be 500 // Object.is equality

[Killed] StringLiteral
routes/admin.js:66:17
 router.get('/appointments', [authMiddleware, adminMiddleware], async (req, res) => {
   try {
     const appointments = await Appointment.find()
-      .populate('patient', 'fullName email')
+      .populate("", 'fullName email')
       .populate('doctor', 'fullName email specialization')
       .sort({ date: -1 });
killedBy: Admin Routes (Vitest) GET /api/admin/appointments should return all appointments with populated fields
statusReason: expected 500 to be 200 // Object.is equality

[Killed] StringLiteral
routes/admin.js:67:17
   try {
     const appointments = await Appointment.find()
       .populate('patient', 'fullName email')
-      .populate('doctor', 'fullName email specialization')
+      .populate("", 'fullName email specialization')
       .sort({ date: -1 });
 
killedBy: Admin Routes (Vitest) GET /api/admin/appointments should return all appointments with populated fields
statusReason: expected 500 to be 200 // Object.is equality

[Survived] StringLiteral
routes/admin.js:67:27
   try {
     const appointments = await Appointment.find()
       .populate('patient', 'fullName email')
-      .populate('doctor', 'fullName email specialization')
+      .populate('doctor', "")
       .sort({ date: -1 });
 

[Killed] UnaryOperator
routes/admin.js:68:21
     const appointments = await Appointment.find()
       .populate('patient', 'fullName email')
       .populate('doctor', 'fullName email specialization')
-      .sort({ date: -1 });
+      .sort({ date: +1 });
 
     res.json(appointments);
killedBy: Mutation Coverage Tests for admin.js Sorting mutations should sort appointments by date descending (newest first)
statusReason: expected 1577836800000 to be greater than 1704067200000

[Survived] ArrayDeclaration
routes/admin.js:77:34
   }
 });
 
-router.put('/verify-doctor/:id', [authMiddleware, adminMiddleware], async (req, res) => {
+router.put('/verify-doctor/:id', [], async (req, res) => {
   try {
     const doctor = await Doctor.findById(req.params.id);

[Killed] BooleanLiteral
routes/admin.js:81:9
   try {
     const doctor = await Doctor.findById(req.params.id);
 
-    if (!doctor) {
+    if (doctor) {
       return res.status(404).json({ message: 'Doctor not found' });
     }
killedBy: Admin Routes (Vitest) PUT /api/admin/verify-doctor/:id should verify a doctor and send email
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/admin.js:81:9
   try {
     const doctor = await Doctor.findById(req.params.id);
 
-    if (!doctor) {
+    if (true) {
       return res.status(404).json({ message: 'Doctor not found' });
     }
killedBy: Admin Routes (Vitest) PUT /api/admin/verify-doctor/:id should verify a doctor and send email
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BooleanLiteral
routes/admin.js:85:25
       return res.status(404).json({ message: 'Doctor not found' });
     }
 
-    doctor.isVerified = true;
+    doctor.isVerified = false;
     await doctor.save();
 
killedBy: Admin Routes (Vitest) PUT /api/admin/verify-doctor/:id should verify a doctor and send email
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
routes/admin.js:106:24
             </p>
           </div>
           <div style="text-align: center; margin: 30px 0;">
-            <a href="${process.env.CLIENT_URL || 'https://smart-healthcare-appointment-and-triage.onrender.com'}/login" 
+            <a href="${true}/login" 
                style="background-color: #0891b2; color: white; padding: 12px 30px; text-decoration: none; border-radius: 6px; font-weight: 600; display: inline-block;">
               Login to Your Dashboard

[Survived] ConditionalExpression
routes/admin.js:106:24
             </p>
           </div>
           <div style="text-align: center; margin: 30px 0;">
-            <a href="${process.env.CLIENT_URL || 'https://smart-healthcare-appointment-and-triage.onrender.com'}/login" 
+            <a href="${false}/login" 
                style="background-color: #0891b2; color: white; padding: 12px 30px; text-decoration: none; border-radius: 6px; font-weight: 600; display: inline-block;">
               Login to Your Dashboard

[Killed] BlockStatement
routes/admin.js:115:9
       </div>
     `;
 
-    try {
-      await sendEmail({
-        email: doctor.email,
-        subject: '🎉 Verification Complete - Start Your Consultancy Journey!',
-        html: emailHtml
-      });
-    } catch (emailError) {
+    try {} catch (emailError) {
       console.error('Error sending verification email:', emailError);
     }
killedBy: Admin Routes (Vitest) PUT /api/admin/verify-doctor/:id should verify a doctor and send email
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] StringLiteral
routes/admin.js:118:18
     try {
       await sendEmail({
         email: doctor.email,
-        subject: '🎉 Verification Complete - Start Your Consultancy Journey!',
+        subject: ""
         html: emailHtml
       });
killedBy: Admin Routes (Vitest) PUT /api/admin/verify-doctor/:id should verify a doctor and send email
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
routes/admin.js:121:26
         subject: '🎉 Verification Complete - Start Your Consultancy Journey!',
         html: emailHtml
       });
-    } catch (emailError) {
-      console.error('Error sending verification email:', emailError);
-    }
+    } catch (emailError) {}
 
     res.json({ message: 'Doctor verified successfully', doctor });
killedBy: Mutation Coverage Tests for admin.js Console error mutations should log error with specific message when email fails during doctor verification
statusReason: expected "error" to be called with arguments: [ StringMatching{…}, Any<Error> ]

Number of calls: 0

[Killed] BlockStatement
routes/admin.js:127:17
 
     res.json({ message: 'Doctor verified successfully', doctor });
 
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: Admin Routes (Vitest) PUT /api/admin/verify-doctor/:id should handle server errors
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ArrayDeclaration
routes/admin.js:133:35
   }
 });
 
-router.put('/suspend-doctor/:id', [authMiddleware, adminMiddleware], async (req, res) => {
+router.put('/suspend-doctor/:id', [], async (req, res) => {
     try {
       const doctor = await Doctor.findById(req.params.id);

[Killed] ConditionalExpression
routes/admin.js:137:11
     try {
       const doctor = await Doctor.findById(req.params.id);
   
-      if (!doctor) {
+      if (false) {
         return res.status(404).json({ message: 'Doctor not found' });
       }
killedBy: Admin Routes (Vitest) PUT /api/admin/suspend-doctor/:id should return 404 if doctor not found
statusReason: expected 500 to be 404 // Object.is equality

[Killed] BooleanLiteral
routes/admin.js:141:27
         return res.status(404).json({ message: 'Doctor not found' });
       }
   
-      doctor.isVerified = false;
+      doctor.isVerified = true;
       await doctor.save();
 
killedBy: Admin Routes (Vitest) PUT /api/admin/suspend-doctor/:id should suspend a doctor, cancel appointments, and send email
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
routes/admin.js:147:9
       
       const cancelledAppointments = await Appointment.updateMany(
         { doctor: doctor._id, status: 'upcoming' },
-        { $set: { status: 'cancelled' } }
+        {}
       );
       console.log(`Cancelled ${cancelledAppointments.modifiedCount} appointments for suspended doctor.`);
killedBy: Admin Routes (Vitest) PUT /api/admin/suspend-doctor/:id should suspend a doctor, cancel appointments, and send email
statusReason: expected 'upcoming' to be 'cancelled' // Object.is equality

[Killed] StringLiteral
routes/admin.js:149:19
         { doctor: doctor._id, status: 'upcoming' },
         { $set: { status: 'cancelled' } }
       );
-      console.log(`Cancelled ${cancelledAppointments.modifiedCount} appointments for suspended doctor.`);
+      console.log(``);
      
       
killedBy: Mutation Coverage Tests for admin.js Console log mutations should log cancelled appointment count when suspending doctor
statusReason: expected "log" to be called with arguments: [ StringMatching{…} ]

Received: 

  1st log call:

  [
-   StringMatching /Cancelled.*appointments/,

[Killed] StringLiteral
routes/admin.js:152:25
       console.log(`Cancelled ${cancelledAppointments.modifiedCount} appointments for suspended doctor.`);
      
       
-      const emailHtml = `
-        <div style="font-family: Arial, sans-serif; max-width: 600px; margin: 0 auto; padding: 20px; background-color: #fff1f2;">
-          <div style="background-color: white; padding: 30px; border-radius: 10px; box-shadow: 0 2px 10px rgba(0,0,0,0.1); border-top: 5px solid #e11d48;">
-            <h1 style="color: #e11d48; margin-top: 0;">Account Suspended</h1>
-            <p style="color: #333; font-size: 16px; margin-bottom: 15px;">Dear Dr. ${doctor.fullName},</p>
-            <p style="color: #666; line-height: 1.6; margin-bottom: 15px;">
-              Your IntelliConsult account has been temporarily suspended.
-              <strong>Any upcoming appointments have been automatically cancelled.</strong>
-            </p>
-            </div>
-        </div>
-      `;
+      const emailHtml = ``;
   
       try {
killedBy: Mutation Coverage Tests for admin.js Email content mutations should send suspension email with doctor name in HTML content
statusReason: expected '' to contain 'Dr. SuspendContent'

[Killed] BlockStatement
routes/admin.js:165:11
         </div>
       `;
   
-      try {
-          await sendEmail({
-              email: doctor.email,
-              subject: '⚠️ IntelliConsult Account Suspended',
-              html: emailHtml,
-          });
-      } catch (emailError) {
+      try {} catch (emailError) {
           console.error("Failed to send suspension email:", emailError);
       }
killedBy: Admin Routes (Vitest) PUT /api/admin/suspend-doctor/:id should suspend a doctor, cancel appointments, and send email
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ObjectLiteral
routes/admin.js:166:27
       `;
   
       try {
-          await sendEmail({
-              email: doctor.email,
-              subject: '⚠️ IntelliConsult Account Suspended',
-              html: emailHtml,
-          });
+          await sendEmail({});
       } catch (emailError) {
           console.error("Failed to send suspension email:", emailError);
killedBy: Admin Routes (Vitest) PUT /api/admin/suspend-doctor/:id should suspend a doctor, cancel appointments, and send email
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
routes/admin.js:171:28
               subject: '⚠️ IntelliConsult Account Suspended',
               html: emailHtml,
           });
-      } catch (emailError) {
-          console.error("Failed to send suspension email:", emailError);
-      }
+      } catch (emailError) {}
       
       res.json({ message: 'Doctor suspended and appointments cancelled successfully', doctor });
killedBy: Mutation Coverage Tests for admin.js Console error mutations should log error with specific message when email fails during doctor suspension
statusReason: expected "error" to be called with arguments: [ StringMatching{…}, Any<Error> ]

Number of calls: 0

[Killed] ObjectLiteral
routes/admin.js:175:16
           console.error("Failed to send suspension email:", emailError);
       }
       
-      res.json({ message: 'Doctor suspended and appointments cancelled successfully', doctor });
+      res.json({});
     
     } catch (err) {
killedBy: Mutation Coverage Tests for admin.js Success message mutations should return specific success message when suspending doctor
statusReason: expected undefined to be 'Doctor suspended and appointments can…' // Object.is equality

[Killed] StringLiteral
routes/admin.js:183:15
     }
 });
 
-router.delete('/reject-doctor/:id', [authMiddleware, adminMiddleware], async (req, res) => {
+router.delete("", [authMiddleware, adminMiddleware], async (req, res) => {
     try {
         const doctor = await Doctor.findById(req.params.id);
killedBy: Admin Routes (Vitest) DELETE /api/admin/reject-doctor/:id should delete doctor and send rejection email
statusReason: expected 404 to be 200 // Object.is equality
