[Killed] StringLiteral
routes/admin.js:191:27
             return res.status(404).json({ message: 'Doctor not found' });
         }
 
-        const emailHtml = `
-            <div style="font-family: Arial, sans-serif; max-width: 600px; margin: 0 auto; padding: 20px;">
-              <div style="background-color: white; padding: 30px; border-radius: 10px; box-shadow: 0 2px 10px rgba(0,0,0,0.1);">
-                <h1 style="color: #333; margin-top: 0; margin-bottom: 20px;">Application Status Update</h1>
-                <p style="color: #666; font-size: 16px; line-height: 1.6; margin-bottom: 15px;">Dear Dr. ${doctor.fullName},</p>
-                <p style="color: #666; line-height: 1.6; margin-bottom: 15px;">
-                  Thank you for your interest in joining IntelliConsult. After carefully reviewing your profile, 
-                  we are unable to approve your application at this time.
-                </p>
-                <p style="color: #666; line-height: 1.6;">
-                  Your account information has been removed from our system. You are welcome to re-apply in the future if your qualifications change.
-                </p>
-                <div style="margin-top: 30px; padding-top: 20px; border-top: 1px solid #e5e7eb; text-align: center;">
-                  <p style="color: #9ca3af; font-size: 14px; margin: 5px 0 0 0;">
-                    Best regards,<br>
-                    <strong>IntelliConsult Admin Team</strong>
-                  </p>
-                </div>
-              </div>
-            </div>
-        `;
+        const emailHtml = ``;
 
         try {
killedBy: Mutation Coverage Tests for admin.js Email content mutations should send rejection email with doctor name in HTML content
statusReason: expected '' to contain 'Dr. RejectContent'

[Killed] BlockStatement
routes/admin.js:213:13
             </div>
         `;
 
-        try {
-            await sendEmail({
-                email: doctor.email,
-                subject: 'IntelliConsult Application Status',
-                html: emailHtml,
-            });
-        } catch (emailError) {
+        try {} catch (emailError) {
             console.error("Failed to send rejection email:", emailError);
         }
killedBy: Admin Routes (Vitest) DELETE /api/admin/reject-doctor/:id should delete doctor and send rejection email
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] StringLiteral
routes/admin.js:216:26
         try {
             await sendEmail({
                 email: doctor.email,
-                subject: 'IntelliConsult Application Status',
+                subject: "",
                 html: emailHtml,
             });
killedBy: Admin Routes (Vitest) DELETE /api/admin/reject-doctor/:id should delete doctor and send rejection email
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
routes/admin.js:219:30
                 subject: 'IntelliConsult Application Status',
                 html: emailHtml,
             });
-        } catch (emailError) {
-            console.error("Failed to send rejection email:", emailError);
-        }
+        } catch (emailError) {}
 
         await Doctor.findByIdAndDelete(req.params.id);
killedBy: Mutation Coverage Tests for admin.js Console error mutations should log error with specific message when email fails during doctor rejection
statusReason: expected "error" to be called with arguments: [ StringMatching{…}, Any<Error> ]

Number of calls: 0

[Killed] ConditionalExpression
routes/admin.js:236:11
     try {
       const patient = await Patient.findById(req.params.id);
   
-      if (!patient) {
+      if (true) {
         return res.status(404).json({ message: 'Patient not found' });
       }
killedBy: Admin Routes (Vitest) PUT /api/admin/verify-patient/:id should reactivate a patient and send email
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BooleanLiteral
routes/admin.js:240:28
         return res.status(404).json({ message: 'Patient not found' });
       }
   
-      patient.isVerified = true;
+      patient.isVerified = false;
       await patient.save();
   
killedBy: Admin Routes (Vitest) PUT /api/admin/verify-patient/:id should reactivate a patient and send email
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
routes/admin.js:270:11
         </div>
       `;
   
-      try {
-        await sendEmail({
-          email: patient.email,
-          subject: '✅ IntelliConsult Account Reactivated',
-          html: emailHtml
-        });
-      } catch (emailError) {
+      try {} catch (emailError) {
         console.error('Error sending patient verification email:', emailError);
       }
killedBy: Admin Routes (Vitest) PUT /api/admin/verify-patient/:id should reactivate a patient and send email
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ObjectLiteral
routes/admin.js:271:25
       `;
   
       try {
-        await sendEmail({
-          email: patient.email,
-          subject: '✅ IntelliConsult Account Reactivated',
-          html: emailHtml
-        });
+        await sendEmail({});
       } catch (emailError) {
         console.error('Error sending patient verification email:', emailError);
killedBy: Admin Routes (Vitest) PUT /api/admin/verify-patient/:id should reactivate a patient and send email
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
routes/admin.js:276:28
           subject: '✅ IntelliConsult Account Reactivated',
           html: emailHtml
         });
-      } catch (emailError) {
-        console.error('Error sending patient verification email:', emailError);
-      }
+      } catch (emailError) {}
   
       res.json({ message: 'Patient verified successfully', patient });
killedBy: Mutation Coverage Tests for admin.js Console error mutations should log error with specific message when email fails during patient verification
statusReason: expected "error" to be called with arguments: [ StringMatching{…}, Any<Error> ]

Number of calls: 0

[Survived] ArrayDeclaration
routes/admin.js:288:36
     }
   });
 
-router.put('/suspend-patient/:id', [authMiddleware, adminMiddleware], async (req, res) => {
+router.put('/suspend-patient/:id', [], async (req, res) => {
     try {
       const patient = await Patient.findById(req.params.id);

[Killed] BlockStatement
routes/admin.js:292:21
     try {
       const patient = await Patient.findById(req.params.id);
   
-      if (!patient) {
-        return res.status(404).json({ message: 'Patient not found' });
-      }
+      if (!patient) {}
   
       
killedBy: Admin Routes (Vitest) PUT /api/admin/suspend-patient/:id should return 404 if patient not found
statusReason: expected 500 to be 404 // Object.is equality

[Killed] ObjectLiteral
routes/admin.js:293:37
       const patient = await Patient.findById(req.params.id);
   
       if (!patient) {
-        return res.status(404).json({ message: 'Patient not found' });
+        return res.status(404).json({});
       }
   
killedBy: Mutation Coverage Tests for admin.js Error message mutations should return specific error message "Patient not found" when suspending non-existent patient
statusReason: expected undefined to be 'Patient not found' // Object.is equality

[Killed] BooleanLiteral
routes/admin.js:297:28
       }
   
       
-      patient.isVerified = false;
+      patient.isVerified = true;
       await patient.save();
 
killedBy: Admin Routes (Vitest) PUT /api/admin/suspend-patient/:id should suspend a patient and cancel appointments
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
routes/admin.js:302:9
 
      
       const cancelledAppointments = await Appointment.updateMany(
-        { patient: patient._id, status: 'upcoming' },
+        {},
         { $set: { status: 'cancelled' } }
       );
killedBy: Mutation Coverage Tests for admin.js Appointment cancellation mutations should cancel appointments with status "upcoming" when suspending patient
statusReason: expected 'cancelled' to be 'completed' // Object.is equality

[Killed] StringLiteral
routes/admin.js:305:19
         { patient: patient._id, status: 'upcoming' },
         { $set: { status: 'cancelled' } }
       );
-      console.log(`Cancelled ${cancelledAppointments.modifiedCount} appointments for suspended patient.`);
+      console.log(``);
       
       
killedBy: Mutation Coverage Tests for admin.js Console log mutations should log cancelled appointment count when suspending patient
statusReason: expected "log" to be called with arguments: [ StringMatching{…} ]

Received: 

  1st log call:

  [
-   StringMatching /Cancelled.*appointments/,

[Killed] StringLiteral
routes/admin.js:308:25
       console.log(`Cancelled ${cancelledAppointments.modifiedCount} appointments for suspended patient.`);
       
       
-      const emailHtml = `
-        <div style="font-family: Arial, sans-serif; max-width: 600px; margin: 0 auto; padding: 20px; background-color: #fff1f2;">
-          <div style="background-color: white; padding: 30px; border-radius: 10px; box-shadow: 0 2px 10px rgba(0,0,0,0.1); border-top: 5px solid #e11d48;">
-            <h1 style="color: #e11d48; margin-top: 0;">Account Suspended</h1>
-            <p style="color: #333; font-size: 16px; margin-bottom: 15px;">Dear ${patient.fullName},</p>
-            <p style="color: #666; line-height: 1.6; margin-bottom: 15px;">
-              We are writing to inform you that your IntelliConsult account has been temporarily suspended.
-              <strong>All your upcoming appointments have been cancelled.</strong>
-            </p>
-            </div>
-        </div>
-      `;
+      const emailHtml = ``;
   
       try {
killedBy: Mutation Coverage Tests for admin.js Email content mutations should send suspension email with patient name in HTML content
statusReason: expected '' to contain 'Patient SuspendContent'

[Killed] BlockStatement
routes/admin.js:321:11
         </div>
       `;
   
-      try {
-          await sendEmail({
-              email: patient.email,
-              subject: '⚠️ IntelliConsult Account Suspended',
-              html: emailHtml,
-          });
-      } catch (emailError) {
+      try {} catch (emailError) {
           console.error("Failed to send suspension email:", emailError);
       }
killedBy: Mutation Coverage Tests for admin.js Email subject line mutations should send email with correct subject when suspending patient
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] StringLiteral
routes/admin.js:328:25
               html: emailHtml,
           });
       } catch (emailError) {
-          console.error("Failed to send suspension email:", emailError);
+          console.error("", emailError);
       }
       
killedBy: Mutation Coverage Tests for admin.js Console error mutations should log error with specific message when email fails during patient suspension
statusReason: expected "error" to be called with arguments: [ StringMatching{…}, Any<Error> ]

Received: 

  1st error call:

  [
-   StringMatching /Failed to send suspension email/,

[Killed] StringLiteral
routes/admin.js:331:27
           console.error("Failed to send suspension email:", emailError);
       }
       
-      res.json({ message: 'Patient suspended and appointments cancelled successfully', patient });
+      res.json({ message: "", patient });
     
     } catch (err) {
killedBy: Mutation Coverage Tests for admin.js Success message mutations should return specific success message when suspending patient
statusReason: expected '' to be 'Patient suspended and appointments ca…' // Object.is equality

[Killed] BlockStatement
routes/admin.js:339:80
     }
 });
 
-router.get('/user/:id', [authMiddleware, adminMiddleware], async (req, res) => {
-  try {
-    const userId = req.params.id;
-    let user = await Doctor.findById(userId).select('-password');
-    if (!user) {
-      user = await Patient.findById(userId).select('-password');
-    }
-
-    if (!user) {
-      return res.status(404).json({ message: 'User not found' });
-    }
-
-    res.json(user);
-
-  } catch (error) {
-    console.error('Error fetching user details for admin:', error);
-    res.status(500).json({ message: 'Server error while fetching user details' });
-  }
-});
+router.get('/user/:id', [authMiddleware, adminMiddleware], async (req, res) => {});
 
 module.exports = router;
killedBy: Admin Routes (Vitest) GET /api/admin/user/:id should return a doctor details by ID
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/admin.js:339:12
     }
 });
 
-router.get('/user/:id', [authMiddleware, adminMiddleware], async (req, res) => {
+router.get("", [authMiddleware, adminMiddleware], async (req, res) => {
   try {
     const userId = req.params.id;
killedBy: Admin Routes (Vitest) GET /api/admin/user/:id should return a doctor details by ID
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
routes/admin.js:340:7
 });
 
 router.get('/user/:id', [authMiddleware, adminMiddleware], async (req, res) => {
-  try {
-    const userId = req.params.id;
-    let user = await Doctor.findById(userId).select('-password');
-    if (!user) {
-      user = await Patient.findById(userId).select('-password');
-    }
-
-    if (!user) {
-      return res.status(404).json({ message: 'User not found' });
-    }
-
-    res.json(user);
-
-  } catch (error) {
+  try {} catch (error) {
     console.error('Error fetching user details for admin:', error);
     res.status(500).json({ message: 'Server error while fetching user details' });
killedBy: Admin Routes (Vitest) GET /api/admin/user/:id should return a doctor details by ID
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/admin.js:342:53
 router.get('/user/:id', [authMiddleware, adminMiddleware], async (req, res) => {
   try {
     const userId = req.params.id;
-    let user = await Doctor.findById(userId).select('-password');
+    let user = await Doctor.findById(userId).select("");
     if (!user) {
       user = await Patient.findById(userId).select('-password');
killedBy: Mutation Coverage Tests for admin.js Password exclusion mutations should not return password field when getting user by ID (doctor)
statusReason: expected { …(20) } to not have property "password"

[Killed] ConditionalExpression
routes/admin.js:343:9
   try {
     const userId = req.params.id;
     let user = await Doctor.findById(userId).select('-password');
-    if (!user) {
+    if (false) {
       user = await Patient.findById(userId).select('-password');
     }
killedBy: Admin Routes (Vitest) GET /api/admin/user/:id should return a patient details by ID
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BooleanLiteral
routes/admin.js:343:9
   try {
     const userId = req.params.id;
     let user = await Doctor.findById(userId).select('-password');
-    if (!user) {
+    if (user) {
       user = await Patient.findById(userId).select('-password');
     }
killedBy: Admin Routes (Vitest) GET /api/admin/user/:id should return a doctor details by ID
statusReason: expected 404 to be 200 // Object.is equality

[Killed] StringLiteral
routes/admin.js:344:52
     const userId = req.params.id;
     let user = await Doctor.findById(userId).select('-password');
     if (!user) {
-      user = await Patient.findById(userId).select('-password');
+      user = await Patient.findById(userId).select("");
     }
 
killedBy: Mutation Coverage Tests for admin.js Password exclusion mutations should not return password field when getting user by ID (patient)
statusReason: expected { …(11) } to not have property "password"

[Killed] BlockStatement
routes/admin.js:353:19
 
     res.json(user);
 
-  } catch (error) {
-    console.error('Error fetching user details for admin:', error);
-    res.status(500).json({ message: 'Server error while fetching user details' });
-  }
+  } catch (error) {}
 });
 
killedBy: Admin Routes (Vitest) GET /api/admin/user/:id should handle server errors
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/admin.js:354:19
     res.json(user);
 
   } catch (error) {
-    console.error('Error fetching user details for admin:', error);
+    console.error("", error);
     res.status(500).json({ message: 'Server error while fetching user details' });
   }
killedBy: Mutation Coverage Tests for admin.js Console error mutations should log error with specific message when database error occurs in get user
statusReason: expected "error" to be called with arguments: [ StringMatching{…}, Any<Error> ]

Received: 

  1st error call:

  [
-   StringMatching /Error fetching user details for admin/,

[Killed] ObjectLiteral
routes/admin.js:355:26
 
   } catch (error) {
     console.error('Error fetching user details for admin:', error);
-    res.status(500).json({ message: 'Server error while fetching user details' });
+    res.status(500).json({});
   }
 });
killedBy: Admin Routes (Vitest) GET /api/admin/user/:id should handle server errors
statusReason: expected undefined to be 'Server error while fetching user deta…' // Object.is equality
