[Killed] MethodExpression
routes/appointments.js:124:31
       .sort({ date: 1 });
     
     // Filter out appointments where patient is null (deleted patient references)
-    const validAppointments = appointments.filter(appointment => appointment.patient);
+    const validAppointments = appointments;
     
     res.json(validAppointments);
killedBy: Appointment Routes GET /my-appointments doctor endpoint should filter out appointments with null patient (mock Appointment.find return containing null patient)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
routes/appointments.js:124:51
       .sort({ date: 1 });
     
     // Filter out appointments where patient is null (deleted patient references)
-    const validAppointments = appointments.filter(appointment => appointment.patient);
+    const validAppointments = appointments.filter(() => undefined);
     
     res.json(validAppointments);
killedBy: Appointment Routes GET /my-appointments should return appointments for logged-in doctor
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
routes/appointments.js:127:17
     const validAppointments = appointments.filter(appointment => appointment.patient);
     
     res.json(validAppointments);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: Appointment Routes Extra mutation-killing tests - round 2 doctor endpoint returns 500 on Appointment.find throwing (covers error path)
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
routes/appointments.js:160:22
 
   try {
     // 2. Basic validation
-    if (!doctorId || !date || !time || !patientNameForVisit || !primaryReason) {
+    if (!doctorId || date || !time || !patientNameForVisit || !primaryReason) {
       return res.status(400).json({ message: 'Missing required fields: doctor, date, time, patient name, or reason.' });
     }
killedBy: Appointment Routes POST /book should book an appointment successfully
statusReason: expected 400 to be 201 // Object.is equality

[Killed] BooleanLiteral
routes/appointments.js:160:40
 
   try {
     // 2. Basic validation
-    if (!doctorId || !date || !time || !patientNameForVisit || !primaryReason) {
+    if (!doctorId || !date || !time || patientNameForVisit || !primaryReason) {
       return res.status(400).json({ message: 'Missing required fields: doctor, date, time, patient name, or reason.' });
     }
killedBy: Appointment Routes POST /book should book an appointment successfully
statusReason: expected 400 to be 201 // Object.is equality

[Killed] StringLiteral
routes/appointments.js:161:46
   try {
     // 2. Basic validation
     if (!doctorId || !date || !time || !patientNameForVisit || !primaryReason) {
-      return res.status(400).json({ message: 'Missing required fields: doctor, date, time, patient name, or reason.' });
+      return res.status(400).json({ message: "" });
     }
 
killedBy: Appointment Routes POST /book should return 400 if required fields are missing
statusReason: expected '' to contain 'Missing required fields'

[Survived] ObjectLiteral
routes/appointments.js:165:59
     }
 
     // 3. Check for double-bookings (race condition)
-    const existingAppointment = await Appointment.findOne({
-      doctor: doctorId,
-      date: new Date(date), 
-      time: time,
-      status: 'upcoming'
-    });
+    const existingAppointment = await Appointment.findOne({});
     if (existingAppointment) {
       return res.status(409).json({ message: 'This time slot is no longer available. Please select another.' });

[Killed] StringLiteral
routes/appointments.js:169:15
       doctor: doctorId,
       date: new Date(date), 
       time: time,
-      status: 'upcoming'
+      status: ""
     });
     if (existingAppointment) {
killedBy: Appointment Routes POST /book should prevent double booking
statusReason: expected 500 to be 409 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:171:9
       time: time,
       status: 'upcoming'
     });
-    if (existingAppointment) {
+    if (false) {
       return res.status(409).json({ message: 'This time slot is no longer available. Please select another.' });
     }
killedBy: Appointment Routes POST /book should prevent double booking
statusReason: expected 500 to be 409 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:171:9
       time: time,
       status: 'upcoming'
     });
-    if (existingAppointment) {
+    if (true) {
       return res.status(409).json({ message: 'This time slot is no longer available. Please select another.' });
     }
killedBy: Appointment Routes POST /book should book an appointment successfully
statusReason: expected 409 to be 201 // Object.is equality

[Killed] BlockStatement
routes/appointments.js:177:18
 
     // 4. Fetch the doctor to get their fee
     const doctor = await Doctor.findById(doctorId);
-    if (!doctor) {
-      return res.status(404).json({ message: 'Doctor not found.' });
-    }
+    if (!doctor) {}
     const fee = doctor.consultationFee || 0; // Use default if fee is missing
 
killedBy: Appointment Routes POST /book should return 404 if doctor not found
statusReason: expected 500 to be 404 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:180:17
     if (!doctor) {
       return res.status(404).json({ message: 'Doctor not found.' });
     }
-    const fee = doctor.consultationFee || 0; // Use default if fee is missing
+    const fee = false; // Use default if fee is missing
 
     // 5. Create new appointment with all fields
killedBy: Appointment Routes POST /book should book an appointment successfully
statusReason: expected +0 to be 300 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:180:17
     if (!doctor) {
       return res.status(404).json({ message: 'Doctor not found.' });
     }
-    const fee = doctor.consultationFee || 0; // Use default if fee is missing
+    const fee = true; // Use default if fee is missing
 
     // 5. Create new appointment with all fields
killedBy: Appointment Routes POST /book should book an appointment successfully
statusReason: expected 1 to be 300 // Object.is equality

[Killed] BlockStatement
routes/appointments.js:211:17
     const appointment = await newAppointment.save();
 
     res.status(201).json(appointment);
-  } catch (err) {
-    console.error('Booking Error:', err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: Appointment Routes POST /book should handle server errors when booking appointment
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/appointments.js:220:63
 // @route   PUT api/appointments/:id/cancel
 // @desc    Cancel an appointment
 // @access  Private (Patient only)
-router.put('/:id/cancel', authMiddleware, async (req, res) => {
-  try {
-    const appointment = await Appointment.findById(req.params.id);
-    if (!appointment) {
-      return res.status(404).json({ message: 'Appointment not found' });
-    }
-    if (appointment.patient.toString() !== req.user.userId) {
-      return res.status(401).json({ message: 'User not authorized' });
-    }
-    // --- FIX: Add backticks for template literal ---
-    if (appointment.status !== 'upcoming') {
-      return res.status(400).json({ message: `Cannot cancel an appointment that is already ${appointment.status}.` });
-    }
-
-    appointment.status = 'cancelled';
-    await appointment.save({ validateBeforeSave: false });
-    res.json({ message: 'Appointment cancelled successfully', appointment });
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
-});
+router.put('/:id/cancel', authMiddleware, async (req, res) => {});
 
 // @route   PUT api/appointments/:id/complete
killedBy: Appointment Routes PUT /:id/cancel should cancel an upcoming appointment
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/appointments.js:221:7
 // @desc    Cancel an appointment
 // @access  Private (Patient only)
 router.put('/:id/cancel', authMiddleware, async (req, res) => {
-  try {
-    const appointment = await Appointment.findById(req.params.id);
-    if (!appointment) {
-      return res.status(404).json({ message: 'Appointment not found' });
-    }
-    if (appointment.patient.toString() !== req.user.userId) {
-      return res.status(401).json({ message: 'User not authorized' });
-    }
-    // --- FIX: Add backticks for template literal ---
-    if (appointment.status !== 'upcoming') {
-      return res.status(400).json({ message: `Cannot cancel an appointment that is already ${appointment.status}.` });
-    }
-
-    appointment.status = 'cancelled';
-    await appointment.save({ validateBeforeSave: false });
-    res.json({ message: 'Appointment cancelled successfully', appointment });
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server Error');
killedBy: Appointment Routes PUT /:id/cancel should cancel an upcoming appointment
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
routes/appointments.js:223:9
 router.put('/:id/cancel', authMiddleware, async (req, res) => {
   try {
     const appointment = await Appointment.findById(req.params.id);
-    if (!appointment) {
+    if (false) {
       return res.status(404).json({ message: 'Appointment not found' });
     }
killedBy: Appointment Routes PUT /:id/cancel should return 404 if appointment not found
statusReason: expected 500 to be 404 // Object.is equality

[Killed] BooleanLiteral
routes/appointments.js:223:9
 router.put('/:id/cancel', authMiddleware, async (req, res) => {
   try {
     const appointment = await Appointment.findById(req.params.id);
-    if (!appointment) {
+    if (appointment) {
       return res.status(404).json({ message: 'Appointment not found' });
     }
killedBy: Appointment Routes PUT /:id/cancel should cancel an upcoming appointment
statusReason: expected 404 to be 200 // Object.is equality

[Killed] EqualityOperator
routes/appointments.js:226:9
     if (!appointment) {
       return res.status(404).json({ message: 'Appointment not found' });
     }
-    if (appointment.patient.toString() !== req.user.userId) {
+    if (appointment.patient.toString() === req.user.userId) {
       return res.status(401).json({ message: 'User not authorized' });
     }
killedBy: Appointment Routes PUT /:id/cancel should cancel an upcoming appointment
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:226:9
     if (!appointment) {
       return res.status(404).json({ message: 'Appointment not found' });
     }
-    if (appointment.patient.toString() !== req.user.userId) {
+    if (true) {
       return res.status(401).json({ message: 'User not authorized' });
     }
killedBy: Appointment Routes PUT /:id/cancel should cancel an upcoming appointment
statusReason: expected 401 to be 200 // Object.is equality

[Survived] StringLiteral
routes/appointments.js:227:46
       return res.status(404).json({ message: 'Appointment not found' });
     }
     if (appointment.patient.toString() !== req.user.userId) {
-      return res.status(401).json({ message: 'User not authorized' });
+      return res.status(401).json({ message: "" });
     }
     // --- FIX: Add backticks for template literal ---

[Survived] ObjectLiteral
routes/appointments.js:227:35
       return res.status(404).json({ message: 'Appointment not found' });
     }
     if (appointment.patient.toString() !== req.user.userId) {
-      return res.status(401).json({ message: 'User not authorized' });
+      return res.status(401).json({});
     }
     // --- FIX: Add backticks for template literal ---

[Killed] EqualityOperator
routes/appointments.js:230:9
       return res.status(401).json({ message: 'User not authorized' });
     }
     // --- FIX: Add backticks for template literal ---
-    if (appointment.status !== 'upcoming') {
+    if (appointment.status === 'upcoming') {
       return res.status(400).json({ message: `Cannot cancel an appointment that is already ${appointment.status}.` });
     }
killedBy: Appointment Routes PUT /:id/cancel should cancel an upcoming appointment
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:230:9
       return res.status(401).json({ message: 'User not authorized' });
     }
     // --- FIX: Add backticks for template literal ---
-    if (appointment.status !== 'upcoming') {
+    if (true) {
       return res.status(400).json({ message: `Cannot cancel an appointment that is already ${appointment.status}.` });
     }
killedBy: Appointment Routes PUT /:id/cancel should cancel an upcoming appointment
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ObjectLiteral
routes/appointments.js:231:35
     }
     // --- FIX: Add backticks for template literal ---
     if (appointment.status !== 'upcoming') {
-      return res.status(400).json({ message: `Cannot cancel an appointment that is already ${appointment.status}.` });
+      return res.status(400).json({});
     }
 
killedBy: Appointment Routes PUT /:id/cancel should fail if appointment is already cancelled
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Survived] BooleanLiteral
routes/appointments.js:235:50
     }
 
     appointment.status = 'cancelled';
-    await appointment.save({ validateBeforeSave: false });
+    await appointment.save({ validateBeforeSave: true });
     res.json({ message: 'Appointment cancelled successfully', appointment });
   } catch (err) {

[Survived] StringLiteral
routes/appointments.js:236:25
 
     appointment.status = 'cancelled';
     await appointment.save({ validateBeforeSave: false });
-    res.json({ message: 'Appointment cancelled successfully', appointment });
+    res.json({ message: "", appointment });
   } catch (err) {
     console.error(err.message);

[Killed] BlockStatement
routes/appointments.js:237:17
     appointment.status = 'cancelled';
     await appointment.save({ validateBeforeSave: false });
     res.json({ message: 'Appointment cancelled successfully', appointment });
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: Appointment Routes PUT /:id/cancel should handle server errors when cancelling appointment
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/appointments.js:246:12
 // @route   PUT api/appointments/:id/complete
 // @desc    Mark an appointment as completed
 // @access  Private (Doctor only)
-router.put('/:id/complete', authMiddleware, async (req, res) => {
+router.put("", authMiddleware, async (req, res) => {
   if (req.user.userType !== 'doctor') {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
killedBy: Appointment Routes PUT /:id/complete should mark appointment as completed by doctor
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:247:7
 // @desc    Mark an appointment as completed
 // @access  Private (Doctor only)
 router.put('/:id/complete', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
+  if (false) {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
killedBy: Appointment Routes PUT /:id/complete should fail if user is not a doctor
statusReason: expected 500 to be 403 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:247:7
 // @desc    Mark an appointment as completed
 // @access  Private (Doctor only)
 router.put('/:id/complete', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
+  if (true) {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
killedBy: Appointment Routes PUT /:id/complete should mark appointment as completed by doctor
statusReason: expected 403 to be 200 // Object.is equality

[Survived] ObjectLiteral
routes/appointments.js:248:33
 // @access  Private (Doctor only)
 router.put('/:id/complete', authMiddleware, async (req, res) => {
   if (req.user.userType !== 'doctor') {
-    return res.status(403).json({ message: 'Access denied. Not a doctor.' });
+    return res.status(403).json({});
   }
 

[Killed] BlockStatement
routes/appointments.js:251:7
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
 
-  try {
-    const appointment = await Appointment.findById(req.params.id);
-    if (!appointment) {
-      return res.status(404).json({ message: 'Appointment not found' });
-    }
-    if (appointment.doctor.toString() !== req.user.userId) {
-      return res.status(403).json({ message: 'Access denied. You are not assigned to this appointment.' });
-    }
-    // --- FIX: Add backticks for template literal ---
-    if (appointment.status !== 'upcoming') {
-      return res.status(400).json({ message: `Cannot complete an appointment that is already ${appointment.status}.` });
-    }
-
-    appointment.status = 'completed';
-    await appointment.save({ validateBeforeSave: false });
-    res.json({ message: 'Appointment marked as completed successfully', appointment });
-  } catch (err) {
+  try {} catch (err) {
     console.error('Complete Appointment Error:', err.message);
     res.status(500).send('Server Error');
killedBy: Appointment Routes PUT /:id/complete should mark appointment as completed by doctor
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
routes/appointments.js:253:9
 
   try {
     const appointment = await Appointment.findById(req.params.id);
-    if (!appointment) {
+    if (true) {
       return res.status(404).json({ message: 'Appointment not found' });
     }
killedBy: Appointment Routes PUT /:id/complete should mark appointment as completed by doctor
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
routes/appointments.js:256:60
     if (!appointment) {
       return res.status(404).json({ message: 'Appointment not found' });
     }
-    if (appointment.doctor.toString() !== req.user.userId) {
-      return res.status(403).json({ message: 'Access denied. You are not assigned to this appointment.' });
-    }
+    if (appointment.doctor.toString() !== req.user.userId) {}
     // --- FIX: Add backticks for template literal ---
     if (appointment.status !== 'upcoming') {
killedBy: Appointment Routes PUT /:id/complete should fail if doctor is not assigned to the appointment
statusReason: expected 200 to be 403 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:256:9
     if (!appointment) {
       return res.status(404).json({ message: 'Appointment not found' });
     }
-    if (appointment.doctor.toString() !== req.user.userId) {
+    if (false) {
       return res.status(403).json({ message: 'Access denied. You are not assigned to this appointment.' });
     }
killedBy: Appointment Routes PUT /:id/complete should fail if doctor is not assigned to the appointment
statusReason: expected 200 to be 403 // Object.is equality

[Killed] StringLiteral
routes/appointments.js:257:46
       return res.status(404).json({ message: 'Appointment not found' });
     }
     if (appointment.doctor.toString() !== req.user.userId) {
-      return res.status(403).json({ message: 'Access denied. You are not assigned to this appointment.' });
+      return res.status(403).json({ message: "" });
     }
     // --- FIX: Add backticks for template literal ---
killedBy: Appointment Routes PUT /:id/complete should fail if doctor is not assigned to the appointment
statusReason: expected '' to be 'Access denied. You are not assigned t…' // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:260:9
       return res.status(403).json({ message: 'Access denied. You are not assigned to this appointment.' });
     }
     // --- FIX: Add backticks for template literal ---
-    if (appointment.status !== 'upcoming') {
+    if (false) {
       return res.status(400).json({ message: `Cannot complete an appointment that is already ${appointment.status}.` });
     }
killedBy: Appointment Routes PUT /:id/complete should fail if appointment is already completed
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ObjectLiteral
routes/appointments.js:261:35
     }
     // --- FIX: Add backticks for template literal ---
     if (appointment.status !== 'upcoming') {
-      return res.status(400).json({ message: `Cannot complete an appointment that is already ${appointment.status}.` });
+      return res.status(400).json({});
     }
 
killedBy: Appointment Routes PUT /:id/complete should fail if appointment is already completed
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
routes/appointments.js:261:46
     }
     // --- FIX: Add backticks for template literal ---
     if (appointment.status !== 'upcoming') {
-      return res.status(400).json({ message: `Cannot complete an appointment that is already ${appointment.status}.` });
+      return res.status(400).json({ message: `` });
     }
 
killedBy: Appointment Routes PUT /:id/complete should fail if appointment is already completed
statusReason: expected '' to contain 'Cannot complete an appointment that i…'

[Survived] BooleanLiteral
routes/appointments.js:265:50
     }
 
     appointment.status = 'completed';
-    await appointment.save({ validateBeforeSave: false });
+    await appointment.save({ validateBeforeSave: true });
     res.json({ message: 'Appointment marked as completed successfully', appointment });
   } catch (err) {

[Killed] BlockStatement
routes/appointments.js:267:17
     appointment.status = 'completed';
     await appointment.save({ validateBeforeSave: false });
     res.json({ message: 'Appointment marked as completed successfully', appointment });
-  } catch (err) {
-    console.error('Complete Appointment Error:', err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: Appointment Routes PUT /:id/complete should handle server errors when completing appointment
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] StringLiteral
routes/appointments.js:268:19
     await appointment.save({ validateBeforeSave: false });
     res.json({ message: 'Appointment marked as completed successfully', appointment });
   } catch (err) {
-    console.error('Complete Appointment Error:', err.message);
+    console.error("", err.message);
     res.status(500).send('Server Error');
   }

[Survived] StringLiteral
routes/appointments.js:280:17
     
     console.log('Payment order request body:', req.body);
     console.log('Doctor ID:', doctorId);
-    console.log('Amount:', amount);
+    console.log("", amount);
     console.log('Currency:', currency);
 

[Killed] ConditionalExpression
routes/appointments.js:284:9
     console.log('Currency:', currency);
 
     // Validate required fields
-    if (!doctorId) {
+    if (true) {
       return res.status(400).json({ message: 'Doctor ID is required.' });
     }
killedBy: Appointment Routes POST /create-payment-order should create a Razorpay order
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:284:9
     console.log('Currency:', currency);
 
     // Validate required fields
-    if (!doctorId) {
+    if (false) {
       return res.status(400).json({ message: 'Doctor ID is required.' });
     }
killedBy: Appointment Routes POST /create-payment-order should return 400 if doctorId is missing
statusReason: expected 404 to be 400 // Object.is equality

[Killed] ObjectLiteral
routes/appointments.js:285:35
 
     // Validate required fields
     if (!doctorId) {
-      return res.status(400).json({ message: 'Doctor ID is required.' });
+      return res.status(400).json({});
     }
     
killedBy: Appointment Routes POST /create-payment-order should return 400 if doctorId is missing
statusReason: expected undefined to be 'Doctor ID is required.' // Object.is equality

[Killed] StringLiteral
routes/appointments.js:285:46
 
     // Validate required fields
     if (!doctorId) {
-      return res.status(400).json({ message: 'Doctor ID is required.' });
+      return res.status(400).json({ message: "" });
     }
     
killedBy: Appointment Routes POST /create-payment-order should return 400 if doctorId is missing
statusReason: expected '' to be 'Doctor ID is required.' // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:288:9
       return res.status(400).json({ message: 'Doctor ID is required.' });
     }
     
-    if (!amount || amount <= 0) {
+    if (false) {
       return res.status(400).json({ message: 'Valid amount is required.' });
     }
killedBy: Appointment Routes POST /create-payment-order should return 400 if amount is missing or invalid
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:288:9
       return res.status(400).json({ message: 'Doctor ID is required.' });
     }
     
-    if (!amount || amount <= 0) {
+    if (true) {
       return res.status(400).json({ message: 'Valid amount is required.' });
     }
killedBy: Appointment Routes POST /create-payment-order should create a Razorpay order
statusReason: expected 400 to be 200 // Object.is equality

[Survived] StringLiteral
routes/appointments.js:306:17
       payment_capture: 1
     };
     
-    console.log('Razorpay order options:', options);
+    console.log("", options);
 
     const order = await razorpay.orders.create(options);

[Killed] BlockStatement
routes/appointments.js:317:19
       currency: order.currency
     });
 
-  } catch (error) {
-    console.error('Payment order creation error:', error);
-    res.status(500).json({
-      success: false,
-      message: 'Failed to create payment order'
-    });
-  }
+  } catch (error) {}
 });
 
killedBy: Appointment Routes POST /create-payment-order should handle Razorpay order creation errors
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
routes/appointments.js:319:26
 
   } catch (error) {
     console.error('Payment order creation error:', error);
-    res.status(500).json({
-      success: false,
-      message: 'Failed to create payment order'
-    });
+    res.status(500).json({});
   }
 });
killedBy: Appointment Routes POST /create-payment-order should handle Razorpay order creation errors
statusReason: expected undefined to be false // Object.is equality

[Killed] StringLiteral
routes/appointments.js:327:13
 });
 
 // Verify payment and book appointment
-router.post('/verify-payment', authMiddleware, async (req, res) => {
+router.post("", authMiddleware, async (req, res) => {
   try {
     const {
killedBy: Appointment Routes POST /verify-payment should verify payment signature and create appointment
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:340:29
     // Verify payment signature
     const body = razorpay_order_id + "|" + razorpay_payment_id;
     const expectedSignature = crypto
-      .createHmac('sha256', process.env.RAZORPAY_KEY_SECRET || 'your_razorpay_key_secret')
+      .createHmac('sha256', true)
       .update(body.toString())
       .digest('hex');
killedBy: Appointment Routes POST /verify-payment should verify payment signature and create appointment
statusReason: expected 500 to be 200 // Object.is equality

[Killed] LogicalOperator
routes/appointments.js:340:29
     // Verify payment signature
     const body = razorpay_order_id + "|" + razorpay_payment_id;
     const expectedSignature = crypto
-      .createHmac('sha256', process.env.RAZORPAY_KEY_SECRET || 'your_razorpay_key_secret')
+      .createHmac('sha256', process.env.RAZORPAY_KEY_SECRET && 'your_razorpay_key_secret')
       .update(body.toString())
       .digest('hex');
killedBy: Appointment Routes POST /verify-payment should verify payment signature and create appointment
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/appointments.js:344:9
       .update(body.toString())
       .digest('hex');
 
-    if (expectedSignature !== razorpay_signature) {
+    if (true) {
       return res.status(400).json({
         success: false,
killedBy: Appointment Routes POST /verify-payment should verify payment signature and create appointment
statusReason: expected 400 to be 200 // Object.is equality
