[Killed] BlockStatement
routes/appointments.js:344:51
       .update(body.toString())
       .digest('hex');
 
-    if (expectedSignature !== razorpay_signature) {
-      return res.status(400).json({
-        success: false,
-        message: 'Payment verification failed'
-      });
-    }
+    if (expectedSignature !== razorpay_signature) {}
 
     // Get doctor's consultation fee
killedBy: Appointment Routes POST /verify-payment should fail if signature is invalid
statusReason: expected 500 to be 400 // Object.is equality

[Survived] BooleanLiteral
routes/appointments.js:346:18
 
     if (expectedSignature !== razorpay_signature) {
       return res.status(400).json({
-        success: false,
+        success: true,
         message: 'Payment verification failed'
       });

[Killed] StringLiteral
routes/appointments.js:347:18
     if (expectedSignature !== razorpay_signature) {
       return res.status(400).json({
         success: false,
-        message: 'Payment verification failed'
+        message: ""
       });
     }
killedBy: Appointment Routes POST /verify-payment should fail if signature is invalid
statusReason: expected '' to be 'Payment verification failed' // Object.is equality

[Killed] BlockStatement
routes/appointments.js:353:18
 
     // Get doctor's consultation fee
     const doctor = await Doctor.findById(doctorId);
-    if (!doctor) {
-      return res.status(404).json({ success: false, message: 'Doctor not found' });
-    }
+    if (!doctor) {}
 
     // Payment verified, now create appointment
killedBy: Appointment Routes POST /verify-payment should return 404 if doctor not found during payment verification
statusReason: expected 500 to be 404 // Object.is equality

[Killed] BooleanLiteral
routes/appointments.js:354:46
     // Get doctor's consultation fee
     const doctor = await Doctor.findById(doctorId);
     if (!doctor) {
-      return res.status(404).json({ success: false, message: 'Doctor not found' });
+      return res.status(404).json({ success: true, message: 'Doctor not found' });
     }
 
killedBy: Appointment Routes POST /verify-payment should return 404 if doctor not found during payment verification
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
routes/appointments.js:364:22
       date: appointmentData.date,
       time: appointmentData.time,
       // Ensure primaryReason is set (some code paths used reasonForVisit previously)
-      primaryReason: appointmentData.primaryReason || appointmentData.reasonForVisit,
+      primaryReason: true,
       reasonForVisit: appointmentData.reasonForVisit || appointmentData.primaryReason,
       symptoms: appointmentData.symptoms || [],

[Survived] ConditionalExpression
routes/appointments.js:364:22
       date: appointmentData.date,
       time: appointmentData.time,
       // Ensure primaryReason is set (some code paths used reasonForVisit previously)
-      primaryReason: appointmentData.primaryReason || appointmentData.reasonForVisit,
+      primaryReason: false,
       reasonForVisit: appointmentData.reasonForVisit || appointmentData.primaryReason,
       symptoms: appointmentData.symptoms || [],

[Survived] LogicalOperator
routes/appointments.js:365:23
       time: appointmentData.time,
       // Ensure primaryReason is set (some code paths used reasonForVisit previously)
       primaryReason: appointmentData.primaryReason || appointmentData.reasonForVisit,
-      reasonForVisit: appointmentData.reasonForVisit || appointmentData.primaryReason,
+      reasonForVisit: appointmentData.reasonForVisit && appointmentData.primaryReason,
       symptoms: appointmentData.symptoms || [],
       patientNameForVisit: appointmentData.patientNameForVisit,

[Survived] ConditionalExpression
routes/appointments.js:365:23
       time: appointmentData.time,
       // Ensure primaryReason is set (some code paths used reasonForVisit previously)
       primaryReason: appointmentData.primaryReason || appointmentData.reasonForVisit,
-      reasonForVisit: appointmentData.reasonForVisit || appointmentData.primaryReason,
+      reasonForVisit: true,
       symptoms: appointmentData.symptoms || [],
       patientNameForVisit: appointmentData.patientNameForVisit,

[Survived] ConditionalExpression
routes/appointments.js:366:17
       // Ensure primaryReason is set (some code paths used reasonForVisit previously)
       primaryReason: appointmentData.primaryReason || appointmentData.reasonForVisit,
       reasonForVisit: appointmentData.reasonForVisit || appointmentData.primaryReason,
-      symptoms: appointmentData.symptoms || [],
+      symptoms: true,
       patientNameForVisit: appointmentData.patientNameForVisit,
       phoneNumber: appointmentData.phoneNumber,

[Survived] ConditionalExpression
routes/appointments.js:366:17
       // Ensure primaryReason is set (some code paths used reasonForVisit previously)
       primaryReason: appointmentData.primaryReason || appointmentData.reasonForVisit,
       reasonForVisit: appointmentData.reasonForVisit || appointmentData.primaryReason,
-      symptoms: appointmentData.symptoms || [],
+      symptoms: false,
       patientNameForVisit: appointmentData.patientNameForVisit,
       phoneNumber: appointmentData.phoneNumber,

[Survived] ConditionalExpression
routes/appointments.js:374:28
       sex: appointmentData.sex,
       primaryLanguage: appointmentData.primaryLanguage,
       symptomsBegin: appointmentData.symptomsBegin,
-      severeSymptomsCheck: appointmentData.severeSymptomsCheck || [],
+      severeSymptomsCheck: true,
       preExistingConditions: appointmentData.preExistingConditions || [],
       pastSurgeries: appointmentData.pastSurgeries,

[Survived] ConditionalExpression
routes/appointments.js:374:28
       sex: appointmentData.sex,
       primaryLanguage: appointmentData.primaryLanguage,
       symptomsBegin: appointmentData.symptomsBegin,
-      severeSymptomsCheck: appointmentData.severeSymptomsCheck || [],
+      severeSymptomsCheck: false,
       preExistingConditions: appointmentData.preExistingConditions || [],
       pastSurgeries: appointmentData.pastSurgeries,

[Survived] LogicalOperator
routes/appointments.js:375:30
       primaryLanguage: appointmentData.primaryLanguage,
       symptomsBegin: appointmentData.symptomsBegin,
       severeSymptomsCheck: appointmentData.severeSymptomsCheck || [],
-      preExistingConditions: appointmentData.preExistingConditions || [],
+      preExistingConditions: appointmentData.preExistingConditions && [],
       pastSurgeries: appointmentData.pastSurgeries,
       familyHistory: appointmentData.familyHistory || [],

[Survived] ConditionalExpression
routes/appointments.js:375:30
       primaryLanguage: appointmentData.primaryLanguage,
       symptomsBegin: appointmentData.symptomsBegin,
       severeSymptomsCheck: appointmentData.severeSymptomsCheck || [],
-      preExistingConditions: appointmentData.preExistingConditions || [],
+      preExistingConditions: true,
       pastSurgeries: appointmentData.pastSurgeries,
       familyHistory: appointmentData.familyHistory || [],

[Survived] ConditionalExpression
routes/appointments.js:377:22
       severeSymptomsCheck: appointmentData.severeSymptomsCheck || [],
       preExistingConditions: appointmentData.preExistingConditions || [],
       pastSurgeries: appointmentData.pastSurgeries,
-      familyHistory: appointmentData.familyHistory || [],
+      familyHistory: false,
       allergies: appointmentData.allergies,
       medications: appointmentData.medications,

[Survived] LogicalOperator
routes/appointments.js:377:22
       severeSymptomsCheck: appointmentData.severeSymptomsCheck || [],
       preExistingConditions: appointmentData.preExistingConditions || [],
       pastSurgeries: appointmentData.pastSurgeries,
-      familyHistory: appointmentData.familyHistory || [],
+      familyHistory: appointmentData.familyHistory && [],
       allergies: appointmentData.allergies,
       medications: appointmentData.medications,

[Killed] ConditionalExpression
routes/appointments.js:386:33
       orderId: razorpay_order_id,
       paymentStatus: 'paid',
       status: 'upcoming',
-      consultationFeeAtBooking: doctor.consultationFee || 0
+      consultationFeeAtBooking: true
     });
 
killedBy: Appointment Routes POST /verify-payment verify-payment should use default consultationFee 0 when doctor.consultationFee is missing (mocked doctor)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] LogicalOperator
routes/appointments.js:386:33
       orderId: razorpay_order_id,
       paymentStatus: 'paid',
       status: 'upcoming',
-      consultationFeeAtBooking: doctor.consultationFee || 0
+      consultationFeeAtBooking: doctor.consultationFee && 0
     });
 
killedBy: Appointment Routes POST /verify-payment verify-payment should use default consultationFee 0 when doctor.consultationFee is missing (mocked doctor)
statusReason: expected 500 to be 200 // Object.is equality

[Survived] ConditionalExpression
routes/appointments.js:439:24
           </div>
           
           <div style="text-align: center; margin: 30px 0;">
-            <a href="${process.env.CLIENT_URL || 'https://smart-healthcare-appointment-and-triage.onrender.com'}/patient/dashboard" 
+            <a href="${true}/patient/dashboard" 
                style="background-color: #16a34a; color: white; padding: 12px 30px; text-decoration: none; border-radius: 6px; font-weight: 600; display: inline-block; margin-right: 10px;">
               View My Appointments

[Survived] LogicalOperator
routes/appointments.js:439:24
           </div>
           
           <div style="text-align: center; margin: 30px 0;">
-            <a href="${process.env.CLIENT_URL || 'https://smart-healthcare-appointment-and-triage.onrender.com'}/patient/dashboard" 
+            <a href="${process.env.CLIENT_URL && 'https://smart-healthcare-appointment-and-triage.onrender.com'}/patient/dashboard" 
                style="background-color: #16a34a; color: white; padding: 12px 30px; text-decoration: none; border-radius: 6px; font-weight: 600; display: inline-block; margin-right: 10px;">
               View My Appointments

[Killed] BlockStatement
routes/appointments.js:458:9
       </div>
     `;
 
-    try {
-      await sendEmail({
-        email: appointmentData.email,
-        subject: '🎉 Payment Successful - Appointment Confirmed | IntelliConsult',
-        html: emailHtml
-      });
-    } catch (emailError) {
+    try {} catch (emailError) {
       console.error('Error sending payment confirmation email:', emailError);
       // Continue with the response even if email fails
killedBy: Appointment Routes POST /verify-payment should verify payment signature and create appointment
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] StringLiteral
routes/appointments.js:461:18
     try {
       await sendEmail({
         email: appointmentData.email,
-        subject: '🎉 Payment Successful - Appointment Confirmed | IntelliConsult',
+        subject: ""
         html: emailHtml
       });
killedBy: Appointment Routes POST /verify-payment should verify payment signature and create appointment
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] BlockStatement
routes/appointments.js:464:26
         subject: '🎉 Payment Successful - Appointment Confirmed | IntelliConsult',
         html: emailHtml
       });
-    } catch (emailError) {
-      console.error('Error sending payment confirmation email:', emailError);
-      // Continue with the response even if email fails
-    }
+    } catch (emailError) {}
 
     res.json({

[Survived] StringLiteral
routes/appointments.js:465:21
         html: emailHtml
       });
     } catch (emailError) {
-      console.error('Error sending payment confirmation email:', emailError);
+      console.error("", emailError);
       // Continue with the response even if email fails
     }

[Killed] ObjectLiteral
routes/appointments.js:469:14
       // Continue with the response even if email fails
     }
 
-    res.json({
-      success: true,
-      message: 'Payment verified and appointment booked successfully',
-      appointment: appointment
-    });
+    res.json({});
 
   } catch (error) {
killedBy: Appointment Routes POST /verify-payment should verify payment signature and create appointment
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
routes/appointments.js:475:19
       appointment: appointment
     });
 
-  } catch (error) {
-    console.error('Payment verification error:', error);
-    res.status(500).json({
-      success: false,
-      message: 'Payment verification failed'
-    });
-  }
+  } catch (error) {}
 });
 
killedBy: Appointment Routes POST /verify-payment should handle general payment verification errors (Doctor.findById throws)
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
routes/appointments.js:477:26
 
   } catch (error) {
     console.error('Payment verification error:', error);
-    res.status(500).json({
-      success: false,
-      message: 'Payment verification failed'
-    });
+    res.status(500).json({});
   }
 });
killedBy: Appointment Routes POST /verify-payment should handle general payment verification errors (Doctor.findById throws)
statusReason: expected undefined to be false // Object.is equality
