[Killed] LogicalOperator
routes/prescriptions.js:11:7
 const PDFDocument = require('pdfkit');
 
 async function sendPrescriptionSummaryEmail(medicalRecord, patient, doctor) {
-  if (!patient || !patient.email) {
+  if (!patient && !patient.email) {
     console.error('Cannot send prescription summary: Patient email is missing.');
     return;
killedBy: POST /api/prescriptions should not call sendEmail when patient email is missing (early return branch)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] ConditionalExpression
routes/prescriptions.js:11:7
 const PDFDocument = require('pdfkit');
 
 async function sendPrescriptionSummaryEmail(medicalRecord, patient, doctor) {
-  if (!patient || !patient.email) {
+  if (false) {
     console.error('Cannot send prescription summary: Patient email is missing.');
     return;
killedBy: POST /api/prescriptions should not call sendEmail when patient email is missing (early return branch)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Survived] StringLiteral
routes/prescriptions.js:12:19
 
 async function sendPrescriptionSummaryEmail(medicalRecord, patient, doctor) {
   if (!patient || !patient.email) {
-    console.error('Cannot send prescription summary: Patient email is missing.');
+    console.error("");
     return;
   }

[Killed] ConditionalExpression
routes/prescriptions.js:17:35
   }
 
   try {
-    const followUpDateFormatted = medicalRecord.followUpRequired && medicalRecord.followUpDate
+    const followUpDateFormatted = false
       ? new Date(medicalRecord.followUpDate).toLocaleDateString('en-US', {
         weekday: 'long',
killedBy: POST /api/prescriptions should include follow-up and empty-prescription text in queued email
statusReason: expected '\n      <body style="margin: 0; paddi…' to contain '📋 Follow-up Details'

[Survived] LogicalOperator
routes/prescriptions.js:17:35
   }
 
   try {
-    const followUpDateFormatted = medicalRecord.followUpRequired && medicalRecord.followUpDate
+    const followUpDateFormatted = medicalRecord.followUpRequired || medicalRecord.followUpDate
       ? new Date(medicalRecord.followUpDate).toLocaleDateString('en-US', {
         weekday: 'long',

[Killed] StringLiteral
routes/prescriptions.js:18:65
 
   try {
     const followUpDateFormatted = medicalRecord.followUpRequired && medicalRecord.followUpDate
-      ? new Date(medicalRecord.followUpDate).toLocaleDateString('en-US', {
+      ? new Date(medicalRecord.followUpDate).toLocaleDateString("", {
         weekday: 'long',
         year: 'numeric',
killedBy: POST /api/prescriptions should create a new prescription successfully and queue email
statusReason: expected "vi.fn()" to be called at least once

[Killed] StringLiteral
routes/prescriptions.js:20:15
     const followUpDateFormatted = medicalRecord.followUpRequired && medicalRecord.followUpDate
       ? new Date(medicalRecord.followUpDate).toLocaleDateString('en-US', {
         weekday: 'long',
-        year: 'numeric',
+        year: "",
         month: 'long',
         day: 'numeric'
killedBy: POST /api/prescriptions should create a new prescription successfully and queue email
statusReason: expected "vi.fn()" to be called at least once

[Killed] StringLiteral
routes/prescriptions.js:22:14
         weekday: 'long',
         year: 'numeric',
         month: 'long',
-        day: 'numeric'
+        day: ""
       })
       : null;
killedBy: POST /api/prescriptions should create a new prescription successfully and queue email
statusReason: expected "vi.fn()" to be called at least once

[Killed] EqualityOperator
routes/prescriptions.js:26:34
       })
       : null;
 
-    const prescriptionHtmlList = medicalRecord.prescription.length > 0
+    const prescriptionHtmlList = medicalRecord.prescription.length <= 0
       ? '<ul style="padding-left: 20px; margin: 0;">' + medicalRecord.prescription.map(item =>
         `<li style="margin-bottom: 12px;">
killedBy: POST /api/prescriptions should include follow-up and empty-prescription text in queued email
statusReason: expected '\n      <body style="margin: 0; paddi…' to contain 'No specific prescription items listed.'

[Killed] ConditionalExpression
routes/prescriptions.js:26:34
       })
       : null;
 
-    const prescriptionHtmlList = medicalRecord.prescription.length > 0
+    const prescriptionHtmlList = true
       ? '<ul style="padding-left: 20px; margin: 0;">' + medicalRecord.prescription.map(item =>
         `<li style="margin-bottom: 12px;">
killedBy: POST /api/prescriptions should include follow-up and empty-prescription text in queued email
statusReason: expected '\n      <body style="margin: 0; paddi…' to contain 'No specific prescription items listed.'

[Survived] ArrowFunction
routes/prescriptions.js:27:88
       : null;
 
     const prescriptionHtmlList = medicalRecord.prescription.length > 0
-      ? '<ul style="padding-left: 20px; margin: 0;">' + medicalRecord.prescription.map(item =>
-        `<li style="margin-bottom: 12px;">
-           <strong style="color: #111827; font-size: 16px;">${item.medication || 'Item'}</strong><br> 
-           ${item.dosage ? `<span style="color: #555;">Dosage:</span> ${item.dosage}<br>` : ''}
-           ${item.frequency ? `<span style="color: #555;">Frequency:</span> ${item.frequency}<br>` : ''}
-           ${item.instructions ? `<span style="color: #555;">Instructions:</span> ${item.instructions}` : ''}
-         </li>`
+      ? '<ul style="padding-left: 20px; margin: 0;">' + medicalRecord.prescription.map(() => undefined
       ).join('') + '</ul>'
       : '<p style="margin: 0;">No specific prescription items listed.</p>';

[Survived] ConditionalExpression
routes/prescriptions.js:29:63
     const prescriptionHtmlList = medicalRecord.prescription.length > 0
       ? '<ul style="padding-left: 20px; margin: 0;">' + medicalRecord.prescription.map(item =>
         `<li style="margin-bottom: 12px;">
-           <strong style="color: #111827; font-size: 16px;">${item.medication || 'Item'}</strong><br> 
+           <strong style="color: #111827; font-size: 16px;">${true}</strong><br> 
            ${item.dosage ? `<span style="color: #555;">Dosage:</span> ${item.dosage}<br>` : ''}
            ${item.frequency ? `<span style="color: #555;">Frequency:</span> ${item.frequency}<br>` : ''}

[Survived] LogicalOperator
routes/prescriptions.js:29:63
     const prescriptionHtmlList = medicalRecord.prescription.length > 0
       ? '<ul style="padding-left: 20px; margin: 0;">' + medicalRecord.prescription.map(item =>
         `<li style="margin-bottom: 12px;">
-           <strong style="color: #111827; font-size: 16px;">${item.medication || 'Item'}</strong><br> 
+           <strong style="color: #111827; font-size: 16px;">${item.medication && 'Item'}</strong><br> 
            ${item.dosage ? `<span style="color: #555;">Dosage:</span> ${item.dosage}<br>` : ''}
            ${item.frequency ? `<span style="color: #555;">Frequency:</span> ${item.frequency}<br>` : ''}

[Survived] StringLiteral
routes/prescriptions.js:30:28
       ? '<ul style="padding-left: 20px; margin: 0;">' + medicalRecord.prescription.map(item =>
         `<li style="margin-bottom: 12px;">
            <strong style="color: #111827; font-size: 16px;">${item.medication || 'Item'}</strong><br> 
-           ${item.dosage ? `<span style="color: #555;">Dosage:</span> ${item.dosage}<br>` : ''}
+           ${item.dosage ? `` : ''}
            ${item.frequency ? `<span style="color: #555;">Frequency:</span> ${item.frequency}<br>` : ''}
            ${item.instructions ? `<span style="color: #555;">Instructions:</span> ${item.instructions}` : ''}

[Killed] ConditionalExpression
routes/prescriptions.js:37:26
       ).join('') + '</ul>'
       : '<p style="margin: 0;">No specific prescription items listed.</p>';
 
-    const followUpHtml = medicalRecord.followUpRequired && followUpDateFormatted
+    const followUpHtml = false
       ? `
       <div style="background-color: #f0fdf4; border: 1px solid #bbf7d0; padding: 20px; border-radius: 8px; margin-bottom: 20px;">
killedBy: POST /api/prescriptions should include follow-up and empty-prescription text in queued email
statusReason: expected '\n      <body style="margin: 0; paddi…' to contain '📋 Follow-up Details'

[Survived] LogicalOperator
routes/prescriptions.js:37:26
       ).join('') + '</ul>'
       : '<p style="margin: 0;">No specific prescription items listed.</p>';
 
-    const followUpHtml = medicalRecord.followUpRequired && followUpDateFormatted
+    const followUpHtml = medicalRecord.followUpRequired || followUpDateFormatted
       ? `
       <div style="background-color: #f0fdf4; border: 1px solid #bbf7d0; padding: 20px; border-radius: 8px; margin-bottom: 20px;">

[Killed] StringLiteral
routes/prescriptions.js:49:58
       `
       : '';
 
-    const actionsHtml = medicalRecord.followUpRequired ? `
-      <div style="text-align: center; margin: 30px 0 15px;">
-        <a href="${process.env.CLIENT_URL || 'https://smart-healthcare-appointment-and-triage.onrender.com'}/patient/dashboard" 
-           style="background-color: #0F5257; color: #ffffff; padding: 12px 25px; text-decoration: none; border-radius: 5px; font-weight: bold; font-size: 16px; display: inline-block;">
-          Book Follow-up
-        </a>
-      </div>
-      ` : '';
+    const actionsHtml = medicalRecord.followUpRequired ? `` : '';
 
     const emailHtml = `
killedBy: POST /api/prescriptions should include follow-up and empty-prescription text in queued email
statusReason: expected '\n      <body style="margin: 0; paddi…' to contain 'Book Follow-up'

[Survived] ConditionalExpression
routes/prescriptions.js:51:20
 
     const actionsHtml = medicalRecord.followUpRequired ? `
       <div style="text-align: center; margin: 30px 0 15px;">
-        <a href="${process.env.CLIENT_URL || 'https://smart-healthcare-appointment-and-triage.onrender.com'}/patient/dashboard" 
+        <a href="${false}/patient/dashboard" 
            style="background-color: #0F5257; color: #ffffff; padding: 12px 25px; text-decoration: none; border-radius: 5px; font-weight: bold; font-size: 16px; display: inline-block;">
           Book Follow-up

[Survived] ConditionalExpression
routes/prescriptions.js:51:20
 
     const actionsHtml = medicalRecord.followUpRequired ? `
       <div style="text-align: center; margin: 30px 0 15px;">
-        <a href="${process.env.CLIENT_URL || 'https://smart-healthcare-appointment-and-triage.onrender.com'}/patient/dashboard" 
+        <a href="${true}/patient/dashboard" 
            style="background-color: #0F5257; color: #ffffff; padding: 12px 25px; text-decoration: none; border-radius: 5px; font-weight: bold; font-size: 16px; display: inline-block;">
           Book Follow-up

[Survived] ConditionalExpression
routes/prescriptions.js:69:72
           <div style="padding: 30px;">
             <h2 style="color: #333; margin-top: 0; margin-bottom: 20px; font-size: 22px;">Dear ${patient.fullName},</h2>
             <p style="color: #555; line-height: 1.6; font-size: 16px; margin-bottom: 25px;">
-              Here is the summary from your recent consultation with ${doctor.fullName || 'your doctor'}.
+              Here is the summary from your recent consultation with ${true}.
             </p>
 

[Survived] LogicalOperator
routes/prescriptions.js:69:72
           <div style="padding: 30px;">
             <h2 style="color: #333; margin-top: 0; margin-bottom: 20px; font-size: 22px;">Dear ${patient.fullName},</h2>
             <p style="color: #555; line-height: 1.6; font-size: 16px; margin-bottom: 25px;">
-              Here is the summary from your recent consultation with ${doctor.fullName || 'your doctor'}.
+              Here is the summary from your recent consultation with ${doctor.fullName && 'your doctor'}.
             </p>
 

[Survived] StringLiteral
routes/prescriptions.js:79:37
               </div>
             </div>
 
-            ${medicalRecord.notes ? `
-            <div style="margin-bottom: 25px;">
-              <h3 style="font-size: 18px; color: #0F5257; margin-bottom: 10px; border-bottom: 2px solid #e5e7eb; padding-bottom: 5px; font-weight: 600;">Doctor's Notes</h3>
-              <div style="background-color: #f9f9f9; padding: 15px; border-radius: 5px;">
-                <p style="color: #333; line-height: 1.6; font-size: 16px; margin: 0;">${medicalRecord.notes}</p>
-              </div>
-            </div>
-            ` : ''}
+            ${medicalRecord.notes ? `` : ''}
             
             <div style="margin-bottom: 25px;">

[Survived] StringLiteral
routes/prescriptions.js:86:17
                 <p style="color: #333; line-height: 1.6; font-size: 16px; margin: 0;">${medicalRecord.notes}</p>
               </div>
             </div>
-            ` : ''}
+            ` : "Stryker was here!"}
             
             <div style="margin-bottom: 25px;">

[Killed] ObjectLiteral
routes/prescriptions.js:108:21
       </body>
     `;
 
-    await sendEmail({
-      email: patient.email,
-      subject: `🩺 Your Consultation Summary - IntelliConsult`,
-      html: emailHtml
-    });
+    await sendEmail({});
 
   } catch (emailError) {
killedBy: POST /api/prescriptions should include follow-up and empty-prescription text in queued email
statusReason: expected undefined to be 'email.present@test.com' // Object.is equality

[Survived] StringLiteral
routes/prescriptions.js:110:16
 
     await sendEmail({
       email: patient.email,
-      subject: `🩺 Your Consultation Summary - IntelliConsult`,
+      subject: ``
       html: emailHtml
     });

[NoCoverage] BlockStatement
routes/prescriptions.js:114:24
       html: emailHtml
     });
 
-  } catch (emailError) {
-    console.error('Error sending prescription summary email:', emailError);
-  }
+  } catch (emailError) {}
 }
 

[Survived] StringLiteral
routes/prescriptions.js:119:13
   }
 }
 
-router.post('/', authMiddleware, async (req, res) => {
+router.post("", authMiddleware, async (req, res) => {
   if (req.user.userType !== 'doctor') {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });

[Killed] ConditionalExpression
routes/prescriptions.js:120:7
 }
 
 router.post('/', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
+  if (false) {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
killedBy: POST /api/prescriptions should return 403 if user is not a doctor
statusReason: expected 404 to be 403 // Object.is equality

[Killed] BlockStatement
routes/prescriptions.js:120:39
 }
 
 router.post('/', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
-    return res.status(403).json({ message: 'Access denied. Not a doctor.' });
-  }
+  if (req.user.userType !== 'doctor') {}
 
   try {
killedBy: POST /api/prescriptions should return 403 if user is not a doctor
statusReason: expected 404 to be 403 // Object.is equality

[Killed] OptionalChaining
routes/prescriptions.js:135:37
       followUpNotes
     } = req.body;
 
-    const normalizedAppointmentId = appointmentId?.trim();
+    const normalizedAppointmentId = appointmentId.trim();
 
     if (!normalizedAppointmentId || !diagnosis) {
killedBy: POST /api/prescriptions should return 400 if appointmentId is missing
statusReason: expected 500 to be 400 // Object.is equality

[Killed] MethodExpression
routes/prescriptions.js:135:37
       followUpNotes
     } = req.body;
 
-    const normalizedAppointmentId = appointmentId?.trim();
+    const normalizedAppointmentId = appointmentId;
 
     if (!normalizedAppointmentId || !diagnosis) {
killedBy: POST /api/prescriptions should create prescription without follow-up
statusReason: expected 400 to be 201 // Object.is equality

[Killed] BlockStatement
routes/prescriptions.js:137:49
 
     const normalizedAppointmentId = appointmentId?.trim();
 
-    if (!normalizedAppointmentId || !diagnosis) {
-      return res.status(400).json({ message: 'Appointment ID and diagnosis are required.' });
-    }
+    if (!normalizedAppointmentId || !diagnosis) {}
 
     const appointment = await Appointment.findById(normalizedAppointmentId)
killedBy: POST /api/prescriptions should return 400 if appointmentId is missing
statusReason: expected 404 to be 400 // Object.is equality

[Killed] BooleanLiteral
routes/prescriptions.js:137:37
 
     const normalizedAppointmentId = appointmentId?.trim();
 
-    if (!normalizedAppointmentId || !diagnosis) {
+    if (!normalizedAppointmentId || diagnosis) {
       return res.status(400).json({ message: 'Appointment ID and diagnosis are required.' });
     }
killedBy: POST /api/prescriptions should create a new prescription successfully and queue email
statusReason: expected 400 to be 201 // Object.is equality

[Survived] StringLiteral
routes/prescriptions.js:143:27
 
     const appointment = await Appointment.findById(normalizedAppointmentId)
       .populate('patient', 'fullName email')
-      .populate('doctor', 'fullName email');
+      .populate('doctor', "");
 
     if (!appointment) {

[Killed] BlockStatement
routes/prescriptions.js:145:23
       .populate('patient', 'fullName email')
       .populate('doctor', 'fullName email');
 
-    if (!appointment) {
-      return res.status(404).json({ message: 'Appointment not found.' });
-    }
+    if (!appointment) {}
 
     const doctorIdString = appointment.doctor._id ? appointment.doctor._id.toString() : appointment.doctor.toString();
killedBy: POST /api/prescriptions should return 404 if appointment not found
statusReason: expected 500 to be 404 // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:145:9
       .populate('patient', 'fullName email')
       .populate('doctor', 'fullName email');
 
-    if (!appointment) {
+    if (true) {
       return res.status(404).json({ message: 'Appointment not found.' });
     }
killedBy: POST /api/prescriptions should create a new prescription successfully and queue email
statusReason: expected 404 to be 201 // Object.is equality

[Killed] StringLiteral
routes/prescriptions.js:146:46
       .populate('doctor', 'fullName email');
 
     if (!appointment) {
-      return res.status(404).json({ message: 'Appointment not found.' });
+      return res.status(404).json({ message: "" });
     }
 
killedBy: POST /api/prescriptions should return 404 if appointment not found
statusReason: expected '' to be 'Appointment not found.' // Object.is equality

[Killed] BlockStatement
routes/prescriptions.js:150:45
     }
 
     const doctorIdString = appointment.doctor._id ? appointment.doctor._id.toString() : appointment.doctor.toString();
-    if (doctorIdString !== req.user.userId) {
-      return res.status(403).json({ message: 'Access denied. This appointment does not belong to you.' });
-    }
+    if (doctorIdString !== req.user.userId) {}
 
     const existingRecord = await MedicalRecord.findOne({ appointment: normalizedAppointmentId });
killedBy: POST /api/prescriptions should return 403 if doctor tries to create prescription for another doctor's appointment
statusReason: expected 201 to be 403 // Object.is equality

[Killed] EqualityOperator
routes/prescriptions.js:150:9
     }
 
     const doctorIdString = appointment.doctor._id ? appointment.doctor._id.toString() : appointment.doctor.toString();
-    if (doctorIdString !== req.user.userId) {
+    if (doctorIdString === req.user.userId) {
       return res.status(403).json({ message: 'Access denied. This appointment does not belong to you.' });
     }
killedBy: POST /api/prescriptions should create a new prescription successfully and queue email
statusReason: expected 403 to be 201 // Object.is equality

[Killed] ObjectLiteral
routes/prescriptions.js:151:35
 
     const doctorIdString = appointment.doctor._id ? appointment.doctor._id.toString() : appointment.doctor.toString();
     if (doctorIdString !== req.user.userId) {
-      return res.status(403).json({ message: 'Access denied. This appointment does not belong to you.' });
+      return res.status(403).json({});
     }
 
killedBy: POST /api/prescriptions should return 403 if doctor tries to create prescription for another doctor's appointment
statusReason: expected undefined to be 'Access denied. This appointment does …' // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:155:9
     }
 
     const existingRecord = await MedicalRecord.findOne({ appointment: normalizedAppointmentId });
-    if (existingRecord) {
+    if (true) {
       return res.status(400).json({ message: 'Prescription already exists for this appointment. Use update endpoint instead.' });
     }
killedBy: POST /api/prescriptions should create a new prescription successfully and queue email
statusReason: expected 400 to be 201 // Object.is equality

[Killed] BlockStatement
routes/prescriptions.js:155:25
     }
 
     const existingRecord = await MedicalRecord.findOne({ appointment: normalizedAppointmentId });
-    if (existingRecord) {
-      return res.status(400).json({ message: 'Prescription already exists for this appointment. Use update endpoint instead.' });
-    }
+    if (existingRecord) {}
 
     const patientId = appointment.patient._id ? appointment.patient._id : appointment.patient;
killedBy: POST /api/prescriptions should return 400 if prescription already exists for appointment
statusReason: expected 201 to be 400 // Object.is equality

[Survived] MethodExpression
routes/prescriptions.js:166:18
       appointment: normalizedAppointmentId,
       patient: patientId,
       doctor: doctorId,
-      diagnosis: diagnosis.trim(),
+      diagnosis: diagnosis,
       notes: notes ? notes.trim() : '',
       prescription: prescription || [],

[Survived] MethodExpression
routes/prescriptions.js:167:22
       patient: patientId,
       doctor: doctorId,
       diagnosis: diagnosis.trim(),
-      notes: notes ? notes.trim() : '',
+      notes: notes ? notes : '',
       prescription: prescription || [],
       followUpRequired: followUpRequired || false,

[Survived] StringLiteral
routes/prescriptions.js:167:37
       patient: patientId,
       doctor: doctorId,
       diagnosis: diagnosis.trim(),
-      notes: notes ? notes.trim() : '',
+      notes: notes ? notes.trim() : "Stryker was here!",
       prescription: prescription || [],
       followUpRequired: followUpRequired || false,

[Killed] ConditionalExpression
routes/prescriptions.js:168:21
       doctor: doctorId,
       diagnosis: diagnosis.trim(),
       notes: notes ? notes.trim() : '',
-      prescription: prescription || [],
+      prescription: true,
       followUpRequired: followUpRequired || false,
       followUpDate: followUpRequired && followUpDate ? new Date(followUpDate) : null,
killedBy: POST /api/prescriptions should create a new prescription successfully and queue email
statusReason: expected 500 to be 201 // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:168:21
       doctor: doctorId,
       diagnosis: diagnosis.trim(),
       notes: notes ? notes.trim() : '',
-      prescription: prescription || [],
+      prescription: false,
       followUpRequired: followUpRequired || false,
       followUpDate: followUpRequired && followUpDate ? new Date(followUpDate) : null,
killedBy: POST /api/prescriptions should create a new prescription successfully and queue email
statusReason: expected 500 to be 201 // Object.is equality

[Killed] BooleanLiteral
routes/prescriptions.js:169:45
       diagnosis: diagnosis.trim(),
       notes: notes ? notes.trim() : '',
       prescription: prescription || [],
-      followUpRequired: followUpRequired || false,
+      followUpRequired: followUpRequired || true,
       followUpDate: followUpRequired && followUpDate ? new Date(followUpDate) : null,
       followUpNotes: followUpRequired && followUpNotes ? followUpNotes.trim() : '',
killedBy: POST /api/prescriptions should create prescription without follow-up
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:169:25
       diagnosis: diagnosis.trim(),
       notes: notes ? notes.trim() : '',
       prescription: prescription || [],
-      followUpRequired: followUpRequired || false,
+      followUpRequired: false,
       followUpDate: followUpRequired && followUpDate ? new Date(followUpDate) : null,
       followUpNotes: followUpRequired && followUpNotes ? followUpNotes.trim() : '',
killedBy: POST /api/prescriptions should create a new prescription successfully and queue email
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:170:21
       notes: notes ? notes.trim() : '',
       prescription: prescription || [],
       followUpRequired: followUpRequired || false,
-      followUpDate: followUpRequired && followUpDate ? new Date(followUpDate) : null,
+      followUpDate: true ? new Date(followUpDate) : null,
       followUpNotes: followUpRequired && followUpNotes ? followUpNotes.trim() : '',
       createdBy: req.user.userId
killedBy: POST /api/prescriptions should create prescription without follow-up
statusReason: expected 500 to be 201 // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:170:21
       notes: notes ? notes.trim() : '',
       prescription: prescription || [],
       followUpRequired: followUpRequired || false,
-      followUpDate: followUpRequired && followUpDate ? new Date(followUpDate) : null,
+      followUpDate: false ? new Date(followUpDate) : null,
       followUpNotes: followUpRequired && followUpNotes ? followUpNotes.trim() : '',
       createdBy: req.user.userId
killedBy: POST /api/prescriptions should include follow-up and empty-prescription text in queued email
statusReason: expected '\n      <body style="margin: 0; paddi…' to contain '📋 Follow-up Details'

[Killed] LogicalOperator
routes/prescriptions.js:171:22
       prescription: prescription || [],
       followUpRequired: followUpRequired || false,
       followUpDate: followUpRequired && followUpDate ? new Date(followUpDate) : null,
-      followUpNotes: followUpRequired && followUpNotes ? followUpNotes.trim() : '',
+      followUpNotes: followUpRequired || followUpNotes ? followUpNotes.trim() : '',
       createdBy: req.user.userId
     });
killedBy: GET /api/prescriptions/:recordId/pdf Extra edge cases to increase coverage POST should return 400 when followUpRequired true but followUpDate missing
statusReason: expected [ 200, 201, 400 ] to include 500

[Killed] ConditionalExpression
routes/prescriptions.js:171:22
       prescription: prescription || [],
       followUpRequired: followUpRequired || false,
       followUpDate: followUpRequired && followUpDate ? new Date(followUpDate) : null,
-      followUpNotes: followUpRequired && followUpNotes ? followUpNotes.trim() : '',
+      followUpNotes: true ? followUpNotes.trim() : '',
       createdBy: req.user.userId
     });
killedBy: POST /api/prescriptions should create prescription without follow-up
statusReason: expected 500 to be 201 // Object.is equality

[Killed] BlockStatement
routes/prescriptions.js:177:9
 
     await medicalRecord.save();
 
-    try {
-      await sendPrescriptionSummaryEmail(medicalRecord, appointment.patient, appointment.doctor);
-    } catch (emailError) {
+    try {} catch (emailError) {
       console.error('Error queuing prescription summary email:', emailError);
     }
killedBy: POST /api/prescriptions should create a new prescription successfully and queue email
statusReason: expected "vi.fn()" to be called at least once

[NoCoverage] BlockStatement
routes/prescriptions.js:179:26
 
     try {
       await sendPrescriptionSummaryEmail(medicalRecord, appointment.patient, appointment.doctor);
-    } catch (emailError) {
-      console.error('Error queuing prescription summary email:', emailError);
-    }
+    } catch (emailError) {}
 
     res.status(201).json({

[Killed] ObjectLiteral
routes/prescriptions.js:183:26
       console.error('Error queuing prescription summary email:', emailError);
     }
 
-    res.status(201).json({
-      success: true,
-      message: 'Prescription saved successfully',
-      medicalRecord
-    });
+    res.status(201).json({});
 
   } catch (err) {
killedBy: POST /api/prescriptions should create a new prescription successfully and queue email
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
routes/prescriptions.js:184:16
     }
 
     res.status(201).json({
-      success: true,
+      success: false,
       message: 'Prescription saved successfully',
       medicalRecord
killedBy: POST /api/prescriptions should create a new prescription successfully and queue email
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
routes/prescriptions.js:189:17
       medicalRecord
     });
 
-  } catch (err) {
-    console.error('Error creating prescription:', err);
-    res.status(500).json({ message: 'Server error while saving prescription.' });
-  }
+  } catch (err) {}
 });
 
killedBy: POST /api/prescriptions should return 500 on database error
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
