[Killed] MethodExpression
routes/prescriptions.js:198:37
 router.get('/appointment/:appointmentId', authMiddleware, async (req, res) => {
   try {
     const { appointmentId } = req.params;
-    const normalizedAppointmentId = appointmentId?.trim();
+    const normalizedAppointmentId = appointmentId;
 
     if (!normalizedAppointmentId) {
killedBy: GET /api/prescriptions/appointment/:appointmentId should return 400 if appointmentId is missing
statusReason: expected 500 to be 400 // Object.is equality

[Survived] OptionalChaining
routes/prescriptions.js:198:37
 router.get('/appointment/:appointmentId', authMiddleware, async (req, res) => {
   try {
     const { appointmentId } = req.params;
-    const normalizedAppointmentId = appointmentId?.trim();
+    const normalizedAppointmentId = appointmentId.trim();
 
     if (!normalizedAppointmentId) {

[Killed] BooleanLiteral
routes/prescriptions.js:200:9
     const { appointmentId } = req.params;
     const normalizedAppointmentId = appointmentId?.trim();
 
-    if (!normalizedAppointmentId) {
+    if (normalizedAppointmentId) {
       return res.status(400).json({ message: 'Appointment ID is required.' });
     }
killedBy: GET /api/prescriptions/appointment/:appointmentId should get prescription for appointment as doctor
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:200:9
     const { appointmentId } = req.params;
     const normalizedAppointmentId = appointmentId?.trim();
 
-    if (!normalizedAppointmentId) {
+    if (false) {
       return res.status(400).json({ message: 'Appointment ID is required.' });
     }
killedBy: GET /api/prescriptions/appointment/:appointmentId should return 400 if appointmentId is missing
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ObjectLiteral
routes/prescriptions.js:201:35
     const normalizedAppointmentId = appointmentId?.trim();
 
     if (!normalizedAppointmentId) {
-      return res.status(400).json({ message: 'Appointment ID is required.' });
+      return res.status(400).json({});
     }
 
killedBy: GET /api/prescriptions/appointment/:appointmentId should return 400 if appointmentId is missing
statusReason: expected undefined to be 'Appointment ID is required.' // Object.is equality

[Killed] BooleanLiteral
routes/prescriptions.js:205:9
     }
 
     const appointment = await Appointment.findById(normalizedAppointmentId);
-    if (!appointment) {
+    if (appointment) {
       return res.status(404).json({ message: 'Appointment not found.' });
     }
killedBy: GET /api/prescriptions/appointment/:appointmentId should get prescription for appointment as doctor
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:205:9
     }
 
     const appointment = await Appointment.findById(normalizedAppointmentId);
-    if (!appointment) {
+    if (true) {
       return res.status(404).json({ message: 'Appointment not found.' });
     }
killedBy: GET /api/prescriptions/appointment/:appointmentId should get prescription for appointment as doctor
statusReason: expected 404 to be 200 // Object.is equality

[Killed] EqualityOperator
routes/prescriptions.js:209:9
       return res.status(404).json({ message: 'Appointment not found.' });
     }
 
-    if (req.user.userType === 'doctor' && appointment.doctor.toString() !== req.user.userId) {
+    if (req.user.userType !== 'doctor' && appointment.doctor.toString() !== req.user.userId) {
       return res.status(403).json({ message: 'Access denied.' });
     }
killedBy: GET /api/prescriptions/appointment/:appointmentId should get prescription for appointment as patient
statusReason: expected 403 to be 200 // Object.is equality

[Killed] LogicalOperator
routes/prescriptions.js:209:9
       return res.status(404).json({ message: 'Appointment not found.' });
     }
 
-    if (req.user.userType === 'doctor' && appointment.doctor.toString() !== req.user.userId) {
+    if (req.user.userType === 'doctor' || appointment.doctor.toString() !== req.user.userId) {
       return res.status(403).json({ message: 'Access denied.' });
     }
killedBy: GET /api/prescriptions/appointment/:appointmentId should get prescription for appointment as doctor
statusReason: expected 403 to be 200 // Object.is equality

[Killed] StringLiteral
routes/prescriptions.js:210:46
     }
 
     if (req.user.userType === 'doctor' && appointment.doctor.toString() !== req.user.userId) {
-      return res.status(403).json({ message: 'Access denied.' });
+      return res.status(403).json({ message: "" });
     }
 
killedBy: GET /api/prescriptions/appointment/:appointmentId should return 403 if doctor tries to access another doctor's appointment
statusReason: expected '' to be 'Access denied.' // Object.is equality

[Killed] ObjectLiteral
routes/prescriptions.js:210:35
     }
 
     if (req.user.userType === 'doctor' && appointment.doctor.toString() !== req.user.userId) {
-      return res.status(403).json({ message: 'Access denied.' });
+      return res.status(403).json({});
     }
 
killedBy: GET /api/prescriptions/appointment/:appointmentId should return 403 if doctor tries to access another doctor's appointment
statusReason: expected undefined to be 'Access denied.' // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:213:44
       return res.status(403).json({ message: 'Access denied.' });
     }
 
-    if (req.user.userType === 'patient' && appointment.patient.toString() !== req.user.userId) {
+    if (req.user.userType === 'patient' && true) {
       return res.status(403).json({ message: 'Access denied.' });
     }
killedBy: GET /api/prescriptions/appointment/:appointmentId should get prescription for appointment as patient
statusReason: expected 403 to be 200 // Object.is equality

[Killed] EqualityOperator
routes/prescriptions.js:213:44
       return res.status(403).json({ message: 'Access denied.' });
     }
 
-    if (req.user.userType === 'patient' && appointment.patient.toString() !== req.user.userId) {
+    if (req.user.userType === 'patient' && appointment.patient.toString() === req.user.userId) {
       return res.status(403).json({ message: 'Access denied.' });
     }
killedBy: GET /api/prescriptions/appointment/:appointmentId should get prescription for appointment as patient
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ObjectLiteral
routes/prescriptions.js:214:35
     }
 
     if (req.user.userType === 'patient' && appointment.patient.toString() !== req.user.userId) {
-      return res.status(403).json({ message: 'Access denied.' });
+      return res.status(403).json({});
     }
 
killedBy: GET /api/prescriptions/appointment/:appointmentId should return 403 if patient tries to access another patient's appointment
statusReason: expected undefined to be 'Access denied.' // Object.is equality

[Killed] StringLiteral
routes/prescriptions.js:218:17
     }
 
     const medicalRecord = await MedicalRecord.findOne({ appointment: normalizedAppointmentId })
-      .populate('doctor', 'fullName specialization')
+      .populate("", 'fullName specialization')
       .populate('patient', 'fullName email')
       .populate('appointment', 'date'); // Populated appointment date
killedBy: GET /api/prescriptions/appointment/:appointmentId should get prescription for appointment as doctor
statusReason: expected 500 to be 200 // Object.is equality

[Survived] StringLiteral
routes/prescriptions.js:220:32
     const medicalRecord = await MedicalRecord.findOne({ appointment: normalizedAppointmentId })
       .populate('doctor', 'fullName specialization')
       .populate('patient', 'fullName email')
-      .populate('appointment', 'date'); // Populated appointment date
+      .populate('appointment', ""); // Populated appointment date
 
     if (!medicalRecord) {

[Killed] ConditionalExpression
routes/prescriptions.js:222:9
       .populate('patient', 'fullName email')
       .populate('appointment', 'date'); // Populated appointment date
 
-    if (!medicalRecord) {
+    if (false) {
       return res.status(404).json({ message: 'Prescription not found for this appointment.' });
     }
killedBy: GET /api/prescriptions/appointment/:appointmentId should return 404 if medical record not found
statusReason: expected 200 to be 404 // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:222:9
       .populate('patient', 'fullName email')
       .populate('appointment', 'date'); // Populated appointment date
 
-    if (!medicalRecord) {
+    if (true) {
       return res.status(404).json({ message: 'Prescription not found for this appointment.' });
     }
killedBy: GET /api/prescriptions/appointment/:appointmentId should get prescription for appointment as doctor
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
routes/prescriptions.js:231:17
       medicalRecord
     });
 
-  } catch (err) {
-    console.error('Error fetching prescription:', err);
-    res.status(500).json({ message: 'Server error while fetching prescription.' });
-  }
+  } catch (err) {}
 });
 
killedBy: GET /api/prescriptions/appointment/:appointmentId should return 500 on database error
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/prescriptions.js:233:37
 
   } catch (err) {
     console.error('Error fetching prescription:', err);
-    res.status(500).json({ message: 'Server error while fetching prescription.' });
+    res.status(500).json({ message: "" });
   }
 });
killedBy: GET /api/prescriptions/appointment/:appointmentId should return 500 on database error
statusReason: expected '' to be 'Server error while fetching prescript…' // Object.is equality

[Survived] StringLiteral
routes/prescriptions.js:244:32
     const medicalRecord = await MedicalRecord.findById(recordId)
       .populate('doctor', 'fullName specialization')
       .populate('patient', 'fullName email')
-      .populate('appointment', 'date time');
+      .populate('appointment', "");
 
     if (!medicalRecord) {

[Killed] BlockStatement
routes/prescriptions.js:246:25
       .populate('patient', 'fullName email')
       .populate('appointment', 'date time');
 
-    if (!medicalRecord) {
-      return res.status(404).json({ message: 'Medical record not found.' });
-    }
+    if (!medicalRecord) {}
 
     const isDoctor = req.user.userType === 'doctor' && medicalRecord.doctor._id.toString() === req.user.userId;
killedBy: GET /api/prescriptions/:recordId/pdf should return 404 if medical record not found
statusReason: expected 500 to be 404 // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:250:22
       return res.status(404).json({ message: 'Medical record not found.' });
     }
 
-    const isDoctor = req.user.userType === 'doctor' && medicalRecord.doctor._id.toString() === req.user.userId;
+    const isDoctor = false;
     const isPatient = req.user.userType === 'patient' && medicalRecord.patient._id.toString() === req.user.userId;
 
killedBy: GET /api/prescriptions/:recordId/pdf should generate PDF for doctor
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:250:22
       return res.status(404).json({ message: 'Medical record not found.' });
     }
 
-    const isDoctor = req.user.userType === 'doctor' && medicalRecord.doctor._id.toString() === req.user.userId;
+    const isDoctor = true;
     const isPatient = req.user.userType === 'patient' && medicalRecord.patient._id.toString() === req.user.userId;
 
killedBy: GET /api/prescriptions/:recordId/pdf should return 403 if user is neither the doctor nor the patient
statusReason: expected 200 to be 403 // Object.is equality

[Killed] EqualityOperator
routes/prescriptions.js:251:23
     }
 
     const isDoctor = req.user.userType === 'doctor' && medicalRecord.doctor._id.toString() === req.user.userId;
-    const isPatient = req.user.userType === 'patient' && medicalRecord.patient._id.toString() === req.user.userId;
+    const isPatient = req.user.userType !== 'patient' && medicalRecord.patient._id.toString() === req.user.userId;
 
     if (!isDoctor && !isPatient) {
killedBy: GET /api/prescriptions/:recordId/pdf should generate PDF for patient
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:251:23
     }
 
     const isDoctor = req.user.userType === 'doctor' && medicalRecord.doctor._id.toString() === req.user.userId;
-    const isPatient = req.user.userType === 'patient' && medicalRecord.patient._id.toString() === req.user.userId;
+    const isPatient = false;
 
     if (!isDoctor && !isPatient) {
killedBy: GET /api/prescriptions/:recordId/pdf should generate PDF for patient
statusReason: expected 403 to be 200 // Object.is equality

[Killed] LogicalOperator
routes/prescriptions.js:253:9
     const isDoctor = req.user.userType === 'doctor' && medicalRecord.doctor._id.toString() === req.user.userId;
     const isPatient = req.user.userType === 'patient' && medicalRecord.patient._id.toString() === req.user.userId;
 
-    if (!isDoctor && !isPatient) {
+    if (!isDoctor || !isPatient) {
       return res.status(403).json({ message: 'Access denied.' });
     }
killedBy: GET /api/prescriptions/:recordId/pdf should generate PDF for doctor
statusReason: expected 403 to be 200 // Object.is equality

[Killed] BooleanLiteral
routes/prescriptions.js:253:22
     const isDoctor = req.user.userType === 'doctor' && medicalRecord.doctor._id.toString() === req.user.userId;
     const isPatient = req.user.userType === 'patient' && medicalRecord.patient._id.toString() === req.user.userId;
 
-    if (!isDoctor && !isPatient) {
+    if (!isDoctor && isPatient) {
       return res.status(403).json({ message: 'Access denied.' });
     }
killedBy: GET /api/prescriptions/:recordId/pdf should generate PDF for patient
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ObjectLiteral
routes/prescriptions.js:254:35
     const isPatient = req.user.userType === 'patient' && medicalRecord.patient._id.toString() === req.user.userId;
 
     if (!isDoctor && !isPatient) {
-      return res.status(403).json({ message: 'Access denied.' });
+      return res.status(403).json({});
     }
 
killedBy: GET /api/prescriptions/:recordId/pdf should return 403 if user is neither the doctor nor the patient
statusReason: expected undefined to be 'Access denied.' // Object.is equality

[Killed] StringLiteral
routes/prescriptions.js:254:46
     const isPatient = req.user.userType === 'patient' && medicalRecord.patient._id.toString() === req.user.userId;
 
     if (!isDoctor && !isPatient) {
-      return res.status(403).json({ message: 'Access denied.' });
+      return res.status(403).json({ message: "" });
     }
 
killedBy: GET /api/prescriptions/:recordId/pdf should return 403 if user is neither the doctor nor the patient
statusReason: expected '' to be 'Access denied.' // Object.is equality

[Survived] StringLiteral
routes/prescriptions.js:259:22
 
     const doc = new PDFDocument({ margin: 50 });
 
-    const filename = `Prescription-${medicalRecord._id}.pdf`;
+    const filename = ``;
     res.setHeader('Content-Type', 'application/pdf');
     res.setHeader('Content-Disposition', `attachment; filename="${filename}"`);

[Killed] StringLiteral
routes/prescriptions.js:260:19
     const doc = new PDFDocument({ margin: 50 });
 
     const filename = `Prescription-${medicalRecord._id}.pdf`;
-    res.setHeader('Content-Type', 'application/pdf');
+    res.setHeader("", 'application/pdf');
     res.setHeader('Content-Disposition', `attachment; filename="${filename}"`);
 
killedBy: GET /api/prescriptions/:recordId/pdf should generate PDF for doctor
statusReason: expected 500 to be 200 // Object.is equality

[Killed] StringLiteral
routes/prescriptions.js:261:19
 
     const filename = `Prescription-${medicalRecord._id}.pdf`;
     res.setHeader('Content-Type', 'application/pdf');
-    res.setHeader('Content-Disposition', `attachment; filename="${filename}"`);
+    res.setHeader("", `attachment; filename="${filename}"`);
 
     doc.pipe(res);
killedBy: GET /api/prescriptions/:recordId/pdf should generate PDF for doctor
statusReason: expected 500 to be 200 // Object.is equality

[Survived] StringLiteral
routes/prescriptions.js:268:21
     
     doc.fillColor('#0F5257').fontSize(26).font('Helvetica-Bold').text('IntelliConsult', 50, 50);
     
-    doc.strokeColor('#0F5257').lineWidth(1).moveTo(50, 95).lineTo(550, 95).stroke();
+    doc.strokeColor("").lineWidth(1).moveTo(50, 95).lineTo(550, 95).stroke();
     
     

[Survived] ObjectLiteral
routes/prescriptions.js:272:92
     
     
     doc.moveDown(1); 
-    doc.fontSize(20).fillColor('#000').font('Helvetica-Bold').text('Consultation Summary', { align: 'left' });
+    doc.fontSize(20).fillColor('#000').font('Helvetica-Bold').text('Consultation Summary', {});
     doc.moveDown(2);
 

[Survived] StringLiteral
routes/prescriptions.js:272:68
     
     
     doc.moveDown(1); 
-    doc.fontSize(20).fillColor('#000').font('Helvetica-Bold').text('Consultation Summary', { align: 'left' });
+    doc.fontSize(20).fillColor('#000').font('Helvetica-Bold').text("", { align: 'left' });
     doc.moveDown(2);
 

[Survived] StringLiteral
routes/prescriptions.js:278:37
   
     const infoTop = doc.y;
     doc.fontSize(12).fillColor('#555');
-    doc.font('Helvetica-Bold').text('Patient:', 50, infoTop);
+    doc.font('Helvetica-Bold').text("", 50, infoTop);
     doc.font('Helvetica').text(medicalRecord.patient.fullName, 110, infoTop);
     

[Survived] StringLiteral
routes/prescriptions.js:281:14
     doc.font('Helvetica-Bold').text('Patient:', 50, infoTop);
     doc.font('Helvetica').text(medicalRecord.patient.fullName, 110, infoTop);
     
-    doc.font('Helvetica-Bold').text('Doctor:', 300, infoTop);
+    doc.font("").text('Doctor:', 300, infoTop);
     doc.font('Helvetica').text(medicalRecord.doctor.fullName, 360, infoTop);
 

[Survived] ArithmeticOperator
routes/prescriptions.js:284:51
     doc.font('Helvetica-Bold').text('Doctor:', 300, infoTop);
     doc.font('Helvetica').text(medicalRecord.doctor.fullName, 360, infoTop);
 
-    doc.font('Helvetica-Bold').text('Email:', 50, infoTop + 20);
+    doc.font('Helvetica-Bold').text('Email:', 50, infoTop - 20);
     doc.font('Helvetica').text(medicalRecord.patient.email, 110, infoTop + 20);
 

[Survived] ArithmeticOperator
routes/prescriptions.js:285:66
     doc.font('Helvetica').text(medicalRecord.doctor.fullName, 360, infoTop);
 
     doc.font('Helvetica-Bold').text('Email:', 50, infoTop + 20);
-    doc.font('Helvetica').text(medicalRecord.patient.email, 110, infoTop + 20);
+    doc.font('Helvetica').text(medicalRecord.patient.email, 110, infoTop - 20);
 
     doc.font('Helvetica-Bold').text('Specialization:', 300, infoTop + 20);

[Survived] ArithmeticOperator
routes/prescriptions.js:287:61
     doc.font('Helvetica-Bold').text('Email:', 50, infoTop + 20);
     doc.font('Helvetica').text(medicalRecord.patient.email, 110, infoTop + 20);
 
-    doc.font('Helvetica-Bold').text('Specialization:', 300, infoTop + 20);
+    doc.font('Helvetica-Bold').text('Specialization:', 300, infoTop - 20);
     doc.font('Helvetica').text(medicalRecord.doctor.specialization, 390, infoTop + 20);
 

[Survived] StringLiteral
routes/prescriptions.js:287:14
     doc.font('Helvetica-Bold').text('Email:', 50, infoTop + 20);
     doc.font('Helvetica').text(medicalRecord.patient.email, 110, infoTop + 20);
 
-    doc.font('Helvetica-Bold').text('Specialization:', 300, infoTop + 20);
+    doc.font("").text('Specialization:', 300, infoTop + 20);
     doc.font('Helvetica').text(medicalRecord.doctor.specialization, 390, infoTop + 20);
 

[Survived] ArithmeticOperator
routes/prescriptions.js:288:74
     doc.font('Helvetica').text(medicalRecord.patient.email, 110, infoTop + 20);
 
     doc.font('Helvetica-Bold').text('Specialization:', 300, infoTop + 20);
-    doc.font('Helvetica').text(medicalRecord.doctor.specialization, 390, infoTop + 20);
+    doc.font('Helvetica').text(medicalRecord.doctor.specialization, 390, infoTop - 20);
 
     doc.font('Helvetica-Bold').text('Consultation Date:', 50, infoTop + 40);

[Survived] ArithmeticOperator
routes/prescriptions.js:290:63
     doc.font('Helvetica-Bold').text('Specialization:', 300, infoTop + 20);
     doc.font('Helvetica').text(medicalRecord.doctor.specialization, 390, infoTop + 20);
 
-    doc.font('Helvetica-Bold').text('Consultation Date:', 50, infoTop + 40);
+    doc.font('Helvetica-Bold').text('Consultation Date:', 50, infoTop - 40);
     doc.font('Helvetica').text(new Date(medicalRecord.appointment.date).toLocaleDateString(), 160, infoTop + 40);
     

[Survived] StringLiteral
routes/prescriptions.js:290:37
     doc.font('Helvetica-Bold').text('Specialization:', 300, infoTop + 20);
     doc.font('Helvetica').text(medicalRecord.doctor.specialization, 390, infoTop + 20);
 
-    doc.font('Helvetica-Bold').text('Consultation Date:', 50, infoTop + 40);
+    doc.font('Helvetica-Bold').text("", 50, infoTop + 40);
     doc.font('Helvetica').text(new Date(medicalRecord.appointment.date).toLocaleDateString(), 160, infoTop + 40);
     

[Survived] ArithmeticOperator
routes/prescriptions.js:291:100
     doc.font('Helvetica').text(medicalRecord.doctor.specialization, 390, infoTop + 20);
 
     doc.font('Helvetica-Bold').text('Consultation Date:', 50, infoTop + 40);
-    doc.font('Helvetica').text(new Date(medicalRecord.appointment.date).toLocaleDateString(), 160, infoTop + 40);
+    doc.font('Helvetica').text(new Date(medicalRecord.appointment.date).toLocaleDateString(), 160, infoTop - 40);
     
     doc.moveDown(5);

[Survived] StringLiteral
routes/prescriptions.js:291:14
     doc.font('Helvetica').text(medicalRecord.doctor.specialization, 390, infoTop + 20);
 
     doc.font('Helvetica-Bold').text('Consultation Date:', 50, infoTop + 40);
-    doc.font('Helvetica').text(new Date(medicalRecord.appointment.date).toLocaleDateString(), 160, infoTop + 40);
+    doc.font("").text(new Date(medicalRecord.appointment.date).toLocaleDateString(), 160, infoTop + 40);
     
     doc.moveDown(5);

[Survived] BlockStatement
routes/prescriptions.js:296:45
     doc.moveDown(5);
 
    
-    const drawSection = (title, content) => {
-      if (!content) return;
-      doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text(title);
-      doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
-      doc.moveDown(1);
-      doc.fontSize(12).fillColor('#333').font('Helvetica').text(content, { width: 500, align: 'left' });
-      doc.moveDown(2);
-    };
+    const drawSection = (title, content) => {};
 
     drawSection('Diagnosis', medicalRecord.diagnosis);

[Survived] ConditionalExpression
routes/prescriptions.js:297:11
 
    
     const drawSection = (title, content) => {
-      if (!content) return;
+      if (true) return;
       doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text(title);
       doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();

[Survived] BooleanLiteral
routes/prescriptions.js:297:11
 
    
     const drawSection = (title, content) => {
-      if (!content) return;
+      if (content) return;
       doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text(title);
       doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();

[Survived] ArithmeticOperator
routes/prescriptions.js:299:58
     const drawSection = (title, content) => {
       if (!content) return;
       doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text(title);
-      doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
+      doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y - 5).lineTo(550, doc.y + 5).stroke();
       doc.moveDown(1);
       doc.fontSize(12).fillColor('#333').font('Helvetica').text(content, { width: 500, align: 'left' });

[Survived] ArithmeticOperator
routes/prescriptions.js:299:81
     const drawSection = (title, content) => {
       if (!content) return;
       doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text(title);
-      doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
+      doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y - 5).stroke();
       doc.moveDown(1);
       doc.fontSize(12).fillColor('#333').font('Helvetica').text(content, { width: 500, align: 'left' });

[Survived] ObjectLiteral
routes/prescriptions.js:301:74
       doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text(title);
       doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
       doc.moveDown(1);
-      doc.fontSize(12).fillColor('#333').font('Helvetica').text(content, { width: 500, align: 'left' });
+      doc.fontSize(12).fillColor('#333').font('Helvetica').text(content, {});
       doc.moveDown(2);
     };

[Survived] StringLiteral
routes/prescriptions.js:301:34
       doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text(title);
       doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
       doc.moveDown(1);
-      doc.fontSize(12).fillColor('#333').font('Helvetica').text(content, { width: 500, align: 'left' });
+      doc.fontSize(12).fillColor("").font('Helvetica').text(content, { width: 500, align: 'left' });
       doc.moveDown(2);
     };

[Survived] StringLiteral
routes/prescriptions.js:305:17
       doc.moveDown(2);
     };
 
-    drawSection('Diagnosis', medicalRecord.diagnosis);
+    drawSection("", medicalRecord.diagnosis);
 
  

[Survived] ArithmeticOperator
routes/prescriptions.js:309:79
 
  
     doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text('Prescription (Rx)');
-    doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
+    doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y - 5).stroke();
     doc.moveDown(1);
 

[Survived] ArithmeticOperator
routes/prescriptions.js:309:56
 
  
     doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text('Prescription (Rx)');
-    doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
+    doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y - 5).lineTo(550, doc.y + 5).stroke();
     doc.moveDown(1);
 

[Killed] ConditionalExpression
routes/prescriptions.js:312:9
     doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
     doc.moveDown(1);
 
-    if (medicalRecord.prescription && medicalRecord.prescription.length > 0) {
+    if (false) {
       medicalRecord.prescription.forEach(med => {
         doc.fontSize(13).fillColor('#000').font('Helvetica-Bold').text(med.medication || 'N/A');
killedBy: GET /api/prescriptions/:recordId/pdf should generate PDF for doctor and include medication text in PDF buffer
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
routes/prescriptions.js:312:39
     doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
     doc.moveDown(1);
 
-    if (medicalRecord.prescription && medicalRecord.prescription.length > 0) {
+    if (medicalRecord.prescription && medicalRecord.prescription.length <= 0) {
       medicalRecord.prescription.forEach(med => {
         doc.fontSize(13).fillColor('#000').font('Helvetica-Bold').text(med.medication || 'N/A');
killedBy: GET /api/prescriptions/:recordId/pdf should generate PDF for doctor and include medication text in PDF buffer
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
routes/prescriptions.js:313:49
     doc.moveDown(1);
 
     if (medicalRecord.prescription && medicalRecord.prescription.length > 0) {
-      medicalRecord.prescription.forEach(med => {
-        doc.fontSize(13).fillColor('#000').font('Helvetica-Bold').text(med.medication || 'N/A');
-        doc.moveDown(0.2);
-        doc.fontSize(12).fillColor('#333').font('Helvetica');
-        doc.text(`Dosage: ${med.dosage || 'N/A'}`, { indent: 15 });
-        doc.text(`Frequency: ${med.frequency || 'N/A'}`, { indent: 15 });
-        doc.text(`Instructions: ${med.instructions || 'N/A'}`, { indent: 15 });
-        doc.moveDown(1);
-      });
+      medicalRecord.prescription.forEach(med => {});
     } else {
       doc.fontSize(12).fillColor('#333').font('Helvetica').text('No medications prescribed.');
killedBy: GET /api/prescriptions/:recordId/pdf should generate PDF for doctor and include medication text in PDF buffer
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
routes/prescriptions.js:314:72
 
     if (medicalRecord.prescription && medicalRecord.prescription.length > 0) {
       medicalRecord.prescription.forEach(med => {
-        doc.fontSize(13).fillColor('#000').font('Helvetica-Bold').text(med.medication || 'N/A');
+        doc.fontSize(13).fillColor('#000').font('Helvetica-Bold').text(med.medication && 'N/A');
         doc.moveDown(0.2);
         doc.fontSize(12).fillColor('#333').font('Helvetica');
killedBy: GET /api/prescriptions/:recordId/pdf should generate PDF for doctor and include medication text in PDF buffer
statusReason: expected false to be true // Object.is equality
