[Killed] ConditionalExpression
routes/prescriptions.js:314:72
 
     if (medicalRecord.prescription && medicalRecord.prescription.length > 0) {
       medicalRecord.prescription.forEach(med => {
-        doc.fontSize(13).fillColor('#000').font('Helvetica-Bold').text(med.medication || 'N/A');
+        doc.fontSize(13).fillColor('#000').font('Helvetica-Bold').text(true);
         doc.moveDown(0.2);
         doc.fontSize(12).fillColor('#333').font('Helvetica');
killedBy: GET /api/prescriptions/:recordId/pdf should generate PDF for doctor and include medication text in PDF buffer
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
routes/prescriptions.js:317:29
         doc.fontSize(13).fillColor('#000').font('Helvetica-Bold').text(med.medication || 'N/A');
         doc.moveDown(0.2);
         doc.fontSize(12).fillColor('#333').font('Helvetica');
-        doc.text(`Dosage: ${med.dosage || 'N/A'}`, { indent: 15 });
+        doc.text(`Dosage: ${false}`, { indent: 15 });
         doc.text(`Frequency: ${med.frequency || 'N/A'}`, { indent: 15 });
         doc.text(`Instructions: ${med.instructions || 'N/A'}`, { indent: 15 });

[Survived] ConditionalExpression
routes/prescriptions.js:317:29
         doc.fontSize(13).fillColor('#000').font('Helvetica-Bold').text(med.medication || 'N/A');
         doc.moveDown(0.2);
         doc.fontSize(12).fillColor('#333').font('Helvetica');
-        doc.text(`Dosage: ${med.dosage || 'N/A'}`, { indent: 15 });
+        doc.text(`Dosage: ${true}`, { indent: 15 });
         doc.text(`Frequency: ${med.frequency || 'N/A'}`, { indent: 15 });
         doc.text(`Instructions: ${med.instructions || 'N/A'}`, { indent: 15 });

[Survived] ConditionalExpression
routes/prescriptions.js:318:32
         doc.moveDown(0.2);
         doc.fontSize(12).fillColor('#333').font('Helvetica');
         doc.text(`Dosage: ${med.dosage || 'N/A'}`, { indent: 15 });
-        doc.text(`Frequency: ${med.frequency || 'N/A'}`, { indent: 15 });
+        doc.text(`Frequency: ${false}`, { indent: 15 });
         doc.text(`Instructions: ${med.instructions || 'N/A'}`, { indent: 15 });
         doc.moveDown(1);

[Survived] LogicalOperator
routes/prescriptions.js:318:32
         doc.moveDown(0.2);
         doc.fontSize(12).fillColor('#333').font('Helvetica');
         doc.text(`Dosage: ${med.dosage || 'N/A'}`, { indent: 15 });
-        doc.text(`Frequency: ${med.frequency || 'N/A'}`, { indent: 15 });
+        doc.text(`Frequency: ${med.frequency && 'N/A'}`, { indent: 15 });
         doc.text(`Instructions: ${med.instructions || 'N/A'}`, { indent: 15 });
         doc.moveDown(1);

[Survived] ConditionalExpression
routes/prescriptions.js:319:35
         doc.fontSize(12).fillColor('#333').font('Helvetica');
         doc.text(`Dosage: ${med.dosage || 'N/A'}`, { indent: 15 });
         doc.text(`Frequency: ${med.frequency || 'N/A'}`, { indent: 15 });
-        doc.text(`Instructions: ${med.instructions || 'N/A'}`, { indent: 15 });
+        doc.text(`Instructions: ${false}`, { indent: 15 });
         doc.moveDown(1);
       });

[Survived] LogicalOperator
routes/prescriptions.js:319:35
         doc.fontSize(12).fillColor('#333').font('Helvetica');
         doc.text(`Dosage: ${med.dosage || 'N/A'}`, { indent: 15 });
         doc.text(`Frequency: ${med.frequency || 'N/A'}`, { indent: 15 });
-        doc.text(`Instructions: ${med.instructions || 'N/A'}`, { indent: 15 });
+        doc.text(`Instructions: ${med.instructions && 'N/A'}`, { indent: 15 });
         doc.moveDown(1);
       });

[Killed] BlockStatement
routes/prescriptions.js:322:12
         doc.text(`Instructions: ${med.instructions || 'N/A'}`, { indent: 15 });
         doc.moveDown(1);
       });
-    } else {
-      doc.fontSize(12).fillColor('#333').font('Helvetica').text('No medications prescribed.');
-      doc.moveDown(2);
-    }
+    } else {}
     
     doc.moveDown(1);
killedBy: GET /api/prescriptions/:recordId/pdf should generate PDF when prescription property is missing (No medications branch) and include fallback text
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
routes/prescriptions.js:328:17
     }
     
     doc.moveDown(1);
-    drawSection("Doctor's Notes", medicalRecord.notes);
+    drawSection("", medicalRecord.notes);
 
     

[Survived] BlockStatement
routes/prescriptions.js:331:41
     drawSection("Doctor's Notes", medicalRecord.notes);
 
     
-    if (medicalRecord.followUpRequired) {
-      doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text('Follow-up Required');
-      doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
-      doc.moveDown(1);
-      doc.fontSize(12).fillColor('#333').font('Helvetica');
-      doc.text(`Date: ${new Date(medicalRecord.followUpDate).toLocaleDateString()}`);
-      if (medicalRecord.followUpNotes) {
-        doc.text(`Notes: ${medicalRecord.followUpNotes}`);
-      }
-      doc.moveDown(2);
-    }
+    if (medicalRecord.followUpRequired) {}
 
     

[Survived] ConditionalExpression
routes/prescriptions.js:331:9
     drawSection("Doctor's Notes", medicalRecord.notes);
 
     
-    if (medicalRecord.followUpRequired) {
+    if (false) {
       doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text('Follow-up Required');
       doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();

[Survived] StringLiteral
routes/prescriptions.js:332:34
 
     
     if (medicalRecord.followUpRequired) {
-      doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text('Follow-up Required');
+      doc.fontSize(16).fillColor("").font('Helvetica-Bold').text('Follow-up Required');
       doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
       doc.moveDown(1);

[Survived] StringLiteral
routes/prescriptions.js:332:50
 
     
     if (medicalRecord.followUpRequired) {
-      doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text('Follow-up Required');
+      doc.fontSize(16).fillColor('#0F5257').font("").text('Follow-up Required');
       doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
       doc.moveDown(1);

[Survived] ArithmeticOperator
routes/prescriptions.js:333:81
     
     if (medicalRecord.followUpRequired) {
       doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text('Follow-up Required');
-      doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
+      doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y - 5).stroke();
       doc.moveDown(1);
       doc.fontSize(12).fillColor('#333').font('Helvetica');

[Survived] ArithmeticOperator
routes/prescriptions.js:333:58
     
     if (medicalRecord.followUpRequired) {
       doc.fontSize(16).fillColor('#0F5257').font('Helvetica-Bold').text('Follow-up Required');
-      doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y + 5).lineTo(550, doc.y + 5).stroke();
+      doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, doc.y - 5).lineTo(550, doc.y + 5).stroke();
       doc.moveDown(1);
       doc.fontSize(12).fillColor('#333').font('Helvetica');

[Survived] BlockStatement
routes/prescriptions.js:337:40
       doc.moveDown(1);
       doc.fontSize(12).fillColor('#333').font('Helvetica');
       doc.text(`Date: ${new Date(medicalRecord.followUpDate).toLocaleDateString()}`);
-      if (medicalRecord.followUpNotes) {
-        doc.text(`Notes: ${medicalRecord.followUpNotes}`);
-      }
+      if (medicalRecord.followUpNotes) {}
       doc.moveDown(2);
     }

[Survived] ConditionalExpression
routes/prescriptions.js:337:11
       doc.moveDown(1);
       doc.fontSize(12).fillColor('#333').font('Helvetica');
       doc.text(`Date: ${new Date(medicalRecord.followUpDate).toLocaleDateString()}`);
-      if (medicalRecord.followUpNotes) {
+      if (true) {
         doc.text(`Notes: ${medicalRecord.followUpNotes}`);
       }

[Survived] StringLiteral
routes/prescriptions.js:338:18
       doc.fontSize(12).fillColor('#333').font('Helvetica');
       doc.text(`Date: ${new Date(medicalRecord.followUpDate).toLocaleDateString()}`);
       if (medicalRecord.followUpNotes) {
-        doc.text(`Notes: ${medicalRecord.followUpNotes}`);
+        doc.text(``);
       }
       doc.moveDown(2);

[Survived] StringLiteral
routes/prescriptions.js:344:21
     }
 
     
-    doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, 710).lineTo(550, 710).stroke();
+    doc.strokeColor("").lineWidth(1).moveTo(50, 710).lineTo(550, 710).stroke();
     doc.moveDown(0.5);
     doc.fontSize(10).fillColor('grey');

[Survived] ObjectLiteral
routes/prescriptions.js:347:58
     doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, 710).lineTo(550, 710).stroke();
     doc.moveDown(0.5);
     doc.fontSize(10).fillColor('grey');
-    doc.text(`Record ID: ${medicalRecord._id}`, 50, 720, { align: 'left' });
+    doc.text(`Record ID: ${medicalRecord._id}`, 50, 720, {});
     doc.text('IntelliConsult | Confidential', 50, 735, { align: 'left' });
 

[Survived] StringLiteral
routes/prescriptions.js:347:67
     doc.strokeColor('#e5e7eb').lineWidth(1).moveTo(50, 710).lineTo(550, 710).stroke();
     doc.moveDown(0.5);
     doc.fontSize(10).fillColor('grey');
-    doc.text(`Record ID: ${medicalRecord._id}`, 50, 720, { align: 'left' });
+    doc.text(`Record ID: ${medicalRecord._id}`, 50, 720, { align: "" });
     doc.text('IntelliConsult | Confidential', 50, 735, { align: 'left' });
 

[Survived] StringLiteral
routes/prescriptions.js:348:65
     doc.moveDown(0.5);
     doc.fontSize(10).fillColor('grey');
     doc.text(`Record ID: ${medicalRecord._id}`, 50, 720, { align: 'left' });
-    doc.text('IntelliConsult | Confidential', 50, 735, { align: 'left' });
+    doc.text('IntelliConsult | Confidential', 50, 735, { align: "" });
 
     doc.end();

[Killed] BlockStatement
routes/prescriptions.js:352:17
 
     doc.end();
 
-  } catch (err) {
-    console.error('Error generating PDF:', err);
-    res.status(500).json({ message: 'Server error while generating PDF.' });
-  }
+  } catch (err) {}
 });
 
killedBy: GET /api/prescriptions/:recordId/pdf should return 500 on database error generating PDF
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/prescriptions.js:354:37
 
   } catch (err) {
     console.error('Error generating PDF:', err);
-    res.status(500).json({ message: 'Server error while generating PDF.' });
+    res.status(500).json({ message: "" });
   }
 });
killedBy: GET /api/prescriptions/:recordId/pdf should return 500 on database error generating PDF
statusReason: expected '' to be 'Server error while generating PDF.' // Object.is equality

[Killed] BlockStatement
routes/prescriptions.js:359:59
 });
 
 
-router.get('/doctor', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
-    return res.status(403).json({ message: 'Access denied. Not a doctor.' });
-  }
-
-  try {
-    const records = await MedicalRecord.find({ doctor: req.user.userId })
-      .populate('patient', 'fullName email')
-      .populate('appointment', 'date time primaryReason')
-      .sort({ createdAt: -1 });
-
-    res.json({
-      success: true,
-      count: records.length,
-      records
-    });
-  } catch (err) {
-    console.error('Error fetching doctor prescriptions:', err);
-    res.status(500).json({ message: 'Server error while fetching prescriptions.' });
-  }
-});
+router.get('/doctor', authMiddleware, async (req, res) => {});
 
 router.get('/patient', authMiddleware, async (req, res) => {
killedBy: GET /api/prescriptions/doctor & /patient should get all prescriptions for doctor
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
routes/prescriptions.js:360:7
 
 
 router.get('/doctor', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
+  if (req.user.userType === 'doctor') {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
killedBy: GET /api/prescriptions/doctor & /patient should get all prescriptions for doctor
statusReason: expected 403 to be 200 // Object.is equality

[Killed] BlockStatement
routes/prescriptions.js:364:7
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
 
-  try {
-    const records = await MedicalRecord.find({ doctor: req.user.userId })
-      .populate('patient', 'fullName email')
-      .populate('appointment', 'date time primaryReason')
-      .sort({ createdAt: -1 });
-
-    res.json({
-      success: true,
-      count: records.length,
-      records
-    });
-  } catch (err) {
+  try {} catch (err) {
     console.error('Error fetching doctor prescriptions:', err);
     res.status(500).json({ message: 'Server error while fetching prescriptions.' });
killedBy: GET /api/prescriptions/doctor & /patient should get all prescriptions for doctor
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] MethodExpression
routes/prescriptions.js:365:27
   }
 
   try {
-    const records = await MedicalRecord.find({ doctor: req.user.userId })
-      .populate('patient', 'fullName email')
-      .populate('appointment', 'date time primaryReason')
-      .sort({ createdAt: -1 });
+    const records = await MedicalRecord.find({
+  doctor: req.user.userId
+}).populate('patient', 'fullName email').populate('appointment', 'date time primaryReason');
 
     res.json({

[Survived] UnaryOperator
routes/prescriptions.js:368:26
     const records = await MedicalRecord.find({ doctor: req.user.userId })
       .populate('patient', 'fullName email')
       .populate('appointment', 'date time primaryReason')
-      .sort({ createdAt: -1 });
+      .sort({ createdAt: +1 });
 
     res.json({

[Survived] ObjectLiteral
routes/prescriptions.js:368:13
     const records = await MedicalRecord.find({ doctor: req.user.userId })
       .populate('patient', 'fullName email')
       .populate('appointment', 'date time primaryReason')
-      .sort({ createdAt: -1 });
+      .sort({});
 
     res.json({

[Killed] BlockStatement
routes/prescriptions.js:375:17
       count: records.length,
       records
     });
-  } catch (err) {
-    console.error('Error fetching doctor prescriptions:', err);
-    res.status(500).json({ message: 'Server error while fetching prescriptions.' });
-  }
+  } catch (err) {}
 });
 
killedBy: GET /api/prescriptions/doctor & /patient should return 500 on database error for doctor endpoint
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/prescriptions.js:381:60
   }
 });
 
-router.get('/patient', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'patient') {
-    return res.status(403).json({ message: 'Access denied. Not a patient.' });
-  }
-
-  try {
-    const records = await MedicalRecord.find({ patient: req.user.userId })
-      .populate('doctor', 'fullName specialization')
-      .populate('appointment', 'date time primaryReason')
-      .sort({ createdAt: -1 });
-
-    res.json({
-      success: true,
-      count: records.length,
-      records
-    });
-  } catch (err) {
-    console.error('Error fetching patient prescriptions:', err);
-    res.status(500).json({ message: 'Server error while fetching prescriptions.' });
-  }
-});
+router.get('/patient', authMiddleware, async (req, res) => {});
 
 router.put('/:recordId', authMiddleware, async (req, res) => {
killedBy: GET /api/prescriptions/doctor & /patient should get all prescriptions for patient
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
routes/prescriptions.js:382:7
 });
 
 router.get('/patient', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'patient') {
+  if (true) {
     return res.status(403).json({ message: 'Access denied. Not a patient.' });
   }
killedBy: GET /api/prescriptions/doctor & /patient should get all prescriptions for patient
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:382:7
 });
 
 router.get('/patient', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'patient') {
+  if (false) {
     return res.status(403).json({ message: 'Access denied. Not a patient.' });
   }
killedBy: GET /api/prescriptions/doctor & /patient should return 403 if user is not a patient for patient endpoint
statusReason: expected 200 to be 403 // Object.is equality

[Killed] StringLiteral
routes/prescriptions.js:383:44
 
 router.get('/patient', authMiddleware, async (req, res) => {
   if (req.user.userType !== 'patient') {
-    return res.status(403).json({ message: 'Access denied. Not a patient.' });
+    return res.status(403).json({ message: "" });
   }
 
killedBy: GET /api/prescriptions/doctor & /patient should return 403 if user is not a patient for patient endpoint
statusReason: expected '' to be 'Access denied. Not a patient.' // Object.is equality

[Killed] BlockStatement
routes/prescriptions.js:386:7
     return res.status(403).json({ message: 'Access denied. Not a patient.' });
   }
 
-  try {
-    const records = await MedicalRecord.find({ patient: req.user.userId })
-      .populate('doctor', 'fullName specialization')
-      .populate('appointment', 'date time primaryReason')
-      .sort({ createdAt: -1 });
-
-    res.json({
-      success: true,
-      count: records.length,
-      records
-    });
-  } catch (err) {
+  try {} catch (err) {
     console.error('Error fetching patient prescriptions:', err);
     res.status(500).json({ message: 'Server error while fetching prescriptions.' });
killedBy: GET /api/prescriptions/doctor & /patient should get all prescriptions for patient
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] MethodExpression
routes/prescriptions.js:387:27
   }
 
   try {
-    const records = await MedicalRecord.find({ patient: req.user.userId })
-      .populate('doctor', 'fullName specialization')
-      .populate('appointment', 'date time primaryReason')
-      .sort({ createdAt: -1 });
+    const records = await MedicalRecord.find({
+  patient: req.user.userId
+}).populate('doctor', 'fullName specialization').populate('appointment', 'date time primaryReason');
 
     res.json({

[Killed] StringLiteral
routes/prescriptions.js:389:17
   try {
     const records = await MedicalRecord.find({ patient: req.user.userId })
       .populate('doctor', 'fullName specialization')
-      .populate('appointment', 'date time primaryReason')
+      .populate("", 'date time primaryReason')
       .sort({ createdAt: -1 });
 
killedBy: GET /api/prescriptions/doctor & /patient should get all prescriptions for patient
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ObjectLiteral
routes/prescriptions.js:392:14
       .populate('appointment', 'date time primaryReason')
       .sort({ createdAt: -1 });
 
-    res.json({
-      success: true,
-      count: records.length,
-      records
-    });
+    res.json({});
   } catch (err) {
     console.error('Error fetching patient prescriptions:', err);
killedBy: GET /api/prescriptions/doctor & /patient should get all prescriptions for patient
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
routes/prescriptions.js:397:17
       count: records.length,
       records
     });
-  } catch (err) {
-    console.error('Error fetching patient prescriptions:', err);
-    res.status(500).json({ message: 'Server error while fetching prescriptions.' });
-  }
+  } catch (err) {}
 });
 
killedBy: GET /api/prescriptions/doctor & /patient should return 500 on database error for patient endpoint
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
routes/prescriptions.js:404:7
 });
 
 router.put('/:recordId', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
+  if (true) {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
killedBy: PUT /api/prescriptions/:recordId should update prescription successfully
statusReason: expected 403 to be 200 // Object.is equality

[Killed] EqualityOperator
routes/prescriptions.js:404:7
 });
 
 router.put('/:recordId', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
+  if (req.user.userType === 'doctor') {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
killedBy: PUT /api/prescriptions/:recordId should update prescription successfully
statusReason: expected 403 to be 200 // Object.is equality

[Killed] StringLiteral
routes/prescriptions.js:420:17
     } = req.body;
 
     const medicalRecord = await MedicalRecord.findById(recordId)
-      .populate('patient', 'fullName email')
+      .populate("", 'fullName email')
       .populate('doctor', 'fullName');
 
killedBy: PUT /api/prescriptions/:recordId should update prescription successfully
statusReason: expected 500 to be 200 // Object.is equality

[Survived] StringLiteral
routes/prescriptions.js:420:28
     } = req.body;
 
     const medicalRecord = await MedicalRecord.findById(recordId)
-      .populate('patient', 'fullName email')
+      .populate('patient', "")
       .populate('doctor', 'fullName');
 

[Killed] ConditionalExpression
routes/prescriptions.js:427:9
       return res.status(404).json({ message: 'Medical record not found.' });
     }
 
-    if (medicalRecord.doctor._id.toString() !== req.user.userId) {
+    if (false) {
       return res.status(403).json({ message: 'Access denied. This record does not belong to you.' });
     }
killedBy: PUT /api/prescriptions/:recordId should return 403 if doctor tries to update another doctor's prescription
statusReason: expected 200 to be 403 // Object.is equality

[Killed] EqualityOperator
routes/prescriptions.js:427:9
       return res.status(404).json({ message: 'Medical record not found.' });
     }
 
-    if (medicalRecord.doctor._id.toString() !== req.user.userId) {
+    if (medicalRecord.doctor._id.toString() === req.user.userId) {
       return res.status(403).json({ message: 'Access denied. This record does not belong to you.' });
     }
killedBy: PUT /api/prescriptions/:recordId should update prescription successfully
statusReason: expected 403 to be 200 // Object.is equality

[Killed] EqualityOperator
routes/prescriptions.js:431:9
       return res.status(403).json({ message: 'Access denied. This record does not belong to you.' });
     }
 
-    if (diagnosis !== undefined) medicalRecord.diagnosis = diagnosis.trim();
+    if (diagnosis === undefined) medicalRecord.diagnosis = diagnosis.trim();
     if (notes !== undefined) medicalRecord.notes = notes.trim();
     if (prescription !== undefined) medicalRecord.prescription = prescription;
killedBy: PUT /api/prescriptions/:recordId should update prescription successfully
statusReason: expected 'Hypertension' to be 'Hypertension with complications' // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:431:9
       return res.status(403).json({ message: 'Access denied. This record does not belong to you.' });
     }
 
-    if (diagnosis !== undefined) medicalRecord.diagnosis = diagnosis.trim();
+    if (true) medicalRecord.diagnosis = diagnosis.trim();
     if (notes !== undefined) medicalRecord.notes = notes.trim();
     if (prescription !== undefined) medicalRecord.prescription = prescription;
killedBy: PUT /api/prescriptions/:recordId should update only provided fields
statusReason: expected 500 to be 200 // Object.is equality

[Killed] EqualityOperator
routes/prescriptions.js:432:9
     }
 
     if (diagnosis !== undefined) medicalRecord.diagnosis = diagnosis.trim();
-    if (notes !== undefined) medicalRecord.notes = notes.trim();
+    if (notes === undefined) medicalRecord.notes = notes.trim();
     if (prescription !== undefined) medicalRecord.prescription = prescription;
     
killedBy: PUT /api/prescriptions/:recordId should update only provided fields
statusReason: expected 'Original notes' to be 'Updated notes only' // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:432:9
     }
 
     if (diagnosis !== undefined) medicalRecord.diagnosis = diagnosis.trim();
-    if (notes !== undefined) medicalRecord.notes = notes.trim();
+    if (true) medicalRecord.notes = notes.trim();
     if (prescription !== undefined) medicalRecord.prescription = prescription;
     
killedBy: PUT /api/prescriptions/:recordId should handle follow-up updates correctly
statusReason: expected 500 to be 200 // Object.is equality

[Killed] EqualityOperator
routes/prescriptions.js:433:9
 
     if (diagnosis !== undefined) medicalRecord.diagnosis = diagnosis.trim();
     if (notes !== undefined) medicalRecord.notes = notes.trim();
-    if (prescription !== undefined) medicalRecord.prescription = prescription;
+    if (prescription === undefined) medicalRecord.prescription = prescription;
     
     if (followUpRequired !== undefined) {
killedBy: PUT /api/prescriptions/:recordId should update prescription successfully
statusReason: expected [ { medication: 'Amlodipine', …(2) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
routes/prescriptions.js:433:9
 
     if (diagnosis !== undefined) medicalRecord.diagnosis = diagnosis.trim();
     if (notes !== undefined) medicalRecord.notes = notes.trim();
-    if (prescription !== undefined) medicalRecord.prescription = prescription;
+    if (false) medicalRecord.prescription = prescription;
     
     if (followUpRequired !== undefined) {
killedBy: PUT /api/prescriptions/:recordId should update prescription successfully
statusReason: expected [ { medication: 'Amlodipine', …(2) } ] to have a length of 2 but got 1

[Killed] BlockStatement
routes/prescriptions.js:435:41
     if (notes !== undefined) medicalRecord.notes = notes.trim();
     if (prescription !== undefined) medicalRecord.prescription = prescription;
     
-    if (followUpRequired !== undefined) {
-        medicalRecord.followUpRequired = followUpRequired;
-    }
+    if (followUpRequired !== undefined) {}
     
     if (followUpDate !== undefined) {
killedBy: PUT /api/prescriptions/:recordId should update prescription successfully
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
routes/prescriptions.js:435:9
     if (notes !== undefined) medicalRecord.notes = notes.trim();
     if (prescription !== undefined) medicalRecord.prescription = prescription;
     
-    if (followUpRequired !== undefined) {
+    if (followUpRequired === undefined) {
         medicalRecord.followUpRequired = followUpRequired;
     }
killedBy: PUT /api/prescriptions/:recordId should update prescription successfully
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
routes/prescriptions.js:439:9
         medicalRecord.followUpRequired = followUpRequired;
     }
     
-    if (followUpDate !== undefined) {
+    if (false) {
       medicalRecord.followUpDate = medicalRecord.followUpRequired && followUpDate ? new Date(followUpDate) : null;
     }

[Survived] ConditionalExpression
routes/prescriptions.js:439:9
         medicalRecord.followUpRequired = followUpRequired;
     }
     
-    if (followUpDate !== undefined) {
+    if (true) {
       medicalRecord.followUpDate = medicalRecord.followUpRequired && followUpDate ? new Date(followUpDate) : null;
     }

[Survived] LogicalOperator
routes/prescriptions.js:440:36
     }
     
     if (followUpDate !== undefined) {
-      medicalRecord.followUpDate = medicalRecord.followUpRequired && followUpDate ? new Date(followUpDate) : null;
+      medicalRecord.followUpDate = medicalRecord.followUpRequired || followUpDate ? new Date(followUpDate) : null;
     }
 

[Survived] ConditionalExpression
routes/prescriptions.js:440:36
     }
     
     if (followUpDate !== undefined) {
-      medicalRecord.followUpDate = medicalRecord.followUpRequired && followUpDate ? new Date(followUpDate) : null;
+      medicalRecord.followUpDate = true ? new Date(followUpDate) : null;
     }
 

[Killed] EqualityOperator
routes/prescriptions.js:443:9
       medicalRecord.followUpDate = medicalRecord.followUpRequired && followUpDate ? new Date(followUpDate) : null;
     }
 
-    if (followUpNotes !== undefined) {
+    if (followUpNotes === undefined) {
       medicalRecord.followUpNotes = medicalRecord.followUpRequired && followUpNotes ? followUpNotes.trim() : '';
     }
killedBy: PUT /api/prescriptions/:recordId should handle follow-up updates correctly
statusReason: expected undefined to be 'Recheck blood pressure' // Object.is equality
