[Killed] ConditionalExpression
routes/prescriptions.js:443:9
       medicalRecord.followUpDate = medicalRecord.followUpRequired && followUpDate ? new Date(followUpDate) : null;
     }
 
-    if (followUpNotes !== undefined) {
+    if (false) {
       medicalRecord.followUpNotes = medicalRecord.followUpRequired && followUpNotes ? followUpNotes.trim() : '';
     }
killedBy: PUT /api/prescriptions/:recordId should handle follow-up updates correctly
statusReason: expected undefined to be 'Recheck blood pressure' // Object.is equality

[Killed] ConditionalExpression
routes/prescriptions.js:444:37
     }
 
     if (followUpNotes !== undefined) {
-      medicalRecord.followUpNotes = medicalRecord.followUpRequired && followUpNotes ? followUpNotes.trim() : '';
+      medicalRecord.followUpNotes = false ? followUpNotes.trim() : '';
     }
 
killedBy: PUT /api/prescriptions/:recordId should handle follow-up updates correctly
statusReason: expected '' to be 'Recheck blood pressure' // Object.is equality

[Survived] ConditionalExpression
routes/prescriptions.js:444:37
     }
 
     if (followUpNotes !== undefined) {
-      medicalRecord.followUpNotes = medicalRecord.followUpRequired && followUpNotes ? followUpNotes.trim() : '';
+      medicalRecord.followUpNotes = true ? followUpNotes.trim() : '';
     }
 

[Survived] BlockStatement
routes/prescriptions.js:449:9
 
     await medicalRecord.save();
 
-    try {
-      await sendPrescriptionSummaryEmail(medicalRecord, medicalRecord.patient, medicalRecord.doctor);
-    } catch (emailError) {
+    try {} catch (emailError) {
       console.error('Error queuing prescription summary email:', emailError);
     }

[NoCoverage] BlockStatement
routes/prescriptions.js:451:26
 
     try {
       await sendPrescriptionSummaryEmail(medicalRecord, medicalRecord.patient, medicalRecord.doctor);
-    } catch (emailError) {
-      console.error('Error queuing prescription summary email:', emailError);
-    }
+    } catch (emailError) {}
 
     res.json({

[NoCoverage] StringLiteral
routes/prescriptions.js:452:21
     try {
       await sendPrescriptionSummaryEmail(medicalRecord, medicalRecord.patient, medicalRecord.doctor);
     } catch (emailError) {
-      console.error('Error queuing prescription summary email:', emailError);
+      console.error("", emailError);
     }
 

[Killed] StringLiteral
routes/prescriptions.js:457:16
 
     res.json({
       success: true,
-      message: 'Prescription updated successfully',
+      message: "",
       medicalRecord
     });
killedBy: PUT /api/prescriptions/:recordId should update prescription successfully
statusReason: expected '' to be 'Prescription updated successfully' // Object.is equality

[Killed] BlockStatement
routes/prescriptions.js:461:17
       medicalRecord
     });
 
-  } catch (err) {
-    console.error('Error updating prescription:', err);
-    res.status(500).json({ message: 'Server error while updating prescription.' });
-  }
+  } catch (err) {}
 });
 
killedBy: PUT /api/prescriptions/:recordId should return 500 on database error for PUT
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
