[Killed] BlockStatement
routes/reviews.js:8:45
 const Doctor = require('../models/Doctor');
 const Appointment = require('../models/Appointment');
 
-async function updateDoctorRating(doctorId) {
-  const reviews = await Review.find({ doctor: doctorId });
-
-  if (reviews.length === 0) {
-    await Doctor.findByIdAndUpdate(doctorId, {
-      averageRating: 0,
-      reviewCount: 0,
-    });
-    return;
-  }
-
-  const totalRating = reviews.reduce((acc, review) => acc + review.rating, 0);
-  const average = totalRating / reviews.length;
-
-  await Doctor.findByIdAndUpdate(doctorId, {
-    averageRating: average,
-    reviewCount: reviews.length,
-  });
-}
+async function updateDoctorRating(doctorId) {}
 
 router.post('/', authMiddleware, async (req, res) => {
killedBy: POST /api/reviews should create a review for a completed appointment successfully
statusReason: expected +0 to be 5 // Object.is equality

[Killed] EqualityOperator
routes/reviews.js:11:7
 async function updateDoctorRating(doctorId) {
   const reviews = await Review.find({ doctor: doctorId });
 
-  if (reviews.length === 0) {
+  if (reviews.length !== 0) {
     await Doctor.findByIdAndUpdate(doctorId, {
       averageRating: 0,
killedBy: POST /api/reviews should create a review for a completed appointment successfully
statusReason: expected +0 to be 5 // Object.is equality

[Killed] ConditionalExpression
routes/reviews.js:11:7
 async function updateDoctorRating(doctorId) {
   const reviews = await Review.find({ doctor: doctorId });
 
-  if (reviews.length === 0) {
+  if (true) {
     await Doctor.findByIdAndUpdate(doctorId, {
       averageRating: 0,
killedBy: POST /api/reviews should create a review for a completed appointment successfully
statusReason: expected +0 to be 5 // Object.is equality

[NoCoverage] ObjectLiteral
routes/reviews.js:12:46
   const reviews = await Review.find({ doctor: doctorId });
 
   if (reviews.length === 0) {
-    await Doctor.findByIdAndUpdate(doctorId, {
-      averageRating: 0,
-      reviewCount: 0,
-    });
+    await Doctor.findByIdAndUpdate(doctorId, {});
     return;
   }

[Killed] ArithmeticOperator
routes/reviews.js:19:55
     return;
   }
 
-  const totalRating = reviews.reduce((acc, review) => acc + review.rating, 0);
+  const totalRating = reviews.reduce((acc, review) => acc - review.rating, 0);
   const average = totalRating / reviews.length;
 
killedBy: POST /api/reviews should create a review for a completed appointment successfully
statusReason: expected -5 to be 5 // Object.is equality

[Killed] ArrowFunction
routes/reviews.js:19:38
     return;
   }
 
-  const totalRating = reviews.reduce((acc, review) => acc + review.rating, 0);
+  const totalRating = reviews.reduce(() => undefined, 0);
   const average = totalRating / reviews.length;
 
killedBy: POST /api/reviews should create a review for a completed appointment successfully
statusReason: expected 500 to be 201 // Object.is equality

[Killed] ArithmeticOperator
routes/reviews.js:20:19
   }
 
   const totalRating = reviews.reduce((acc, review) => acc + review.rating, 0);
-  const average = totalRating / reviews.length;
+  const average = totalRating * reviews.length;
 
   await Doctor.findByIdAndUpdate(doctorId, {
killedBy: POST /api/reviews should update doctor rating correctly with multiple reviews
statusReason: expected 16 to be 4 // Object.is equality

[Killed] ConditionalExpression
routes/reviews.js:29:7
 }
 
 router.post('/', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'patient') {
+  if (true) {
     return res.status(403).json({ message: 'Access denied. Not a patient.' });
   }
killedBy: POST /api/reviews should create a review for a completed appointment successfully
statusReason: expected 403 to be 201 // Object.is equality

[Killed] ConditionalExpression
routes/reviews.js:29:7
 }
 
 router.post('/', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'patient') {
+  if (false) {
     return res.status(403).json({ message: 'Access denied. Not a patient.' });
   }
killedBy: POST /api/reviews should return 403 if user is not a patient
statusReason: expected 500 to be 403 // Object.is equality

[Killed] ObjectLiteral
routes/reviews.js:30:33
 
 router.post('/', authMiddleware, async (req, res) => {
   if (req.user.userType !== 'patient') {
-    return res.status(403).json({ message: 'Access denied. Not a patient.' });
+    return res.status(403).json({});
   }
 
killedBy: POST /api/reviews should return 403 if user is not a patient
statusReason: expected undefined to be 'Access denied. Not a patient.' // Object.is equality

[Killed] ConditionalExpression
routes/reviews.js:37:9
 
   try {
     const appointment = await Appointment.findById(appointmentId);
-    if (appointment.status !== 'completed') {
+    if (false) {
       return res.status(400).json({ message: 'You can only review completed appointments.' });
     }
killedBy: POST /api/reviews should return 400 if appointment is not completed
statusReason: expected 201 to be 400 // Object.is equality

[Killed] BlockStatement
routes/reviews.js:37:45
 
   try {
     const appointment = await Appointment.findById(appointmentId);
-    if (appointment.status !== 'completed') {
-      return res.status(400).json({ message: 'You can only review completed appointments.' });
-    }
+    if (appointment.status !== 'completed') {}
     if (appointment.patient.toString() !== req.user.userId) {
       return res.status(403).json({ message: 'You are not authorized to review this appointment.' });
killedBy: POST /api/reviews should return 400 if appointment is not completed
statusReason: expected 201 to be 400 // Object.is equality

[Killed] BlockStatement
routes/reviews.js:40:61
     if (appointment.status !== 'completed') {
       return res.status(400).json({ message: 'You can only review completed appointments.' });
     }
-    if (appointment.patient.toString() !== req.user.userId) {
-      return res.status(403).json({ message: 'You are not authorized to review this appointment.' });
-    }
+    if (appointment.patient.toString() !== req.user.userId) {}
 
     const existingReview = await Review.findOne({ appointment: appointmentId });
killedBy: POST /api/reviews should return 403 if patient is not authorized to review the appointment
statusReason: expected 201 to be 403 // Object.is equality

[Killed] ObjectLiteral
routes/reviews.js:41:35
       return res.status(400).json({ message: 'You can only review completed appointments.' });
     }
     if (appointment.patient.toString() !== req.user.userId) {
-      return res.status(403).json({ message: 'You are not authorized to review this appointment.' });
+      return res.status(403).json({});
     }
 
killedBy: POST /api/reviews should return 403 if patient is not authorized to review the appointment
statusReason: expected undefined to be 'You are not authorized to review this…' // Object.is equality

[Killed] ConditionalExpression
routes/reviews.js:45:9
     }
 
     const existingReview = await Review.findOne({ appointment: appointmentId });
-    if (existingReview) {
+    if (true) {
       return res.status(400).json({ message: 'This appointment has already been reviewed.' });
     }
killedBy: POST /api/reviews should create a review for a completed appointment successfully
statusReason: expected 400 to be 201 // Object.is equality

[Killed] ConditionalExpression
routes/reviews.js:45:9
     }
 
     const existingReview = await Review.findOne({ appointment: appointmentId });
-    if (existingReview) {
+    if (false) {
       return res.status(400).json({ message: 'This appointment has already been reviewed.' });
     }
killedBy: POST /api/reviews should return 400 if appointment has already been reviewed
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
routes/reviews.js:62:17
     await updateDoctorRating(doctorId);
 
     res.status(201).json(newReview);
-  } catch (err) {
-    console.error('Review POST Error:', err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: POST /api/reviews should return 500 on server error
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/reviews.js:64:26
     res.status(201).json(newReview);
   } catch (err) {
     console.error('Review POST Error:', err.message);
-    res.status(500).send('Server Error');
+    res.status(500).send("");
   }
 });
killedBy: POST /api/reviews should return 500 on server error
statusReason: expected '' to be 'Server Error' // Object.is equality

[Killed] BlockStatement
routes/reviews.js:68:53
   }
 });
 
-router.get('/doctor/:doctorId', async (req, res) => {
-  try {
-    const reviews = await Review.find({ doctor: req.params.doctorId })
-      .populate('patient', 'fullName') 
-      .sort({ createdAt: -1 }); 
-
-    res.json(reviews);
-  } catch (err) {
-    console.error('Get Reviews Error:', err.message);
-    res.status(500).send('Server Error');
-  }
-});
+router.get('/doctor/:doctorId', async (req, res) => {});
 
 module.exports = router;
killedBy: GET /api/reviews/doctor/:doctorId should get all reviews for a doctor
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/reviews.js:68:12
   }
 });
 
-router.get('/doctor/:doctorId', async (req, res) => {
+router.get("", async (req, res) => {
   try {
     const reviews = await Review.find({ doctor: req.params.doctorId })
killedBy: GET /api/reviews/doctor/:doctorId should get all reviews for a doctor
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
routes/reviews.js:69:7
 });
 
 router.get('/doctor/:doctorId', async (req, res) => {
-  try {
-    const reviews = await Review.find({ doctor: req.params.doctorId })
-      .populate('patient', 'fullName') 
-      .sort({ createdAt: -1 }); 
-
-    res.json(reviews);
-  } catch (err) {
+  try {} catch (err) {
     console.error('Get Reviews Error:', err.message);
     res.status(500).send('Server Error');
killedBy: GET /api/reviews/doctor/:doctorId should get all reviews for a doctor
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
routes/reviews.js:70:27
 
 router.get('/doctor/:doctorId', async (req, res) => {
   try {
-    const reviews = await Review.find({ doctor: req.params.doctorId })
-      .populate('patient', 'fullName') 
-      .sort({ createdAt: -1 }); 
+    const reviews = await Review.find({
+  doctor: req.params.doctorId
+}).populate('patient', 'fullName'); 
 
     res.json(reviews);
killedBy: GET /api/reviews/doctor/:doctorId should return reviews sorted by createdAt in descending order
statusReason: expected 'First review' to be 'Second review' // Object.is equality

[Killed] UnaryOperator
routes/reviews.js:72:26
   try {
     const reviews = await Review.find({ doctor: req.params.doctorId })
       .populate('patient', 'fullName') 
-      .sort({ createdAt: -1 }); 
+      .sort({ createdAt: +1 }); 
 
     res.json(reviews);
killedBy: GET /api/reviews/doctor/:doctorId should return reviews sorted by createdAt in descending order
statusReason: expected 'First review' to be 'Second review' // Object.is equality

[Killed] BlockStatement
routes/reviews.js:75:17
       .sort({ createdAt: -1 }); 
 
     res.json(reviews);
-  } catch (err) {
-    console.error('Get Reviews Error:', err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: GET /api/reviews/doctor/:doctorId should return 500 on server error
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] StringLiteral
routes/reviews.js:76:19
 
     res.json(reviews);
   } catch (err) {
-    console.error('Get Reviews Error:', err.message);
+    console.error("", err.message);
     res.status(500).send('Server Error');
   }
