[Killed] LogicalOperator
routes/triageRoutes.js:124:22
 `;
 
 const formatTriageData = (appointment) => {
-const symptomsList = appointment.symptomsList || [];
+const symptomsList = appointment.symptomsList && [];
 const symptomsOther = appointment.symptomsOther || '';
 const allSymptoms = [...symptomsList];
killedBy: GET /api/triage/appointment/:appointmentId should verify exact string formatting of symptom lists (Kill Join Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain '- A\n- B'

[Killed] ConditionalExpression
routes/triageRoutes.js:124:22
 `;
 
 const formatTriageData = (appointment) => {
-const symptomsList = appointment.symptomsList || [];
+const symptomsList = true;
 const symptomsOther = appointment.symptomsOther || '';
 const allSymptoms = [...symptomsList];
killedBy: GET /api/triage/appointment/:appointmentId should log success message when triage is performed
statusReason: expected "log" to be called with arguments: [ 'ai is giving the triage' ]

Number of calls: 0

[Killed] LogicalOperator
routes/triageRoutes.js:125:23
 
 const formatTriageData = (appointment) => {
 const symptomsList = appointment.symptomsList || [];
-const symptomsOther = appointment.symptomsOther || '';
+const symptomsOther = appointment.symptomsOther && '';
 const allSymptoms = [...symptomsList];
 if (symptomsOther) {
killedBy: GET /api/triage/appointment/:appointmentId should include "Other" fields in lists (Kill Conditional Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Dizziness'

[Killed] ConditionalExpression
routes/triageRoutes.js:125:23
 
 const formatTriageData = (appointment) => {
 const symptomsList = appointment.symptomsList || [];
-const symptomsOther = appointment.symptomsOther || '';
+const symptomsOther = false;
 const allSymptoms = [...symptomsList];
 if (symptomsOther) {
killedBy: GET /api/triage/appointment/:appointmentId should include "Other" fields in lists (Kill Conditional Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Dizziness'

[Killed] ArrayDeclaration
routes/triageRoutes.js:126:21
 const formatTriageData = (appointment) => {
 const symptomsList = appointment.symptomsList || [];
 const symptomsOther = appointment.symptomsOther || '';
-const allSymptoms = [...symptomsList];
+const allSymptoms = [];
 if (symptomsOther) {
 allSymptoms.push(symptomsOther);
killedBy: GET /api/triage/appointment/:appointmentId should verify exact string formatting of symptom lists (Kill Join Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain '- A\n- B'

[Killed] BlockStatement
routes/triageRoutes.js:127:20
 const symptomsList = appointment.symptomsList || [];
 const symptomsOther = appointment.symptomsOther || '';
 const allSymptoms = [...symptomsList];
-if (symptomsOther) {
-allSymptoms.push(symptomsOther);
-}
+if (symptomsOther) {}
 
 const severeSymptoms = appointment.severeSymptomsCheck || [];
killedBy: GET /api/triage/appointment/:appointmentId should include "Other" fields in lists (Kill Conditional Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Dizziness'

[Killed] ConditionalExpression
routes/triageRoutes.js:127:5
 const symptomsList = appointment.symptomsList || [];
 const symptomsOther = appointment.symptomsOther || '';
 const allSymptoms = [...symptomsList];
-if (symptomsOther) {
+if (false) {
 allSymptoms.push(symptomsOther);
 }
killedBy: GET /api/triage/appointment/:appointmentId should include "Other" fields in lists (Kill Conditional Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Dizziness'

[Killed] LogicalOperator
routes/triageRoutes.js:131:24
 allSymptoms.push(symptomsOther);
 }
 
-const severeSymptoms = appointment.severeSymptomsCheck || [];
+const severeSymptoms = appointment.severeSymptomsCheck && [];
 
 const conditions = appointment.preExistingConditions || [];
killedBy: GET /api/triage/appointment/:appointmentId should perform AI triage for RED (P1) - life-threatening emergency
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'CRITICAL: Severe chest pain reported'

[Killed] ConditionalExpression
routes/triageRoutes.js:131:24
 allSymptoms.push(symptomsOther);
 }
 
-const severeSymptoms = appointment.severeSymptomsCheck || [];
+const severeSymptoms = false;
 
 const conditions = appointment.preExistingConditions || [];
killedBy: GET /api/triage/appointment/:appointmentId should log success message when triage is performed
statusReason: expected "log" to be called with arguments: [ 'ai is giving the triage' ]

Number of calls: 0

[Killed] ConditionalExpression
routes/triageRoutes.js:133:20
 
 const severeSymptoms = appointment.severeSymptomsCheck || [];
 
-const conditions = appointment.preExistingConditions || [];
+const conditions = false;
 const conditionsOther = appointment.preExistingConditionsOther || '';
 const allConditions = [...conditions];
killedBy: GET /api/triage/appointment/:appointmentId should log success message when triage is performed
statusReason: expected "log" to be called with arguments: [ 'ai is giving the triage' ]

Number of calls: 0

[Killed] LogicalOperator
routes/triageRoutes.js:133:20
 
 const severeSymptoms = appointment.severeSymptomsCheck || [];
 
-const conditions = appointment.preExistingConditions || [];
+const conditions = appointment.preExistingConditions && [];
 const conditionsOther = appointment.preExistingConditionsOther || '';
 const allConditions = [...conditions];
killedBy: GET /api/triage/appointment/:appointmentId should format all fields correctly in the prompt
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain '- Asthma\n- Migraine'

[Killed] ConditionalExpression
routes/triageRoutes.js:136:5
 const conditions = appointment.preExistingConditions || [];
 const conditionsOther = appointment.preExistingConditionsOther || '';
 const allConditions = [...conditions];
-if (conditionsOther) {
+if (false) {
 allConditions.push(conditionsOther);
 }
killedBy: GET /api/triage/appointment/:appointmentId should include "Other" fields in lists (Kill Conditional Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Rare Disease'

[Killed] BlockStatement
routes/triageRoutes.js:136:22
 const conditions = appointment.preExistingConditions || [];
 const conditionsOther = appointment.preExistingConditionsOther || '';
 const allConditions = [...conditions];
-if (conditionsOther) {
-allConditions.push(conditionsOther);
-}
+if (conditionsOther) {}
 
 const familyHistory = appointment.familyHistory || [];
killedBy: GET /api/triage/appointment/:appointmentId should include "Other" fields in lists (Kill Conditional Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Rare Disease'

[Killed] LogicalOperator
routes/triageRoutes.js:140:23
 allConditions.push(conditionsOther);
 }
 
-const familyHistory = appointment.familyHistory || [];
+const familyHistory = appointment.familyHistory && [];
 const familyHistoryOther = appointment.familyHistoryOther || '';
 const allFamilyHistory = [...familyHistory];
killedBy: GET /api/triage/appointment/:appointmentId should format all fields correctly in the prompt
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain '- Heart disease\n- Diabetes'

[Killed] ConditionalExpression
routes/triageRoutes.js:140:23
 allConditions.push(conditionsOther);
 }
 
-const familyHistory = appointment.familyHistory || [];
+const familyHistory = false;
 const familyHistoryOther = appointment.familyHistoryOther || '';
 const allFamilyHistory = [...familyHistory];
killedBy: GET /api/triage/appointment/:appointmentId should log success message when triage is performed
statusReason: expected "log" to be called with arguments: [ 'ai is giving the triage' ]

Number of calls: 0

[Killed] ConditionalExpression
routes/triageRoutes.js:141:28
 }
 
 const familyHistory = appointment.familyHistory || [];
-const familyHistoryOther = appointment.familyHistoryOther || '';
+const familyHistoryOther = true;
 const allFamilyHistory = [...familyHistory];
 if (familyHistoryOther) {
killedBy: GET /api/triage/appointment/:appointmentId should include "Other" fields in lists (Kill Conditional Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Genetic Issue'

[Killed] ConditionalExpression
routes/triageRoutes.js:143:5
 const familyHistory = appointment.familyHistory || [];
 const familyHistoryOther = appointment.familyHistoryOther || '';
 const allFamilyHistory = [...familyHistory];
-if (familyHistoryOther) {
+if (false) {
 allFamilyHistory.push(familyHistoryOther);
 }
killedBy: GET /api/triage/appointment/:appointmentId should include "Other" fields in lists (Kill Conditional Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Genetic Issue'

[Killed] ConditionalExpression
routes/triageRoutes.js:143:5
 const familyHistory = appointment.familyHistory || [];
 const familyHistoryOther = appointment.familyHistoryOther || '';
 const allFamilyHistory = [...familyHistory];
-if (familyHistoryOther) {
+if (true) {
 allFamilyHistory.push(familyHistoryOther);
 }
killedBy: GET /api/triage/appointment/:appointmentId should handle empty "Other" fields without extra newlines
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' not to contain '- \n'

[Killed] LogicalOperator
routes/triageRoutes.js:151:3
 PATIENT TRIAGE ASSESSMENT:
 
 CHIEF COMPLAINT:
-${appointment.primaryReason || appointment.reasonForVisit || 'Not specified'}
+${(appointment.primaryReason || appointment.reasonForVisit) && 'Not specified'}
 
 CURRENT SYMPTOMS:
killedBy: GET /api/triage/appointment/:appointmentId should format all fields correctly in the prompt
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Persistent cough'

[Killed] LogicalOperator
routes/triageRoutes.js:151:3
 PATIENT TRIAGE ASSESSMENT:
 
 CHIEF COMPLAINT:
-${appointment.primaryReason || appointment.reasonForVisit || 'Not specified'}
+${appointment.primaryReason && appointment.reasonForVisit || 'Not specified'}
 
 CURRENT SYMPTOMS:
killedBy: GET /api/triage/appointment/:appointmentId should format all fields correctly in the prompt
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Persistent cough'

[Killed] ConditionalExpression
routes/triageRoutes.js:154:3
 ${appointment.primaryReason || appointment.reasonForVisit || 'Not specified'}
 
 CURRENT SYMPTOMS:
-${allSymptoms.length > 0 ? allSymptoms.map(s => `- ${s}`).join('\n') : '- None reported'}
+${true ? allSymptoms.map(s => `- ${s}`).join('\n') : '- None reported'}
 
 SYMPTOM ONSET:
killedBy: GET /api/triage/appointment/:appointmentId should print "None reported" when no symptoms provided
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'CURRENT SYMPTOMS:\n- None reported'

[Killed] ConditionalExpression
routes/triageRoutes.js:157:3
 ${allSymptoms.length > 0 ? allSymptoms.map(s => `- ${s}`).join('\n') : '- None reported'}
 
 SYMPTOM ONSET:
-${appointment.symptomsBegin || 'Unknown'}
+${true}
 
 SEVERE SYMPTOMS - RED FLAGS:
killedBy: GET /api/triage/appointment/:appointmentId should include "SYMPTOM ONSET: Unknown" when symptomsBegin missing
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'SYMPTOM ONSET:\nUnknown'

[Killed] ConditionalExpression
routes/triageRoutes.js:157:3
 ${allSymptoms.length > 0 ? allSymptoms.map(s => `- ${s}`).join('\n') : '- None reported'}
 
 SYMPTOM ONSET:
-${appointment.symptomsBegin || 'Unknown'}
+${false}
 
 SEVERE SYMPTOMS - RED FLAGS:
killedBy: GET /api/triage/appointment/:appointmentId should include "SYMPTOM ONSET: Unknown" when symptomsBegin missing
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'SYMPTOM ONSET:\nUnknown'

[Killed] ConditionalExpression
routes/triageRoutes.js:160:3
 ${appointment.symptomsBegin || 'Unknown'}
 
 SEVERE SYMPTOMS - RED FLAGS:
-${severeSymptoms.length > 0 ? '- ' + severeSymptoms.join('\n- ') : 'None reported'}
+${false ? '- ' + severeSymptoms.join('\n- ') : 'None reported'}
 ${severeSymptoms.includes('Severe chest pain or pressure') ? 'CRITICAL: Severe chest pain reported' : ''}
 ${severeSymptoms.includes('Sudden difficulty breathing or shortness of breath') ? 'CRITICAL: Respiratory distress reported' : ''}
killedBy: GET /api/triage/appointment/:appointmentId should verify exact string formatting of symptom lists (Kill Join Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' not to contain 'None reported'

[Killed] EqualityOperator
routes/triageRoutes.js:160:3
 ${appointment.symptomsBegin || 'Unknown'}
 
 SEVERE SYMPTOMS - RED FLAGS:
-${severeSymptoms.length > 0 ? '- ' + severeSymptoms.join('\n- ') : 'None reported'}
+${severeSymptoms.length >= 0 ? '- ' + severeSymptoms.join('\n- ') : 'None reported'}
 ${severeSymptoms.includes('Severe chest pain or pressure') ? 'CRITICAL: Severe chest pain reported' : ''}
 ${severeSymptoms.includes('Sudden difficulty breathing or shortness of breath') ? 'CRITICAL: Respiratory distress reported' : ''}
killedBy: GET /api/triage/appointment/:appointmentId should handle empty "Other" fields without extra newlines
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' not to contain '- \n'

[Killed] StringLiteral
routes/triageRoutes.js:161:103
 
 SEVERE SYMPTOMS - RED FLAGS:
 ${severeSymptoms.length > 0 ? '- ' + severeSymptoms.join('\n- ') : 'None reported'}
-${severeSymptoms.includes('Severe chest pain or pressure') ? 'CRITICAL: Severe chest pain reported' : ''}
+${severeSymptoms.includes('Severe chest pain or pressure') ? 'CRITICAL: Severe chest pain reported' : "Stryker was here!"}
 ${severeSymptoms.includes('Sudden difficulty breathing or shortness of breath') ? 'CRITICAL: Respiratory distress reported' : ''}
 ${severeSymptoms.includes('Sudden confusion, disorientation, or difficulty speaking') ? 'CRITICAL: Neurological symptoms reported' : ''}
killedBy: GET /api/triage/appointment/:appointmentId should handle appointment with absolutely NO optional fields (Kill Fallback Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' not to contain 'Stryker'

[Killed] StringLiteral
routes/triageRoutes.js:161:62
 
 SEVERE SYMPTOMS - RED FLAGS:
 ${severeSymptoms.length > 0 ? '- ' + severeSymptoms.join('\n- ') : 'None reported'}
-${severeSymptoms.includes('Severe chest pain or pressure') ? 'CRITICAL: Severe chest pain reported' : ''}
+${severeSymptoms.includes('Severe chest pain or pressure') ? "" : ''}
 ${severeSymptoms.includes('Sudden difficulty breathing or shortness of breath') ? 'CRITICAL: Respiratory distress reported' : ''}
 ${severeSymptoms.includes('Sudden confusion, disorientation, or difficulty speaking') ? 'CRITICAL: Neurological symptoms reported' : ''}
killedBy: GET /api/triage/appointment/:appointmentId should perform AI triage for RED (P1) - life-threatening emergency
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'CRITICAL: Severe chest pain reported'

[Killed] StringLiteral
routes/triageRoutes.js:162:83
 SEVERE SYMPTOMS - RED FLAGS:
 ${severeSymptoms.length > 0 ? '- ' + severeSymptoms.join('\n- ') : 'None reported'}
 ${severeSymptoms.includes('Severe chest pain or pressure') ? 'CRITICAL: Severe chest pain reported' : ''}
-${severeSymptoms.includes('Sudden difficulty breathing or shortness of breath') ? 'CRITICAL: Respiratory distress reported' : ''}
+${severeSymptoms.includes('Sudden difficulty breathing or shortness of breath') ? "" : ''}
 ${severeSymptoms.includes('Sudden confusion, disorientation, or difficulty speaking') ? 'CRITICAL: Neurological symptoms reported' : ''}
 ${severeSymptoms.includes('Sudden weakness, numbness, or drooping on one side of your face or body') ? 'CRITICAL: Stroke symptoms reported' : ''}
killedBy: GET /api/triage/appointment/:appointmentId should perform AI triage for RED (P1) - life-threatening emergency
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'CRITICAL: Respiratory distress report…'

[Killed] StringLiteral
routes/triageRoutes.js:162:27
 SEVERE SYMPTOMS - RED FLAGS:
 ${severeSymptoms.length > 0 ? '- ' + severeSymptoms.join('\n- ') : 'None reported'}
 ${severeSymptoms.includes('Severe chest pain or pressure') ? 'CRITICAL: Severe chest pain reported' : ''}
-${severeSymptoms.includes('Sudden difficulty breathing or shortness of breath') ? 'CRITICAL: Respiratory distress reported' : ''}
+${severeSymptoms.includes("") ? 'CRITICAL: Respiratory distress reported' : ''}
 ${severeSymptoms.includes('Sudden confusion, disorientation, or difficulty speaking') ? 'CRITICAL: Neurological symptoms reported' : ''}
 ${severeSymptoms.includes('Sudden weakness, numbness, or drooping on one side of your face or body') ? 'CRITICAL: Stroke symptoms reported' : ''}
killedBy: GET /api/triage/appointment/:appointmentId should perform AI triage for RED (P1) - life-threatening emergency
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'CRITICAL: Respiratory distress report…'

[Survived] StringLiteral
routes/triageRoutes.js:164:27
 ${severeSymptoms.includes('Severe chest pain or pressure') ? 'CRITICAL: Severe chest pain reported' : ''}
 ${severeSymptoms.includes('Sudden difficulty breathing or shortness of breath') ? 'CRITICAL: Respiratory distress reported' : ''}
 ${severeSymptoms.includes('Sudden confusion, disorientation, or difficulty speaking') ? 'CRITICAL: Neurological symptoms reported' : ''}
-${severeSymptoms.includes('Sudden weakness, numbness, or drooping on one side of your face or body') ? 'CRITICAL: Stroke symptoms reported' : ''}
+${severeSymptoms.includes("") ? 'CRITICAL: Stroke symptoms reported' : ''}
 ${severeSymptoms.includes('Sudden, severe headache (worst of your life)') ? 'CRITICAL: Severe headache reported' : ''}
 ${severeSymptoms.includes('High fever (over 103°F / 39.4°C)') ? 'WARNING: High fever reported' : ''}

[Survived] StringLiteral
routes/triageRoutes.js:165:77
 ${severeSymptoms.includes('Sudden difficulty breathing or shortness of breath') ? 'CRITICAL: Respiratory distress reported' : ''}
 ${severeSymptoms.includes('Sudden confusion, disorientation, or difficulty speaking') ? 'CRITICAL: Neurological symptoms reported' : ''}
 ${severeSymptoms.includes('Sudden weakness, numbness, or drooping on one side of your face or body') ? 'CRITICAL: Stroke symptoms reported' : ''}
-${severeSymptoms.includes('Sudden, severe headache (worst of your life)') ? 'CRITICAL: Severe headache reported' : ''}
+${severeSymptoms.includes('Sudden, severe headache (worst of your life)') ? "" : ''}
 ${severeSymptoms.includes('High fever (over 103°F / 39.4°C)') ? 'WARNING: High fever reported' : ''}
 ${severeSymptoms.includes('Uncontrolled bleeding') ? 'CRITICAL: Uncontrolled bleeding reported' : ''}

[Killed] StringLiteral
routes/triageRoutes.js:166:27
 ${severeSymptoms.includes('Sudden confusion, disorientation, or difficulty speaking') ? 'CRITICAL: Neurological symptoms reported' : ''}
 ${severeSymptoms.includes('Sudden weakness, numbness, or drooping on one side of your face or body') ? 'CRITICAL: Stroke symptoms reported' : ''}
 ${severeSymptoms.includes('Sudden, severe headache (worst of your life)') ? 'CRITICAL: Severe headache reported' : ''}
-${severeSymptoms.includes('High fever (over 103°F / 39.4°C)') ? 'WARNING: High fever reported' : ''}
+${severeSymptoms.includes("") ? 'WARNING: High fever reported' : ''}
 ${severeSymptoms.includes('Uncontrolled bleeding') ? 'CRITICAL: Uncontrolled bleeding reported' : ''}
 
killedBy: GET /api/triage/appointment/:appointmentId should perform AI triage for YELLOW (P2) - urgent case
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'WARNING: High fever reported'

[Killed] StringLiteral
routes/triageRoutes.js:166:98
 ${severeSymptoms.includes('Sudden confusion, disorientation, or difficulty speaking') ? 'CRITICAL: Neurological symptoms reported' : ''}
 ${severeSymptoms.includes('Sudden weakness, numbness, or drooping on one side of your face or body') ? 'CRITICAL: Stroke symptoms reported' : ''}
 ${severeSymptoms.includes('Sudden, severe headache (worst of your life)') ? 'CRITICAL: Severe headache reported' : ''}
-${severeSymptoms.includes('High fever (over 103°F / 39.4°C)') ? 'WARNING: High fever reported' : ''}
+${severeSymptoms.includes('High fever (over 103°F / 39.4°C)') ? 'WARNING: High fever reported' : "Stryker was here!"}
 ${severeSymptoms.includes('Uncontrolled bleeding') ? 'CRITICAL: Uncontrolled bleeding reported' : ''}
 
killedBy: GET /api/triage/appointment/:appointmentId should handle appointment with absolutely NO optional fields (Kill Fallback Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' not to contain 'Stryker'

[Killed] StringLiteral
routes/triageRoutes.js:167:99
 ${severeSymptoms.includes('Sudden weakness, numbness, or drooping on one side of your face or body') ? 'CRITICAL: Stroke symptoms reported' : ''}
 ${severeSymptoms.includes('Sudden, severe headache (worst of your life)') ? 'CRITICAL: Severe headache reported' : ''}
 ${severeSymptoms.includes('High fever (over 103°F / 39.4°C)') ? 'WARNING: High fever reported' : ''}
-${severeSymptoms.includes('Uncontrolled bleeding') ? 'CRITICAL: Uncontrolled bleeding reported' : ''}
+${severeSymptoms.includes('Uncontrolled bleeding') ? 'CRITICAL: Uncontrolled bleeding reported' : "Stryker was here!"}
 
 MEDICAL HISTORY:
killedBy: GET /api/triage/appointment/:appointmentId should handle appointment with absolutely NO optional fields (Kill Fallback Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' not to contain 'Stryker'

[Survived] StringLiteral
routes/triageRoutes.js:167:27
 ${severeSymptoms.includes('Sudden weakness, numbness, or drooping on one side of your face or body') ? 'CRITICAL: Stroke symptoms reported' : ''}
 ${severeSymptoms.includes('Sudden, severe headache (worst of your life)') ? 'CRITICAL: Severe headache reported' : ''}
 ${severeSymptoms.includes('High fever (over 103°F / 39.4°C)') ? 'WARNING: High fever reported' : ''}
-${severeSymptoms.includes('Uncontrolled bleeding') ? 'CRITICAL: Uncontrolled bleeding reported' : ''}
+${severeSymptoms.includes("") ? 'CRITICAL: Uncontrolled bleeding reported' : ''}
 
 MEDICAL HISTORY:

[Killed] EqualityOperator
routes/triageRoutes.js:172:3
 MEDICAL HISTORY:
 
 Pre-existing Conditions:
-${allConditions.length > 0 ? '- ' + allConditions.join('\n- ') : 'None'}
+${allConditions.length <= 0 ? '- ' + allConditions.join('\n- ') : 'None'}
 
 Past Surgeries/Hospitalizations:
killedBy: GET /api/triage/appointment/:appointmentId should include "Other" fields in lists (Kill Conditional Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Rare Disease'

[Killed] ConditionalExpression
routes/triageRoutes.js:172:3
 MEDICAL HISTORY:
 
 Pre-existing Conditions:
-${allConditions.length > 0 ? '- ' + allConditions.join('\n- ') : 'None'}
+${false ? '- ' + allConditions.join('\n- ') : 'None'}
 
 Past Surgeries/Hospitalizations:
killedBy: GET /api/triage/appointment/:appointmentId should include "Other" fields in lists (Kill Conditional Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Rare Disease'

[Killed] ConditionalExpression
routes/triageRoutes.js:178:3
 ${appointment.pastSurgeries || 'None'}
 
 Family Medical History:
-${allFamilyHistory.length > 0 ? '- ' + allFamilyHistory.join('\n- ') : 'None'}
+${true ? '- ' + allFamilyHistory.join('\n- ') : 'None'}
 
 Current Medications:
killedBy: GET /api/triage/appointment/:appointmentId should handle empty "Other" fields without extra newlines
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' not to contain '- \n'

[Killed] EqualityOperator
routes/triageRoutes.js:178:3
 ${appointment.pastSurgeries || 'None'}
 
 Family Medical History:
-${allFamilyHistory.length > 0 ? '- ' + allFamilyHistory.join('\n- ') : 'None'}
+${allFamilyHistory.length <= 0 ? '- ' + allFamilyHistory.join('\n- ') : 'None'}
 
 Current Medications:
killedBy: GET /api/triage/appointment/:appointmentId should include "Other" fields in lists (Kill Conditional Mutants)
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Genetic Issue'

[Survived] ConditionalExpression
routes/triageRoutes.js:181:3
 ${allFamilyHistory.length > 0 ? '- ' + allFamilyHistory.join('\n- ') : 'None'}
 
 Current Medications:
-${appointment.medications || 'None'}
+${false}
 
 Allergies:

[Survived] ConditionalExpression
routes/triageRoutes.js:184:3
 ${appointment.medications || 'None'}
 
 Allergies:
-${appointment.allergies || 'None'}
+${true}
 
 DEMOGRAPHICS:

[Killed] LogicalOperator
routes/triageRoutes.js:187:8
 ${appointment.allergies || 'None'}
 
 DEMOGRAPHICS:
-Age: ${appointment.age || 'Unknown'}
+Age: ${appointment.age && 'Unknown'}
 Sex: ${appointment.sex || 'Unknown'}
 ;
killedBy: GET /api/triage/appointment/:appointmentId should format all fields correctly in the prompt
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Age: 35'

[Killed] ConditionalExpression
routes/triageRoutes.js:187:8
 ${appointment.allergies || 'None'}
 
 DEMOGRAPHICS:
-Age: ${appointment.age || 'Unknown'}
+Age: ${false}
 Sex: ${appointment.sex || 'Unknown'}
 ;
killedBy: GET /api/triage/appointment/:appointmentId should format all fields correctly in the prompt
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Age: 35'

[Killed] LogicalOperator
routes/triageRoutes.js:188:8
 
 DEMOGRAPHICS:
 Age: ${appointment.age || 'Unknown'}
-Sex: ${appointment.sex || 'Unknown'}
+Sex: ${appointment.sex && 'Unknown'}
 ;
 
killedBy: GET /api/triage/appointment/:appointmentId should format all fields correctly in the prompt
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Sex: Female'

[Killed] ConditionalExpression
routes/triageRoutes.js:188:8
 
 DEMOGRAPHICS:
 Age: ${appointment.age || 'Unknown'}
-Sex: ${appointment.sex || 'Unknown'}
+Sex: ${true}
 ;
 
killedBy: GET /api/triage/appointment/:appointmentId should format all fields correctly in the prompt
statusReason: expected '\nEMERGENCY SEVERITY INDEX (ESI) TRIA…' to contain 'Sex: Female'

[Killed] BlockStatement
routes/triageRoutes.js:207:7
   "label": "Immediate/Urgent/Minor/Non-Urgent"
 }`;
 
-  try {
-    const chatCompletion = await groq.chat.completions.create({
-      messages: [{ role: 'user', content: prompt }],
-      model: 'llama-3.3-70b-versatile',
-      temperature: 0.1,
-      response_format: { type: "json_object" }
-    });
-
-    const result = JSON.parse(chatCompletion.choices[0]?.message?.content || '{}');
-    console.log("ai is giving the triage");
-    return result;
-  } catch (error) {
+  try {} catch (error) {
     console.error('Groq AI Triage Error:', error);
     throw new Error('Failed to perform AI triage');
killedBy: GET /api/triage/appointment/:appointmentId should log success message when triage is performed
statusReason: expected "log" to be called with arguments: [ 'ai is giving the triage' ]

Number of calls: 0

[Killed] ArrayDeclaration
routes/triageRoutes.js:209:17
 
   try {
     const chatCompletion = await groq.chat.completions.create({
-      messages: [{ role: 'user', content: prompt }],
+      messages: [],
       model: 'llama-3.3-70b-versatile',
       temperature: 0.1,
killedBy: GET /api/triage/appointment/:appointmentId should verify Groq API request format
statusReason: expected { messages: [], …(3) } to match object { messages: [ { …(2) } ], …(3) }

[Killed] LogicalOperator
routes/triageRoutes.js:215:31
       response_format: { type: "json_object" }
     });
 
-    const result = JSON.parse(chatCompletion.choices[0]?.message?.content || '{}');
+    const result = JSON.parse(chatCompletion.choices[0]?.message?.content && '{}');
     console.log("ai is giving the triage");
     return result;
killedBy: GET /api/triage/appointment/:appointmentId should handle malformed JSON response from Groq API
statusReason: expected 200 to be 500 // Object.is equality

[Killed] OptionalChaining
routes/triageRoutes.js:215:31
       response_format: { type: "json_object" }
     });
 
-    const result = JSON.parse(chatCompletion.choices[0]?.message?.content || '{}');
+    const result = JSON.parse(chatCompletion.choices[0].message?.content || '{}');
     console.log("ai is giving the triage");
     return result;
killedBy: GET /api/triage/appointment/:appointmentId should handle empty Groq choices array
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
routes/triageRoutes.js:218:19
     const result = JSON.parse(chatCompletion.choices[0]?.message?.content || '{}');
     console.log("ai is giving the triage");
     return result;
-  } catch (error) {
-    console.error('Groq AI Triage Error:', error);
-    throw new Error('Failed to perform AI triage');
-  }
+  } catch (error) {}
 };
 
killedBy: GET /api/triage/appointment/:appointmentId should handle errors with undefined message in router catch block
statusReason: expected { success: false, …(2) } to deeply equal { success: false, …(2) }

[Killed] StringLiteral
routes/triageRoutes.js:224:12
   }
 };
 
-router.get('/appointment/:appointmentId', protect, async (req, res) => {
+router.get("", protect, async (req, res) => {
   try {
     const appointment = await Appointment.findById(req.params.appointmentId);
killedBy: Mutation Coverage Tests for admin.js Regex search pattern mutations should search doctors by license with exact regex prefix
statusReason: expected 400 to be 200 // Object.is equality
