[Killed] LogicalOperator
routes/triageRoutes.js:232:9
       return res.status(404).json({ message: 'Appointment not found' });
     }
 
-    if (appointment.triagePriority && appointment.triagePriorityLevel) {
+    if (appointment.triagePriority || appointment.triagePriorityLevel) {
       return res.json({
         success: true,
killedBy: GET /api/triage/appointment/:appointmentId should handle missing triage fields in cached response
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
routes/triageRoutes.js:232:9
       return res.status(404).json({ message: 'Appointment not found' });
     }
 
-    if (appointment.triagePriority && appointment.triagePriorityLevel) {
+    if (false) {
       return res.json({
         success: true,
killedBy: GET /api/triage/appointment/:appointmentId should return cached triage if already exists
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
routes/triageRoutes.js:240:17
           priorityLevel: appointment.triagePriorityLevel,
           label: appointment.triageLabel
         },
-        cached: true
+        cached: false
       });
     }
killedBy: GET /api/triage/appointment/:appointmentId should return cached triage if already exists
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
routes/triageRoutes.js:256:15
     res.json({
       success: true,
       triage: triageResult,
-      cached: false
+      cached: true
     });
 
killedBy: GET /api/triage/appointment/:appointmentId should handle empty response from Groq API
statusReason: expected { success: true, triage: {}, …(1) } to deeply equal { success: true, triage: {}, …(1) }

[Killed] BlockStatement
routes/triageRoutes.js:259:19
       cached: false
     });
 
-  } catch (error) {
-    console.error('Error performing triage:', error);
-    res.status(500).json({ 
-      success: false,
-      message: 'Failed to perform triage',
-      error: error.message 
-    });
-  }
+  } catch (error) {}
 });
 
killedBy: GET /api/triage/appointment/:appointmentId should handle malformed JSON response from Groq API
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/triageRoutes.js:260:19
     });
 
   } catch (error) {
-    console.error('Error performing triage:', error);
+    console.error("", error);
     res.status(500).json({ 
       success: false,
killedBy: GET /api/triage/appointment/:appointmentId should log specific error message on failure
statusReason: expected "error" to be called with arguments: [ 'Error performing triage:', …(1) ]

Received: 

  1st error call:

  [
-   "Error performing triage:",
