[Killed] BlockStatement
routes/doctors.js:12:7
 // @desc    Get all doctors with filtering and search
 // @access  Public (or Private if login required to browse)
 router.get('/', async (req, res) => {
-  try {
-    const { search, specialty } = req.query;
-    const query = {};
-
-    // By default, only return verified doctors to public clients.
-    // Use `?includeUnverified=true` to explicitly request unverified doctors (admin/debug use).
-    if (req.query.includeUnverified !== 'true') {
-      query.isVerified = true;
-    }
-
-    // Filter by specialization (corrected field name)
-    if (specialty && specialty !== 'All Specialties') {
-      query.specialization = specialty;
-    }
-
-    // Case-insensitive, "starts-with" search on fullName
-    if (search) {
-      query.fullName = { $regex: new RegExp('^' + search, 'i') };
-    }
-
-    const doctors = await Doctor.find(query).select('-password');
-    res.json(doctors);
-  } catch (err) {
+  try {} catch (err) {
     console.error('Get Doctors Error:', err.message);
     res.status(500).send('Server Error');
killedBy: Doctor Routes (Vitest) GET /api/doctors should return all doctors without password field
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ConditionalExpression
routes/doctors.js:18:9
 
     // By default, only return verified doctors to public clients.
     // Use `?includeUnverified=true` to explicitly request unverified doctors (admin/debug use).
-    if (req.query.includeUnverified !== 'true') {
+    if (false) {
       query.isVerified = true;
     }

[Survived] BlockStatement
routes/doctors.js:18:49
 
     // By default, only return verified doctors to public clients.
     // Use `?includeUnverified=true` to explicitly request unverified doctors (admin/debug use).
-    if (req.query.includeUnverified !== 'true') {
-      query.isVerified = true;
-    }
+    if (req.query.includeUnverified !== 'true') {}
 
     // Filter by specialization (corrected field name)

[Killed] BooleanLiteral
routes/doctors.js:19:26
     // By default, only return verified doctors to public clients.
     // Use `?includeUnverified=true` to explicitly request unverified doctors (admin/debug use).
     if (req.query.includeUnverified !== 'true') {
-      query.isVerified = true;
+      query.isVerified = false;
     }
 
killedBy: Doctor Routes (Vitest) GET /api/doctors should return all doctors without password field
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
routes/doctors.js:23:22
     }
 
     // Filter by specialization (corrected field name)
-    if (specialty && specialty !== 'All Specialties') {
+    if (specialty && true) {
       query.specialization = specialty;
     }
killedBy: Doctor Routes (Vitest) GET /api/doctors should not filter when specialty is "All Specialties"
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
routes/doctors.js:23:9
     }
 
     // Filter by specialization (corrected field name)
-    if (specialty && specialty !== 'All Specialties') {
+    if (specialty || specialty !== 'All Specialties') {
       query.specialization = specialty;
     }
killedBy: Doctor Routes (Vitest) GET /api/doctors should return all doctors without password field
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
routes/doctors.js:28:9
     }
 
     // Case-insensitive, "starts-with" search on fullName
-    if (search) {
+    if (false) {
       query.fullName = { $regex: new RegExp('^' + search, 'i') };
     }
killedBy: Mutation Coverage Tests for doctors.js Search functionality mutations should properly search with regex prefix (not match middle of name)
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
routes/doctors.js:28:17
     }
 
     // Case-insensitive, "starts-with" search on fullName
-    if (search) {
-      query.fullName = { $regex: new RegExp('^' + search, 'i') };
-    }
+    if (search) {}
 
     const doctors = await Doctor.find(query).select('-password');
killedBy: Mutation Coverage Tests for doctors.js Search functionality mutations should properly search with regex prefix (not match middle of name)
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ObjectLiteral
routes/doctors.js:29:24
 
     // Case-insensitive, "starts-with" search on fullName
     if (search) {
-      query.fullName = { $regex: new RegExp('^' + search, 'i') };
+      query.fullName = {};
     }
 
killedBy: Doctor Routes (Vitest) GET /api/doctors should search by fullName (case-insensitive, starts-with)
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
routes/doctors.js:34:17
 
     const doctors = await Doctor.find(query).select('-password');
     res.json(doctors);
-  } catch (err) {
-    console.error('Get Doctors Error:', err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: Doctor Routes (Vitest) GET /api/doctors should handle server errors gracefully
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/doctors.js:35:19
     const doctors = await Doctor.find(query).select('-password');
     res.json(doctors);
   } catch (err) {
-    console.error('Get Doctors Error:', err.message);
+    console.error("", err.message);
     res.status(500).send('Server Error');
   }
killedBy: Mutation Coverage Tests for doctors.js Console error logging should log specific error message when get doctors fails
statusReason: expected "error" to be called with arguments: [ StringContaining{…}, Any<String> ]

Received: 

  1st error call:

  [
-   StringContaining "Get Doctors Error:",

[Killed] StringLiteral
routes/doctors.js:36:26
     res.json(doctors);
   } catch (err) {
     console.error('Get Doctors Error:', err.message);
-    res.status(500).send('Server Error');
+    res.status(500).send("");
   }
 });
killedBy: Doctor Routes (Vitest) GET /api/doctors should handle server errors gracefully
statusReason: expected '' to be 'Server Error' // Object.is equality

[Killed] StringLiteral
routes/doctors.js:43:12
 // @route   GET api/doctors/earnings/data
 // @desc    Get earnings data for the logged-in doctor
 // @access  Private (Doctor only)
-router.get('/earnings/data', authMiddleware, async (req, res) => {
+router.get("", authMiddleware, async (req, res) => {
   // 1. Verify user is a doctor
   if (req.user.userType !== 'doctor') {
killedBy: GET /api/triage/appointment/:appointmentId should perform AI triage for BLACK (P4) - non-urgent
statusReason: expected 400 to be 200 // Object.is equality

[Killed] EqualityOperator
routes/doctors.js:45:7
 // @access  Private (Doctor only)
 router.get('/earnings/data', authMiddleware, async (req, res) => {
   // 1. Verify user is a doctor
-  if (req.user.userType !== 'doctor') {
+  if (req.user.userType === 'doctor') {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should return 403 if user is not a doctor
statusReason: expected 500 to be 403 // Object.is equality

[Killed] ConditionalExpression
routes/doctors.js:45:7
 // @access  Private (Doctor only)
 router.get('/earnings/data', authMiddleware, async (req, res) => {
   // 1. Verify user is a doctor
-  if (req.user.userType !== 'doctor') {
+  if (false) {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should return 403 if user is not a doctor
statusReason: expected 500 to be 403 // Object.is equality

[Killed] MethodExpression
routes/doctors.js:53:32
     const doctorId = req.user.userId;
 
     // 2. Fetch all appointments for this doctor
-    const appointments = await Appointment.find({ doctor: doctorId })
-      .sort({ date: -1 }); // Sort newest first for transactions
+    const appointments = await Appointment.find({
+  doctor: doctorId
+}); // Sort newest first for transactions
 
     // 3. Calculate earnings (only count 'completed' appointments)
killedBy: Mutation Coverage Tests for doctors.js Sorting mutations should sort appointments by date descending (newest first)
statusReason: expected 'Old Patient' to be 'New Patient' // Object.is equality

[Killed] ObjectLiteral
routes/doctors.js:53:49
     const doctorId = req.user.userId;
 
     // 2. Fetch all appointments for this doctor
-    const appointments = await Appointment.find({ doctor: doctorId })
+    const appointments = await Appointment.find({})
       .sort({ date: -1 }); // Sort newest first for transactions
 
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should handle server errors in earnings endpoint
statusReason: expected 200 to be 500 // Object.is equality

[Killed] UnaryOperator
routes/doctors.js:54:21
 
     // 2. Fetch all appointments for this doctor
     const appointments = await Appointment.find({ doctor: doctorId })
-      .sort({ date: -1 }); // Sort newest first for transactions
+      .sort({ date: +1 }); // Sort newest first for transactions
 
     // 3. Calculate earnings (only count 'completed' appointments)
killedBy: Mutation Coverage Tests for doctors.js Sorting mutations should sort appointments by date descending (newest first)
statusReason: expected 'Old Patient' to be 'New Patient' // Object.is equality

[Killed] ArithmeticOperator
routes/doctors.js:67:23
     // Ensure todayStart calculation doesn't modify 'now' permanently for subsequent calculations
     const todayStart = new Date(now.getFullYear(), now.getMonth(), now.getDate());
     const weekStart = new Date(todayStart);
-    weekStart.setDate(weekStart.getDate() - todayStart.getDay()); // Start of current week (Sunday)
+    weekStart.setDate(weekStart.getDate() + todayStart.getDay()); // Start of current week (Sunday)
     const monthStart = new Date(now.getFullYear(), now.getMonth(), 1);
 
killedBy: Mutation Coverage Tests for doctors.js Earnings date calculations should correctly calculate earnings at week boundaries
statusReason: expected +0 to be 500 // Object.is equality

[Killed] MethodExpression
routes/doctors.js:67:5
     // Ensure todayStart calculation doesn't modify 'now' permanently for subsequent calculations
     const todayStart = new Date(now.getFullYear(), now.getMonth(), now.getDate());
     const weekStart = new Date(todayStart);
-    weekStart.setDate(weekStart.getDate() - todayStart.getDay()); // Start of current week (Sunday)
+    weekStart.setTime(weekStart.getDate() - todayStart.getDay()); // Start of current week (Sunday)
     const monthStart = new Date(now.getFullYear(), now.getMonth(), 1);
 
killedBy: Mutation Coverage Tests for doctors.js Earnings date calculations should correctly calculate earnings at week boundaries
statusReason: expected +0 to be 500 // Object.is equality

[Killed] ArithmeticOperator
routes/doctors.js:71:27
     const monthStart = new Date(now.getFullYear(), now.getMonth(), 1);
 
     const tomorrowStart = new Date(todayStart);
-    tomorrowStart.setDate(tomorrowStart.getDate() + 1);
+    tomorrowStart.setDate(tomorrowStart.getDate() - 1);
 
     const weekEnd = new Date(weekStart);
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected +0 to be 500 // Object.is equality

[Killed] MethodExpression
routes/doctors.js:71:5
     const monthStart = new Date(now.getFullYear(), now.getMonth(), 1);
 
     const tomorrowStart = new Date(todayStart);
-    tomorrowStart.setDate(tomorrowStart.getDate() + 1);
+    tomorrowStart.setTime(tomorrowStart.getDate() + 1);
 
     const weekEnd = new Date(weekStart);
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected +0 to be 500 // Object.is equality

[Killed] MethodExpression
routes/doctors.js:74:5
     tomorrowStart.setDate(tomorrowStart.getDate() + 1);
 
     const weekEnd = new Date(weekStart);
-    weekEnd.setDate(weekEnd.getDate() + 7);
+    weekEnd.setTime(weekEnd.getDate() + 7);
 
     const monthEnd = new Date(monthStart.getFullYear(), monthStart.getMonth() + 1, 1);
killedBy: Mutation Coverage Tests for doctors.js Earnings date calculations should correctly calculate earnings at week boundaries
statusReason: expected +0 to be 500 // Object.is equality

[Killed] ArithmeticOperator
routes/doctors.js:74:21
     tomorrowStart.setDate(tomorrowStart.getDate() + 1);
 
     const weekEnd = new Date(weekStart);
-    weekEnd.setDate(weekEnd.getDate() + 7);
+    weekEnd.setDate(weekEnd.getDate() - 7);
 
     const monthEnd = new Date(monthStart.getFullYear(), monthStart.getMonth() + 1, 1);
killedBy: Mutation Coverage Tests for doctors.js Earnings date calculations should correctly calculate earnings at week boundaries
statusReason: expected +0 to be 500 // Object.is equality

[Killed] ArithmeticOperator
routes/doctors.js:76:57
     const weekEnd = new Date(weekStart);
     weekEnd.setDate(weekEnd.getDate() + 7);
 
-    const monthEnd = new Date(monthStart.getFullYear(), monthStart.getMonth() + 1, 1);
+    const monthEnd = new Date(monthStart.getFullYear(), monthStart.getMonth() - 1, 1);
 
     const shouldCountAppointment = (apt) => {
killedBy: Mutation Coverage Tests for doctors.js Earnings date calculations should correctly calculate earnings at month boundaries
statusReason: expected +0 to be 600 // Object.is equality

[Killed] BlockStatement
routes/doctors.js:78:45
 
     const monthEnd = new Date(monthStart.getFullYear(), monthStart.getMonth() + 1, 1);
 
-    const shouldCountAppointment = (apt) => {
-      const status = apt.status?.toLowerCase();
-      return status === 'completed' || status === 'upcoming';
-    };
+    const shouldCountAppointment = (apt) => {};
 
     appointments.forEach(apt => {
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected +0 to be 500 // Object.is equality

[Killed] OptionalChaining
routes/doctors.js:79:22
     const monthEnd = new Date(monthStart.getFullYear(), monthStart.getMonth() + 1, 1);
 
     const shouldCountAppointment = (apt) => {
-      const status = apt.status?.toLowerCase();
+      const status = apt.status.toLowerCase();
       return status === 'completed' || status === 'upcoming';
     };
killedBy: Mutation Coverage Tests for doctors.js Appointment status handling should handle appointments with null status using optional chaining
statusReason: expected 500 to be 200 // Object.is equality

[Killed] MethodExpression
routes/doctors.js:79:22
     const monthEnd = new Date(monthStart.getFullYear(), monthStart.getMonth() + 1, 1);
 
     const shouldCountAppointment = (apt) => {
-      const status = apt.status?.toLowerCase();
+      const status = apt.status?.toUpperCase();
       return status === 'completed' || status === 'upcoming';
     };
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected +0 to be 500 // Object.is equality

[Killed] ConditionalExpression
routes/doctors.js:80:40
 
     const shouldCountAppointment = (apt) => {
       const status = apt.status?.toLowerCase();
-      return status === 'completed' || status === 'upcoming';
+      return status === 'completed' || false;
     };
 
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected 500 to be 800 // Object.is equality

[Killed] LogicalOperator
routes/doctors.js:80:14
 
     const shouldCountAppointment = (apt) => {
       const status = apt.status?.toLowerCase();
-      return status === 'completed' || status === 'upcoming';
+      return status === 'completed' && status === 'upcoming';
     };
 
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected +0 to be 500 // Object.is equality

[Killed] ConditionalExpression
routes/doctors.js:84:11
     };
 
     appointments.forEach(apt => {
-      if (!shouldCountAppointment(apt)) return;
+      if (true) return;
 
       const fee = apt.consultationFeeAtBooking || 0;
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected +0 to be 500 // Object.is equality

[Killed] BooleanLiteral
routes/doctors.js:84:11
     };
 
     appointments.forEach(apt => {
-      if (!shouldCountAppointment(apt)) return;
+      if (shouldCountAppointment(apt)) return;
 
       const fee = apt.consultationFeeAtBooking || 0;
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected +0 to be 500 // Object.is equality

[Killed] LogicalOperator
routes/doctors.js:86:19
     appointments.forEach(apt => {
       if (!shouldCountAppointment(apt)) return;
 
-      const fee = apt.consultationFeeAtBooking || 0;
+      const fee = apt.consultationFeeAtBooking && 0;
       totalEarnings += fee;
       const aptDate = new Date(apt.date);
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected +0 to be 500 // Object.is equality

[Killed] ConditionalExpression
routes/doctors.js:86:19
     appointments.forEach(apt => {
       if (!shouldCountAppointment(apt)) return;
 
-      const fee = apt.consultationFeeAtBooking || 0;
+      const fee = false;
       totalEarnings += fee;
       const aptDate = new Date(apt.date);
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected +0 to be 500 // Object.is equality

[Killed] AssignmentOperator
routes/doctors.js:87:7
       if (!shouldCountAppointment(apt)) return;
 
       const fee = apt.consultationFeeAtBooking || 0;
-      totalEarnings += fee;
+      totalEarnings -= fee;
       const aptDate = new Date(apt.date);
 
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected -800 to be 800 // Object.is equality

[Killed] ConditionalExpression
routes/doctors.js:90:11
       totalEarnings += fee;
       const aptDate = new Date(apt.date);
 
-      if (aptDate >= todayStart && aptDate < tomorrowStart) today += fee;
+      if (false) today += fee;
       if (aptDate >= weekStart && aptDate < weekEnd) thisWeek += fee;
       if (aptDate >= monthStart && aptDate < monthEnd) thisMonth += fee;
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected +0 to be 500 // Object.is equality

[Killed] LogicalOperator
routes/doctors.js:90:11
       totalEarnings += fee;
       const aptDate = new Date(apt.date);
 
-      if (aptDate >= todayStart && aptDate < tomorrowStart) today += fee;
+      if (aptDate >= todayStart || aptDate < tomorrowStart) today += fee;
       if (aptDate >= weekStart && aptDate < weekEnd) thisWeek += fee;
       if (aptDate >= monthStart && aptDate < monthEnd) thisMonth += fee;
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected 800 to be 500 // Object.is equality

[Killed] EqualityOperator
routes/doctors.js:91:11
       const aptDate = new Date(apt.date);
 
       if (aptDate >= todayStart && aptDate < tomorrowStart) today += fee;
-      if (aptDate >= weekStart && aptDate < weekEnd) thisWeek += fee;
+      if (aptDate < weekStart && aptDate < weekEnd) thisWeek += fee;
       if (aptDate >= monthStart && aptDate < monthEnd) thisMonth += fee;
 
killedBy: Mutation Coverage Tests for doctors.js Earnings date calculations should correctly calculate earnings at week boundaries
statusReason: expected 300 to be 500 // Object.is equality

[Killed] EqualityOperator
routes/doctors.js:91:35
       const aptDate = new Date(apt.date);
 
       if (aptDate >= todayStart && aptDate < tomorrowStart) today += fee;
-      if (aptDate >= weekStart && aptDate < weekEnd) thisWeek += fee;
+      if (aptDate >= weekStart && aptDate >= weekEnd) thisWeek += fee;
       if (aptDate >= monthStart && aptDate < monthEnd) thisMonth += fee;
 
killedBy: Mutation Coverage Tests for doctors.js Earnings date calculations should correctly calculate earnings at week boundaries
statusReason: expected +0 to be 500 // Object.is equality

[Killed] LogicalOperator
routes/doctors.js:92:11
 
       if (aptDate >= todayStart && aptDate < tomorrowStart) today += fee;
       if (aptDate >= weekStart && aptDate < weekEnd) thisWeek += fee;
-      if (aptDate >= monthStart && aptDate < monthEnd) thisMonth += fee;
+      if (aptDate >= monthStart || aptDate < monthEnd) thisMonth += fee;
 
       const monthIndex = aptDate.getMonth();
killedBy: Mutation Coverage Tests for doctors.js Earnings date calculations should correctly calculate earnings at month boundaries
statusReason: expected 1000 to be 600 // Object.is equality

[Killed] ConditionalExpression
routes/doctors.js:92:11
 
       if (aptDate >= todayStart && aptDate < tomorrowStart) today += fee;
       if (aptDate >= weekStart && aptDate < weekEnd) thisWeek += fee;
-      if (aptDate >= monthStart && aptDate < monthEnd) thisMonth += fee;
+      if (true) thisMonth += fee;
 
       const monthIndex = aptDate.getMonth();
killedBy: Mutation Coverage Tests for doctors.js Earnings date calculations should correctly calculate earnings at month boundaries
statusReason: expected 1000 to be 600 // Object.is equality

[Killed] ConditionalExpression
routes/doctors.js:97:11
       const monthIndex = aptDate.getMonth();
       const year = aptDate.getFullYear();
       const monthKey = `${year}-${monthIndex}`;
-      if (!monthlyBreakdownMap[monthKey]) {
+      if (true) {
         monthlyBreakdownMap[monthKey] = {
           key: monthKey,
killedBy: Mutation Coverage Tests for doctors.js Monthly breakdown calculations should correctly increment appointment count and earnings per month
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
routes/doctors.js:97:11
       const monthIndex = aptDate.getMonth();
       const year = aptDate.getFullYear();
       const monthKey = `${year}-${monthIndex}`;
-      if (!monthlyBreakdownMap[monthKey]) {
+      if (monthlyBreakdownMap[monthKey]) {
         monthlyBreakdownMap[monthKey] = {
           key: monthKey,
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected 500 to be 200 // Object.is equality

[Killed] StringLiteral
routes/doctors.js:100:18
       if (!monthlyBreakdownMap[monthKey]) {
         monthlyBreakdownMap[monthKey] = {
           key: monthKey,
-          month: `${aptDate.toLocaleString('default', { month: 'long' })} ${year}`,
+          month: ``,
           monthIndex,
           year,
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should sort monthly breakdown by year and month correctly with multi-year data
statusReason: expected '' to contain '2025'

[Killed] ObjectLiteral
routes/doctors.js:100:55
       if (!monthlyBreakdownMap[monthKey]) {
         monthlyBreakdownMap[monthKey] = {
           key: monthKey,
-          month: `${aptDate.toLocaleString('default', { month: 'long' })} ${year}`,
+          month: `${aptDate.toLocaleString('default', {})} ${year}`,
           monthIndex,
           year,
killedBy: Mutation Coverage Tests for doctors.js Sorting mutations should sort monthly breakdown by year and month descending
statusReason: expected '12/15/2025, 12:00:00 AM 2025' to contain 'December'

[Killed] UpdateOperator
routes/doctors.js:107:7
           earnings: 0
         };
       }
-      monthlyBreakdownMap[monthKey].appointments++;
+      monthlyBreakdownMap[monthKey].appointments--;
       monthlyBreakdownMap[monthKey].earnings += fee;
     });
killedBy: Mutation Coverage Tests for doctors.js Monthly breakdown calculations should correctly increment appointment count and earnings per month
statusReason: expected -2 to be 2 // Object.is equality

[Killed] AssignmentOperator
routes/doctors.js:108:7
         };
       }
       monthlyBreakdownMap[monthKey].appointments++;
-      monthlyBreakdownMap[monthKey].earnings += fee;
+      monthlyBreakdownMap[monthKey].earnings -= fee;
     });
 
killedBy: Mutation Coverage Tests for doctors.js Monthly breakdown calculations should correctly increment appointment count and earnings per month
statusReason: expected -800 to be 800 // Object.is equality

[Killed] MethodExpression
routes/doctors.js:112:32
     });
 
     // 4. Format recent transactions (show non-cancelled, use main status)
-    const recentTransactions = appointments
-      .filter(apt => apt.status !== 'cancelled')
-      .slice(0, 10)
+    const recentTransactions = appointments.filter(apt => apt.status !== 'cancelled')
       .map(apt => ({
         id: apt._id,
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should limit recent transactions to 10
statusReason: expected 15 to be less than or equal to 10

[Killed] MethodExpression
routes/doctors.js:112:32
     });
 
     // 4. Format recent transactions (show non-cancelled, use main status)
-    const recentTransactions = appointments
-      .filter(apt => apt.status !== 'cancelled')
+    const recentTransactions = appointments
       .slice(0, 10)
       .map(apt => ({
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
routes/doctors.js:113:22
 
     // 4. Format recent transactions (show non-cancelled, use main status)
     const recentTransactions = appointments
-      .filter(apt => apt.status !== 'cancelled')
+      .filter(apt => true)
       .slice(0, 10)
       .map(apt => ({
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ArrowFunction
routes/doctors.js:113:15
 
     // 4. Format recent transactions (show non-cancelled, use main status)
     const recentTransactions = appointments
-      .filter(apt => apt.status !== 'cancelled')
+      .filter(() => undefined)
       .slice(0, 10)
       .map(apt => ({
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
routes/doctors.js:115:12
     const recentTransactions = appointments
       .filter(apt => apt.status !== 'cancelled')
       .slice(0, 10)
-      .map(apt => ({
-        id: apt._id,
-        patientName: apt.patientNameForVisit,
-        date: apt.date,
-        time: apt.time,
-        amount: apt.consultationFeeAtBooking,
-        status: apt.status, // Use main appointment status ('upcoming' or 'completed')
-      }));
+      .map(() => undefined);
 
     const monthlyBreakdown = Object.values(monthlyBreakdownMap)
killedBy: Mutation Coverage Tests for doctors.js Sorting mutations should sort appointments by date descending (newest first)
statusReason: Cannot read properties of null (reading 'patientName')

[Survived] MethodExpression
routes/doctors.js:124:30
         status: apt.status, // Use main appointment status ('upcoming' or 'completed')
       }));
 
-    const monthlyBreakdown = Object.values(monthlyBreakdownMap)
-      .sort((a, b) => {
-        if (b.year === a.year) {
-          return b.monthIndex - a.monthIndex;
-        }
-        return b.year - a.year;
-      })
+    const monthlyBreakdown = Object.values(monthlyBreakdownMap)
       .map(({ month, appointments, earnings }) => ({ month, appointments, earnings }));
 

[Survived] BlockStatement
routes/doctors.js:125:23
       }));
 
     const monthlyBreakdown = Object.values(monthlyBreakdownMap)
-      .sort((a, b) => {
-        if (b.year === a.year) {
-          return b.monthIndex - a.monthIndex;
-        }
-        return b.year - a.year;
-      })
+      .sort((a, b) => {})
       .map(({ month, appointments, earnings }) => ({ month, appointments, earnings }));
 

[Killed] EqualityOperator
routes/doctors.js:126:13
 
     const monthlyBreakdown = Object.values(monthlyBreakdownMap)
       .sort((a, b) => {
-        if (b.year === a.year) {
+        if (b.year !== a.year) {
           return b.monthIndex - a.monthIndex;
         }
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should sort monthly breakdown by year and month correctly with multi-year data
statusReason: expected 'December 2024' to contain '2025'

[Killed] ConditionalExpression
routes/doctors.js:126:13
 
     const monthlyBreakdown = Object.values(monthlyBreakdownMap)
       .sort((a, b) => {
-        if (b.year === a.year) {
+        if (true) {
           return b.monthIndex - a.monthIndex;
         }
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should sort monthly breakdown by year and month correctly with multi-year data
statusReason: expected 'December 2024' to contain '2025'
