[Survived] ArithmeticOperator
routes/doctors.js:127:18
     const monthlyBreakdown = Object.values(monthlyBreakdownMap)
       .sort((a, b) => {
         if (b.year === a.year) {
-          return b.monthIndex - a.monthIndex;
+          return b.monthIndex + a.monthIndex;
         }
         return b.year - a.year;

[Survived] ArithmeticOperator
routes/doctors.js:129:16
         if (b.year === a.year) {
           return b.monthIndex - a.monthIndex;
         }
-        return b.year - a.year;
+        return b.year + a.year;
       })
       .map(({ month, appointments, earnings }) => ({ month, appointments, earnings }));

[Killed] ArrowFunction
routes/doctors.js:131:12
         }
         return b.year - a.year;
       })
-      .map(({ month, appointments, earnings }) => ({ month, appointments, earnings }));
+      .map(() => undefined);
 
 
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should sort monthly breakdown by year and month correctly with multi-year data
statusReason: Cannot read properties of null (reading 'month')

[Killed] ObjectLiteral
routes/doctors.js:134:14
       .map(({ month, appointments, earnings }) => ({ month, appointments, earnings }));
 
 
-    res.json({
-      today,
-      thisWeek,
-      thisMonth,
-      totalEarnings,
-      recentTransactions,
-      monthlyBreakdown: monthlyBreakdown.slice(0, 6),
-    });
+    res.json({});
 
   } catch (err) {
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should calculate earnings correctly for today, week, and month
statusReason: expected undefined to be 500 // Object.is equality

[Killed] MethodExpression
routes/doctors.js:140:25
       thisMonth,
       totalEarnings,
       recentTransactions,
-      monthlyBreakdown: monthlyBreakdown.slice(0, 6),
+      monthlyBreakdown: monthlyBreakdown,
     });
 
killedBy: Mutation Coverage Tests for doctors.js Monthly breakdown calculations should limit monthly breakdown to 6 entries
statusReason: expected 12 to be 6 // Object.is equality

[Killed] BlockStatement
routes/doctors.js:143:17
       monthlyBreakdown: monthlyBreakdown.slice(0, 6),
     });
 
-  } catch (err) {
-    console.error('Earnings Error:', err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/data should handle server errors in earnings endpoint
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/doctors.js:153:39
 // @desc    Download earnings report as CSV for the logged-in doctor
 // @access  Private (Doctor only)
 router.get('/earnings/download-report', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
-    return res.status(403).json({ message: 'Access denied. Not a doctor.' });
-  }
+  if (req.user.userType !== 'doctor') {}
 
   try {
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/download-report should return 403 if user is not a doctor
statusReason: expected 500 to be 403 // Object.is equality

[Killed] EqualityOperator
routes/doctors.js:153:7
 // @desc    Download earnings report as CSV for the logged-in doctor
 // @access  Private (Doctor only)
 router.get('/earnings/download-report', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
+  if (req.user.userType === 'doctor') {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/download-report should return 403 if user is not a doctor
statusReason: expected 500 to be 403 // Object.is equality

[Survived] MethodExpression
routes/doctors.js:160:32
   try {
     const doctorId = req.user.userId;
 
-    const appointments = await Appointment.find({
-      doctor: doctorId,
-    }).sort({ date: -1 });
+    const appointments = await Appointment.find({
+  doctor: doctorId
+});
 
     const fields = [

[Killed] UnaryOperator
routes/doctors.js:162:21
 
     const appointments = await Appointment.find({
       doctor: doctorId,
-    }).sort({ date: -1 });
+    }).sort({ date: +1 });
 
     const fields = [
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/download-report should sort CSV data by date descending (newest first)
statusReason: expected '"692a5cf52c030dd83d3a80a1","1/1/2024"…' to contain 'New Patient'

[Killed] ObjectLiteral
routes/doctors.js:162:13
 
     const appointments = await Appointment.find({
       doctor: doctorId,
-    }).sort({ date: -1 });
+    }).sort({});
 
     const fields = [
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/download-report should sort CSV data by date descending (newest first)
statusReason: expected '"692a5cf51439cd2a6de500e5","1/1/2024"…' to contain 'New Patient'

[Killed] ObjectLiteral
routes/doctors.js:165:7
     }).sort({ date: -1 });
 
     const fields = [
-      { label: 'Appointment ID', value: '_id' },
+      {},
       { label: 'Date', value: row => new Date(row.date).toLocaleDateString() },
       { label: 'Time', value: 'time' },
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/download-report should download CSV report for doctor
statusReason: expected 500 to be 200 // Object.is equality

[Survived] ArrowFunction
routes/doctors.js:166:31
 
     const fields = [
       { label: 'Appointment ID', value: '_id' },
-      { label: 'Date', value: row => new Date(row.date).toLocaleDateString() },
+      { label: 'Date', value: () => undefined },
       { label: 'Time', value: 'time' },
       { label: 'Patient Name', value: 'patientNameForVisit' },

[Killed] ObjectLiteral
routes/doctors.js:166:7
 
     const fields = [
       { label: 'Appointment ID', value: '_id' },
-      { label: 'Date', value: row => new Date(row.date).toLocaleDateString() },
+      {},
       { label: 'Time', value: 'time' },
       { label: 'Patient Name', value: 'patientNameForVisit' },
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/download-report should download CSV report for doctor
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ObjectLiteral
routes/doctors.js:167:7
     const fields = [
       { label: 'Appointment ID', value: '_id' },
       { label: 'Date', value: row => new Date(row.date).toLocaleDateString() },
-      { label: 'Time', value: 'time' },
+      {},
       { label: 'Patient Name', value: 'patientNameForVisit' },
       { label: 'Reason', value: 'reasonForVisit' },
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/download-report should download CSV report for doctor
statusReason: expected 500 to be 200 // Object.is equality

[Killed] StringLiteral
routes/doctors.js:171:33
       { label: 'Patient Name', value: 'patientNameForVisit' },
       { label: 'Reason', value: 'reasonForVisit' },
       { label: 'Fee', value: 'consultationFeeAtBooking' },
-      { label: 'Status', value: 'status' },
+      { label: 'Status', value: "" },
       // Removed paymentStatus as per your request
     ];
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/download-report should verify CSV contains exact appointment data fields
statusReason: expected '"Appointment ID","Date","Time","Patie…' to contain 'completed'

[Killed] ArrowFunction
routes/doctors.js:174:38
       { label: 'Status', value: 'status' },
       // Removed paymentStatus as per your request
     ];
-    const csvData = appointments.map(apt => ({
-      _id: apt._id,
-      date: apt.date,
-      time: apt.time,
-      patientNameForVisit: apt.patientNameForVisit,
-      reasonForVisit: apt.reasonForVisit,
-      consultationFeeAtBooking: apt.consultationFeeAtBooking,
-      status: apt.status,
-    }));
+    const csvData = appointments.map(() => undefined);
 
     const json2csvParser = new Parser({ fields });
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/download-report should download CSV report for doctor
statusReason: expected '"Appointment ID","Date","Time","Patie…' to contain 'John Doe'

[Killed] StringLiteral
routes/doctors.js:188:16
     const csv = json2csvParser.parse(csvData);
 
     const fileName = `earnings-report-${new Date().toISOString().split('T')[0]}.csv`;
-    res.header('Content-Type', 'text/csv');
+    res.header("", 'text/csv');
     res.attachment(fileName);
     res.send(csv);
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/download-report should download CSV report for doctor
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
routes/doctors.js:192:17
     res.attachment(fileName);
     res.send(csv);
 
-  } catch (err) {
-    console.error('Download Report Error:', err.message);
-    res.status(500).send('Server Error generating report');
-  }
+  } catch (err) {}
 });
 
killedBy: Doctor Routes (Vitest) GET /api/doctors/earnings/download-report should handle server errors in download endpoint
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/doctors.js:194:26
 
   } catch (err) {
     console.error('Download Report Error:', err.message);
-    res.status(500).send('Server Error generating report');
+    res.status(500).send("");
   }
 });
killedBy: Mutation Coverage Tests for doctors.js Error response messages should return specific error message for download report endpoint
statusReason: expected '' to be 'Server Error generating report' // Object.is equality

[Killed] BlockStatement
routes/doctors.js:203:40
 // @desc    Get a single doctor's profile by their ID
 // @access  Public (or Private if login required)
 // IMPORTANT: This MUST come AFTER specific routes like '/earnings/...'
-router.get('/:id', async (req, res) => {
-  try {
-    const doctor = await Doctor.findById(req.params.id).select('-password');
-    if (!doctor) {
-      return res.status(404).json({ message: 'Doctor not found' });
-    }
-    res.json(doctor);
-  } catch (err) {
-    console.error('Get Doctor by ID Error:', err.message);
-    // Handle potential CastError if the ID format is invalid
-    if (err.kind === 'ObjectId') {
-        return res.status(400).json({ message: 'Invalid Doctor ID format' });
-    }
-    res.status(500).send('Server Error');
-  }
-});
+router.get('/:id', async (req, res) => {});
 
 
killedBy: Doctor Routes (Vitest) GET /api/doctors/:id should return doctor profile without password
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/doctors.js:204:7
 // @access  Public (or Private if login required)
 // IMPORTANT: This MUST come AFTER specific routes like '/earnings/...'
 router.get('/:id', async (req, res) => {
-  try {
-    const doctor = await Doctor.findById(req.params.id).select('-password');
-    if (!doctor) {
-      return res.status(404).json({ message: 'Doctor not found' });
-    }
-    res.json(doctor);
-  } catch (err) {
+  try {} catch (err) {
     console.error('Get Doctor by ID Error:', err.message);
     // Handle potential CastError if the ID format is invalid
killedBy: Doctor Routes (Vitest) GET /api/doctors/:id should return doctor profile without password
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
routes/doctors.js:206:9
 router.get('/:id', async (req, res) => {
   try {
     const doctor = await Doctor.findById(req.params.id).select('-password');
-    if (!doctor) {
+    if (true) {
       return res.status(404).json({ message: 'Doctor not found' });
     }
killedBy: Doctor Routes (Vitest) GET /api/doctors/:id should return doctor profile without password
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/doctors.js:206:9
 router.get('/:id', async (req, res) => {
   try {
     const doctor = await Doctor.findById(req.params.id).select('-password');
-    if (!doctor) {
+    if (false) {
       return res.status(404).json({ message: 'Doctor not found' });
     }
killedBy: Doctor Routes (Vitest) GET /api/doctors/:id should return 404 for non-existent ID
statusReason: expected 200 to be 404 // Object.is equality

[Killed] StringLiteral
routes/doctors.js:207:46
   try {
     const doctor = await Doctor.findById(req.params.id).select('-password');
     if (!doctor) {
-      return res.status(404).json({ message: 'Doctor not found' });
+      return res.status(404).json({ message: "" });
     }
     res.json(doctor);
killedBy: Doctor Routes (Vitest) GET /api/doctors/:id should return 404 for non-existent ID
statusReason: expected '' to be 'Doctor not found' // Object.is equality

[Killed] BlockStatement
routes/doctors.js:210:17
       return res.status(404).json({ message: 'Doctor not found' });
     }
     res.json(doctor);
-  } catch (err) {
-    console.error('Get Doctor by ID Error:', err.message);
-    // Handle potential CastError if the ID format is invalid
-    if (err.kind === 'ObjectId') {
-        return res.status(400).json({ message: 'Invalid Doctor ID format' });
-    }
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: Doctor Routes (Vitest) GET /api/doctors/:id should return 400 for invalid ID format
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
routes/doctors.js:213:9
   } catch (err) {
     console.error('Get Doctor by ID Error:', err.message);
     // Handle potential CastError if the ID format is invalid
-    if (err.kind === 'ObjectId') {
+    if (err.kind !== 'ObjectId') {
         return res.status(400).json({ message: 'Invalid Doctor ID format' });
     }
killedBy: Doctor Routes (Vitest) GET /api/doctors/:id should return 400 for invalid ID format
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
routes/doctors.js:213:34
   } catch (err) {
     console.error('Get Doctor by ID Error:', err.message);
     // Handle potential CastError if the ID format is invalid
-    if (err.kind === 'ObjectId') {
-        return res.status(400).json({ message: 'Invalid Doctor ID format' });
-    }
+    if (err.kind === 'ObjectId') {}
     res.status(500).send('Server Error');
   }
killedBy: Doctor Routes (Vitest) GET /api/doctors/:id should return 400 for invalid ID format
statusReason: expected 500 to be 400 // Object.is equality

[Killed] StringLiteral
routes/doctors.js:216:26
     if (err.kind === 'ObjectId') {
         return res.status(400).json({ message: 'Invalid Doctor ID format' });
     }
-    res.status(500).send('Server Error');
+    res.status(500).send("");
   }
 });
killedBy: Doctor Routes (Vitest) GET /api/doctors/:id should handle server errors in get doctor by ID
statusReason: expected '' to be 'Server Error' // Object.is equality
