[Killed] BlockStatement
routes/schedule.js:6:66
 const authMiddleware = require('../middleware/auth');
 const Doctor = require('../models/Doctor');
 
-router.get('/working-hours', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
-    return res.status(403).json({ message: 'Access denied. Not a doctor.' });
-  }
-  try {
-    const doctor = await Doctor.findById(req.user.userId);
-    if (!doctor) {
-      return res.status(404).json({ message: 'Doctor not found' });
-    }
-    res.json(doctor.workingHours);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
-});
+router.get('/working-hours', authMiddleware, async (req, res) => {});
 
 router.post('/working-hours', authMiddleware, async (req, res) => {
killedBy: GET /api/schedule/working-hours should get working hours for a doctor successfully
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
routes/schedule.js:7:7
 const Doctor = require('../models/Doctor');
 
 router.get('/working-hours', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
+  if (true) {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
killedBy: GET /api/schedule/working-hours should get working hours for a doctor successfully
statusReason: expected 403 to be 200 // Object.is equality

[Killed] BlockStatement
routes/schedule.js:7:39
 const Doctor = require('../models/Doctor');
 
 router.get('/working-hours', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
-    return res.status(403).json({ message: 'Access denied. Not a doctor.' });
-  }
+  if (req.user.userType !== 'doctor') {}
   try {
     const doctor = await Doctor.findById(req.user.userId);
killedBy: GET /api/schedule/working-hours should return 403 if user is not a doctor
statusReason: expected 404 to be 403 // Object.is equality

[Killed] BlockStatement
routes/schedule.js:10:7
   if (req.user.userType !== 'doctor') {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
-  try {
-    const doctor = await Doctor.findById(req.user.userId);
-    if (!doctor) {
-      return res.status(404).json({ message: 'Doctor not found' });
-    }
-    res.json(doctor.workingHours);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server Error');
killedBy: GET /api/schedule/working-hours should get working hours for a doctor successfully
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
routes/schedule.js:12:9
   }
   try {
     const doctor = await Doctor.findById(req.user.userId);
-    if (!doctor) {
+    if (true) {
       return res.status(404).json({ message: 'Doctor not found' });
     }
killedBy: GET /api/schedule/working-hours should get working hours for a doctor successfully
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
routes/schedule.js:12:18
   }
   try {
     const doctor = await Doctor.findById(req.user.userId);
-    if (!doctor) {
-      return res.status(404).json({ message: 'Doctor not found' });
-    }
+    if (!doctor) {}
     res.json(doctor.workingHours);
   } catch (err) {
killedBy: GET /api/schedule/working-hours should return 404 if doctor not found
statusReason: expected 500 to be 404 // Object.is equality

[Killed] BlockStatement
routes/schedule.js:16:17
       return res.status(404).json({ message: 'Doctor not found' });
     }
     res.json(doctor.workingHours);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: GET /api/schedule/working-hours should return 500 on server error
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/schedule.js:22:67
   }
 });
 
-router.post('/working-hours', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
-    return res.status(403).json({ message: 'Access denied. Not a doctor.' });
-  }
-  
-  const { workingHours } = req.body; 
-
-  try {
-    const doctor = await Doctor.findByIdAndUpdate(
-      req.user.userId,
-      { workingHours: workingHours }, 
-      { new: true } 
-    );
-    if (!doctor) {
-      return res.status(404).json({ message: 'Doctor not found' });
-    }
-    res.json(doctor.workingHours);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
-});
+router.post('/working-hours', authMiddleware, async (req, res) => {});
 
 router.post('/blocked-times', authMiddleware, async (req, res) => {
killedBy: POST /api/schedule/working-hours should update working hours for a doctor successfully
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/schedule.js:23:39
 });
 
 router.post('/working-hours', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
-    return res.status(403).json({ message: 'Access denied. Not a doctor.' });
-  }
+  if (req.user.userType !== 'doctor') {}
   
   const { workingHours } = req.body; 
killedBy: POST /api/schedule/working-hours should return 403 if user is not a doctor
statusReason: expected 404 to be 403 // Object.is equality

[Killed] ConditionalExpression
routes/schedule.js:23:7
 });
 
 router.post('/working-hours', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
+  if (true) {
     return res.status(403).json({ message: 'Access denied. Not a doctor.' });
   }
killedBy: POST /api/schedule/working-hours should update working hours for a doctor successfully
statusReason: expected 403 to be 200 // Object.is equality

[Killed] BlockStatement
routes/schedule.js:29:7
   
   const { workingHours } = req.body; 
 
-  try {
-    const doctor = await Doctor.findByIdAndUpdate(
-      req.user.userId,
-      { workingHours: workingHours }, 
-      { new: true } 
-    );
-    if (!doctor) {
-      return res.status(404).json({ message: 'Doctor not found' });
-    }
-    res.json(doctor.workingHours);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server Error');
killedBy: POST /api/schedule/working-hours should update working hours for a doctor successfully
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
routes/schedule.js:33:14
     const doctor = await Doctor.findByIdAndUpdate(
       req.user.userId,
       { workingHours: workingHours }, 
-      { new: true } 
+      { new: false } 
     );
     if (!doctor) {
killedBy: POST /api/schedule/working-hours should update working hours for a doctor successfully
statusReason: expected '09:00' to be '08:00' // Object.is equality

[Killed] ObjectLiteral
routes/schedule.js:33:7
     const doctor = await Doctor.findByIdAndUpdate(
       req.user.userId,
       { workingHours: workingHours }, 
-      { new: true } 
+      {} 
     );
     if (!doctor) {
killedBy: POST /api/schedule/working-hours should update working hours for a doctor successfully
statusReason: expected '09:00' to be '08:00' // Object.is equality

[Killed] ConditionalExpression
routes/schedule.js:35:9
       { workingHours: workingHours }, 
       { new: true } 
     );
-    if (!doctor) {
+    if (false) {
       return res.status(404).json({ message: 'Doctor not found' });
     }
killedBy: POST /api/schedule/working-hours should return 404 if doctor not found
statusReason: expected 500 to be 404 // Object.is equality

[Killed] BooleanLiteral
routes/schedule.js:35:9
       { workingHours: workingHours }, 
       { new: true } 
     );
-    if (!doctor) {
+    if (doctor) {
       return res.status(404).json({ message: 'Doctor not found' });
     }
killedBy: POST /api/schedule/working-hours should update working hours for a doctor successfully
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ObjectLiteral
routes/schedule.js:36:35
       { new: true } 
     );
     if (!doctor) {
-      return res.status(404).json({ message: 'Doctor not found' });
+      return res.status(404).json({});
     }
     res.json(doctor.workingHours);
killedBy: POST /api/schedule/working-hours should return 404 if doctor not found
statusReason: expected undefined to be 'Doctor not found' // Object.is equality

[Killed] ConditionalExpression
routes/schedule.js:46:7
 });
 
 router.post('/blocked-times', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
+  if (true) {
     return res.status(403).json({ message: 'Access denied.' });
   }
killedBy: POST /api/schedule/blocked-times should add blocked time successfully
statusReason: expected 403 to be 201 // Object.is equality

[Killed] BlockStatement
routes/schedule.js:46:39
 });
 
 router.post('/blocked-times', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
-    return res.status(403).json({ message: 'Access denied.' });
-  }
+  if (req.user.userType !== 'doctor') {}
 
   const { reason, date, startTime, endTime } = req.body;
killedBy: POST /api/schedule/blocked-times should return 403 if user is not a doctor
statusReason: expected 404 to be 403 // Object.is equality

[Killed] ObjectLiteral
routes/schedule.js:47:33
 
 router.post('/blocked-times', authMiddleware, async (req, res) => {
   if (req.user.userType !== 'doctor') {
-    return res.status(403).json({ message: 'Access denied.' });
+    return res.status(403).json({});
   }
 
killedBy: POST /api/schedule/blocked-times should return 403 if user is not a doctor
statusReason: expected undefined to be 'Access denied.' // Object.is equality

[Killed] ConditionalExpression
routes/schedule.js:52:7
 
   const { reason, date, startTime, endTime } = req.body;
 
-  if (!reason || !date || !startTime || !endTime) {
+  if (false) {
     return res.status(400).json({ message: 'All fields are required.' });
   }
killedBy: POST /api/schedule/blocked-times should return 400 if reason is missing
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
routes/schedule.js:52:7
 
   const { reason, date, startTime, endTime } = req.body;
 
-  if (!reason || !date || !startTime || !endTime) {
+  if (false || !endTime) {
     return res.status(400).json({ message: 'All fields are required.' });
   }
killedBy: POST /api/schedule/blocked-times should return 400 if reason is missing
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
routes/schedule.js:56:7
     return res.status(400).json({ message: 'All fields are required.' });
   }
 
-  try {
-    const doctor = await Doctor.findById(req.user.userId);
-    if (!doctor) {
-      return res.status(404).json({ message: 'Doctor not found' });
-    }
-
-    const newBlock = { reason, date, startTime, endTime };
-    doctor.blockedTimes.push(newBlock);
-    await doctor.save();
-
-    res.status(201).json(doctor.blockedTimes[doctor.blockedTimes.length - 1]);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server Error');
killedBy: POST /api/schedule/blocked-times should add blocked time successfully
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
routes/schedule.js:58:9
 
   try {
     const doctor = await Doctor.findById(req.user.userId);
-    if (!doctor) {
+    if (doctor) {
       return res.status(404).json({ message: 'Doctor not found' });
     }
killedBy: POST /api/schedule/blocked-times should add blocked time successfully
statusReason: expected 404 to be 201 // Object.is equality

[Killed] ObjectLiteral
routes/schedule.js:62:22
       return res.status(404).json({ message: 'Doctor not found' });
     }
 
-    const newBlock = { reason, date, startTime, endTime };
+    const newBlock = {};
     doctor.blockedTimes.push(newBlock);
     await doctor.save();
killedBy: POST /api/schedule/blocked-times should add blocked time successfully
statusReason: expected 500 to be 201 // Object.is equality

[Killed] ArithmeticOperator
routes/schedule.js:66:46
     doctor.blockedTimes.push(newBlock);
     await doctor.save();
 
-    res.status(201).json(doctor.blockedTimes[doctor.blockedTimes.length - 1]);
+    res.status(201).json(doctor.blockedTimes[doctor.blockedTimes.length + 1]);
   } catch (err) {
     console.error(err.message);
killedBy: POST /api/schedule/blocked-times should add blocked time successfully
statusReason: expected '' to have property "_id"

[Killed] BlockStatement
routes/schedule.js:67:17
     await doctor.save();
 
     res.status(201).json(doctor.blockedTimes[doctor.blockedTimes.length - 1]);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: POST /api/schedule/blocked-times should return 500 on server error
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/schedule.js:74:39
 });
 
 router.delete('/blocked-times/:blockId', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
-    return res.status(403).json({ message: 'Access denied.' });
-  }
+  if (req.user.userType !== 'doctor') {}
 
   try {
killedBy: DELETE /api/schedule/blocked-times/:blockId should return 403 if user is not a doctor
statusReason: expected 404 to be 403 // Object.is equality

[Killed] ConditionalExpression
routes/schedule.js:74:7
 });
 
 router.delete('/blocked-times/:blockId', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'doctor') {
+  if (true) {
     return res.status(403).json({ message: 'Access denied.' });
   }
killedBy: DELETE /api/schedule/blocked-times/:blockId should delete blocked time successfully
statusReason: expected 403 to be 200 // Object.is equality

[Killed] BlockStatement
routes/schedule.js:78:7
     return res.status(403).json({ message: 'Access denied.' });
   }
 
-  try {
-    const doctor = await Doctor.findById(req.user.userId);
-    if (!doctor) {
-      return res.status(404).json({ message: 'Doctor not found' });
-    }
-
-    const blockIndex = doctor.blockedTimes.findIndex(
-      (block) => block._id.toString() === req.params.blockId
-    );
-
-    if (blockIndex === -1) {
-      return res.status(404).json({ message: 'Blocked time not found.' });
-    }
-
-    doctor.blockedTimes.splice(blockIndex, 1);
-    await doctor.save();
-
-    res.json({ message: 'Blocked time removed successfully.' });
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server Error');
killedBy: DELETE /api/schedule/blocked-times/:blockId should delete blocked time successfully
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
routes/schedule.js:80:9
 
   try {
     const doctor = await Doctor.findById(req.user.userId);
-    if (!doctor) {
+    if (false) {
       return res.status(404).json({ message: 'Doctor not found' });
     }
killedBy: DELETE /api/schedule/blocked-times/:blockId should return 404 if doctor not found
statusReason: expected 500 to be 404 // Object.is equality

[Killed] ArrowFunction
routes/schedule.js:85:7
     }
 
     const blockIndex = doctor.blockedTimes.findIndex(
-      (block) => block._id.toString() === req.params.blockId
+      () => undefined
     );
 
killedBy: DELETE /api/schedule/blocked-times/:blockId should delete blocked time successfully
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/schedule.js:85:18
     }
 
     const blockIndex = doctor.blockedTimes.findIndex(
-      (block) => block._id.toString() === req.params.blockId
+      (block) => true
     );
 
killedBy: DELETE /api/schedule/blocked-times/:blockId should delete specific blocked time from multiple blocks
statusReason: expected 'Personal' to be 'Conference' // Object.is equality

[Killed] EqualityOperator
routes/schedule.js:88:9
       (block) => block._id.toString() === req.params.blockId
     );
 
-    if (blockIndex === -1) {
+    if (blockIndex !== -1) {
       return res.status(404).json({ message: 'Blocked time not found.' });
     }
killedBy: DELETE /api/schedule/blocked-times/:blockId should delete blocked time successfully
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/schedule.js:88:9
       (block) => block._id.toString() === req.params.blockId
     );
 
-    if (blockIndex === -1) {
+    if (true) {
       return res.status(404).json({ message: 'Blocked time not found.' });
     }
killedBy: DELETE /api/schedule/blocked-times/:blockId should delete blocked time successfully
statusReason: expected 404 to be 200 // Object.is equality

[Killed] StringLiteral
routes/schedule.js:95:25
     doctor.blockedTimes.splice(blockIndex, 1);
     await doctor.save();
 
-    res.json({ message: 'Blocked time removed successfully.' });
+    res.json({ message: "" });
   } catch (err) {
     console.error(err.message);
killedBy: DELETE /api/schedule/blocked-times/:blockId should delete blocked time successfully
statusReason: expected '' to be 'Blocked time removed successfully.' // Object.is equality

[Killed] BlockStatement
routes/schedule.js:96:17
     await doctor.save();
 
     res.json({ message: 'Blocked time removed successfully.' });
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: DELETE /api/schedule/blocked-times/:blockId should return 500 on server error
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
