[Killed] BlockStatement
routes/user.js:13:60
   doctor: Doctor,
   admin: Admin,
 };   
-router.get('/profile', authMiddleware, async (req, res) => {
-  try {
-    const { userId, userType } = req.user;
-    const Model = models[userType];
-
-    if (!Model) {
-      return res.status(400).json({ message: 'Invalid user type found in token.' });
-    }
-
-    const user = await Model.findById(userId).select('-password');
-
-    if (!user) {
-      return res.status(404).json({ message: 'User not found' });
-    }
-    res.json(user);
-  } catch (err) {
-    console.error("GET /profile Error:", err.message);
-    res.status(500).send('Server Error');
-  }
-});
+router.get('/profile', authMiddleware, async (req, res) => {});
 
 router.put('/profile', authMiddleware, async (req, res) => {
killedBy: GET /api/user/profile should get patient profile successfully
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/user.js:14:7
   admin: Admin,
 };   
 router.get('/profile', authMiddleware, async (req, res) => {
-  try {
-    const { userId, userType } = req.user;
-    const Model = models[userType];
-
-    if (!Model) {
-      return res.status(400).json({ message: 'Invalid user type found in token.' });
-    }
-
-    const user = await Model.findById(userId).select('-password');
-
-    if (!user) {
-      return res.status(404).json({ message: 'User not found' });
-    }
-    res.json(user);
-  } catch (err) {
+  try {} catch (err) {
     console.error("GET /profile Error:", err.message);
     res.status(500).send('Server Error');
killedBy: GET /api/user/profile should get patient profile successfully
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
routes/user.js:18:9
     const { userId, userType } = req.user;
     const Model = models[userType];
 
-    if (!Model) {
+    if (Model) {
       return res.status(400).json({ message: 'Invalid user type found in token.' });
     }
killedBy: GET /api/user/profile should get patient profile successfully
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
routes/user.js:18:17
     const { userId, userType } = req.user;
     const Model = models[userType];
 
-    if (!Model) {
-      return res.status(400).json({ message: 'Invalid user type found in token.' });
-    }
+    if (!Model) {}
 
     const user = await Model.findById(userId).select('-password');
killedBy: GET /api/user/profile should return 400 for invalid user type
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ObjectLiteral
routes/user.js:19:35
     const Model = models[userType];
 
     if (!Model) {
-      return res.status(400).json({ message: 'Invalid user type found in token.' });
+      return res.status(400).json({});
     }
 
killedBy: GET /api/user/profile should return 400 for invalid user type
statusReason: expected undefined to be 'Invalid user type found in token.' // Object.is equality

[Killed] BlockStatement
routes/user.js:24:16
 
     const user = await Model.findById(userId).select('-password');
 
-    if (!user) {
-      return res.status(404).json({ message: 'User not found' });
-    }
+    if (!user) {}
     res.json(user);
   } catch (err) {
killedBy: GET /api/user/profile should return 404 if user not found
statusReason: expected 200 to be 404 // Object.is equality

[Killed] BooleanLiteral
routes/user.js:24:9
 
     const user = await Model.findById(userId).select('-password');
 
-    if (!user) {
+    if (user) {
       return res.status(404).json({ message: 'User not found' });
     }
killedBy: GET /api/user/profile should get patient profile successfully
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ObjectLiteral
routes/user.js:25:35
     const user = await Model.findById(userId).select('-password');
 
     if (!user) {
-      return res.status(404).json({ message: 'User not found' });
+      return res.status(404).json({});
     }
     res.json(user);
killedBy: GET /api/user/profile should return 404 if user not found
statusReason: expected undefined to be 'User not found' // Object.is equality

[Killed] BlockStatement
routes/user.js:28:17
       return res.status(404).json({ message: 'User not found' });
     }
     res.json(user);
-  } catch (err) {
-    console.error("GET /profile Error:", err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: GET /api/user/profile should return 500 on database error
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
routes/user.js:30:26
     res.json(user);
   } catch (err) {
     console.error("GET /profile Error:", err.message);
-    res.status(500).send('Server Error');
+    res.status(500).send("");
   }
 });
killedBy: GET /api/user/profile should return 500 on database error
statusReason: expected '' to be 'Server Error' // Object.is equality

[Killed] StringLiteral
routes/user.js:34:12
   }
 });
 
-router.put('/profile', authMiddleware, async (req, res) => {
+router.put("", authMiddleware, async (req, res) => {
   try {
     const { userId, userType } = req.user;
killedBy: PUT /api/user/profile should update patient profile name successfully
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
routes/user.js:35:7
 });
 
 router.put('/profile', authMiddleware, async (req, res) => {
-  try {
-    const { userId, userType } = req.user;
-    const { fullName } = req.body;
-
-    const Model = models[userType];
-    if (!Model) {
-      return res.status(400).json({ message: 'Invalid user type in token.' });
-    }
-
-    const updatedUser = await Model.findByIdAndUpdate(
-      userId,
-      { fullName },
-      { new: true }
-    ).select('-password'); 
-
-    if (!updatedUser) {
-      return res.status(404).json({ message: 'User not found' });
-    }
-
-    res.json(updatedUser);
-  } catch (err) {
+  try {} catch (err) {
     console.error(err.message);
     res.status(500).send('Server Error');
killedBy: PUT /api/user/profile should update patient profile name successfully
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
routes/user.js:40:9
     const { fullName } = req.body;
 
     const Model = models[userType];
-    if (!Model) {
+    if (false) {
       return res.status(400).json({ message: 'Invalid user type in token.' });
     }
killedBy: PUT /api/user/profile should return 400 for invalid user type
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
routes/user.js:40:9
     const { fullName } = req.body;
 
     const Model = models[userType];
-    if (!Model) {
+    if (true) {
       return res.status(400).json({ message: 'Invalid user type in token.' });
     }
killedBy: PUT /api/user/profile should update patient profile name successfully
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BooleanLiteral
routes/user.js:47:14
     const updatedUser = await Model.findByIdAndUpdate(
       userId,
       { fullName },
-      { new: true }
+      { new: false }
     ).select('-password'); 
 
killedBy: PUT /api/user/profile should update patient profile name successfully
statusReason: expected 'John Doe' to be 'John Updated Doe' // Object.is equality

[Killed] StringLiteral
routes/user.js:48:14
       userId,
       { fullName },
       { new: true }
-    ).select('-password'); 
+    ).select(""); 
 
     if (!updatedUser) {
killedBy: PUT /api/user/profile should update patient profile name successfully
statusReason: expected 'Test@1234' to be undefined

[Killed] BlockStatement
routes/user.js:50:23
       { new: true }
     ).select('-password'); 
 
-    if (!updatedUser) {
-      return res.status(404).json({ message: 'User not found' });
-    }
+    if (!updatedUser) {}
 
     res.json(updatedUser);
killedBy: PUT /api/user/profile should return 404 if user not found
statusReason: expected 200 to be 404 // Object.is equality

[Killed] ConditionalExpression
routes/user.js:50:9
       { new: true }
     ).select('-password'); 
 
-    if (!updatedUser) {
+    if (false) {
       return res.status(404).json({ message: 'User not found' });
     }
killedBy: PUT /api/user/profile should return 404 if user not found
statusReason: expected 200 to be 404 // Object.is equality

[Killed] StringLiteral
routes/user.js:51:46
     ).select('-password'); 
 
     if (!updatedUser) {
-      return res.status(404).json({ message: 'User not found' });
+      return res.status(404).json({ message: "" });
     }
 
killedBy: PUT /api/user/profile should return 404 if user not found
statusReason: expected '' to be 'User not found' // Object.is equality

[Killed] BlockStatement
routes/user.js:55:17
     }
 
     res.json(updatedUser);
-  } catch (err) {
-    console.error(err.message);
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: PUT /api/user/profile should return 500 on database error
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
routes/user.js:69:9
     const OriginalModel = models[originalUserType];
     const NewModel = models[newUserType];
 
-    if (!OriginalModel || !NewModel) {
+    if (false) {
       return res.status(400).json({ message: 'Invalid user type specified.' });
     }
killedBy: PUT /api/user/complete-profile should return 400 for invalid original user type
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
routes/user.js:69:38
     const OriginalModel = models[originalUserType];
     const NewModel = models[newUserType];
 
-    if (!OriginalModel || !NewModel) {
-      return res.status(400).json({ message: 'Invalid user type specified.' });
-    }
+    if (!OriginalModel || !NewModel) {}
     const originalUser = await OriginalModel.findById(userId);
     if (!originalUser) {
killedBy: PUT /api/user/complete-profile should return 400 for invalid original user type
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ObjectLiteral
routes/user.js:70:35
     const NewModel = models[newUserType];
 
     if (!OriginalModel || !NewModel) {
-      return res.status(400).json({ message: 'Invalid user type specified.' });
+      return res.status(400).json({});
     }
     const originalUser = await OriginalModel.findById(userId);
killedBy: PUT /api/user/complete-profile should return 400 for invalid original user type
statusReason: expected undefined to be 'Invalid user type specified.' // Object.is equality

[Killed] ConditionalExpression
routes/user.js:73:9
       return res.status(400).json({ message: 'Invalid user type specified.' });
     }
     const originalUser = await OriginalModel.findById(userId);
-    if (!originalUser) {
+    if (true) {
       return res.status(404).json({ message: 'Original user account not found.' });
     }
killedBy: PUT /api/user/complete-profile should complete patient profile without changing user type
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
routes/user.js:73:9
       return res.status(400).json({ message: 'Invalid user type specified.' });
     }
     const originalUser = await OriginalModel.findById(userId);
-    if (!originalUser) {
+    if (false) {
       return res.status(404).json({ message: 'Original user account not found.' });
     }
killedBy: PUT /api/user/complete-profile should return 404 if original user not found
statusReason: expected 200 to be 404 // Object.is equality

[Killed] ConditionalExpression
routes/user.js:76:9
     if (!originalUser) {
       return res.status(404).json({ message: 'Original user account not found.' });
     }
-    if (originalUserType === newUserType) {
+    if (true) {
       const updateData = {
         ...profileData,
killedBy: PUT /api/user/complete-profile should transform patient to doctor and return new token
statusReason: expected 'Profile completed successfully!' to be 'Profile transformed and completed suc…' // Object.is equality

[Killed] ConditionalExpression
routes/user.js:76:9
     if (!originalUser) {
       return res.status(404).json({ message: 'Original user account not found.' });
     }
-    if (originalUserType === newUserType) {
+    if (false) {
       const updateData = {
         ...profileData,
killedBy: PUT /api/user/complete-profile should complete patient profile without changing user type
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BooleanLiteral
routes/user.js:79:28
     if (originalUserType === newUserType) {
       const updateData = {
         ...profileData,
-        isProfileComplete: true,
+        isProfileComplete: false,
       };
 
killedBy: PUT /api/user/complete-profile should complete patient profile without changing user type
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
routes/user.js:84:9
 
       const updatedUser = await OriginalModel.findByIdAndUpdate(
         userId,
-        { $set: updateData },
+        {},
         { new: true, runValidators: true }
       ).select('-password');
killedBy: PUT /api/user/complete-profile should complete patient profile without changing user type
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
routes/user.js:85:16
       const updatedUser = await OriginalModel.findByIdAndUpdate(
         userId,
         { $set: updateData },
-        { new: true, runValidators: true }
+        { new: false, runValidators: true }
       ).select('-password');
 
killedBy: PUT /api/user/complete-profile should complete patient profile without changing user type
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
routes/user.js:85:37
       const updatedUser = await OriginalModel.findByIdAndUpdate(
         userId,
         { $set: updateData },
-        { new: true, runValidators: true }
+        { new: true, runValidators: false }
       ).select('-password');
 
killedBy: Mutation Coverage Tests Validation error message formatting tests should format multiple validation errors with comma separator in complete-profile
statusReason: expected 200 to be 400 // Object.is equality

[Killed] StringLiteral
routes/user.js:89:18
       ).select('-password');
 
       return res.json({
-        message: 'Profile completed successfully!',
+        message: "",
         user: updatedUser,
       });
killedBy: PUT /api/user/complete-profile should complete patient profile without changing user type
statusReason: expected '' to be 'Profile completed successfully!' // Object.is equality

[Survived] BooleanLiteral
routes/user.js:98:26
       ...profileData,             
       _id: originalUser._id,      
       userType: newUserType,      
-      isProfileComplete: true,
+      isProfileComplete: false,
     };
     

[Killed] ObjectLiteral
routes/user.js:111:7
     await OriginalModel.findByIdAndDelete(userId);
 
     const newToken = jwt.sign(
-      { userId: newUser._id, userType: newUser.userType },
+      {},
       process.env.JWT_SECRET,
       { expiresIn: '1h' }
killedBy: Mutation Coverage Tests JWT token generation tests should generate valid JWT token with correct payload when transforming user type
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
routes/user.js:113:7
     const newToken = jwt.sign(
       { userId: newUser._id, userType: newUser.userType },
       process.env.JWT_SECRET,
-      { expiresIn: '1h' }
+      {}
     );
 
killedBy: Mutation Coverage Tests JWT token generation tests should generate token with 1 hour expiration when transforming to admin
statusReason: expected undefined to be defined

[Killed] BlockStatement
routes/user.js:122:17
       token: newToken,
     });
 
-  } catch (err) {
-    console.error("PUT /complete-profile Error:", err);
-   
-    if (err.name === 'ValidationError') {
-        let messages = Object.values(err.errors).map(val => val.message);
-        return res.status(400).json({ message: messages.join(', ') });
-    }
-    res.status(500).send('Server Error');
-  }
+  } catch (err) {}
 });
 
killedBy: PUT /api/user/complete-profile should return 400 for validation errors when completing profile
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] StringLiteral
routes/user.js:123:19
     });
 
   } catch (err) {
-    console.error("PUT /complete-profile Error:", err);
+    console.error("", err);
    
     if (err.name === 'ValidationError') {

[Killed] ConditionalExpression
routes/user.js:125:9
   } catch (err) {
     console.error("PUT /complete-profile Error:", err);
    
-    if (err.name === 'ValidationError') {
+    if (false) {
         let messages = Object.values(err.errors).map(val => val.message);
         return res.status(400).json({ message: messages.join(', ') });
killedBy: PUT /api/user/complete-profile should return 400 for validation errors when completing profile
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
routes/user.js:125:41
   } catch (err) {
     console.error("PUT /complete-profile Error:", err);
    
-    if (err.name === 'ValidationError') {
-        let messages = Object.values(err.errors).map(val => val.message);
-        return res.status(400).json({ message: messages.join(', ') });
-    }
+    if (err.name === 'ValidationError') {}
     res.status(500).send('Server Error');
   }
killedBy: PUT /api/user/complete-profile should return 400 for validation errors when completing profile
statusReason: expected 500 to be 400 // Object.is equality

[Survived] ArrowFunction
routes/user.js:126:54
     console.error("PUT /complete-profile Error:", err);
    
     if (err.name === 'ValidationError') {
-        let messages = Object.values(err.errors).map(val => val.message);
+        let messages = Object.values(err.errors).map(() => undefined);
         return res.status(400).json({ message: messages.join(', ') });
     }

[Killed] ObjectLiteral
routes/user.js:141:35
 
     const Model = models[userType];
     if (!Model) {
-      return res.status(400).json({ message: 'Invalid user type in token.' });
+      return res.status(400).json({});
     }
 
killedBy: PUT /api/user/update-profile should return 400 for invalid user type
statusReason: expected undefined to be 'Invalid user type in token.' // Object.is equality

[Killed] StringLiteral
routes/user.js:141:46
 
     const Model = models[userType];
     if (!Model) {
-      return res.status(400).json({ message: 'Invalid user type in token.' });
+      return res.status(400).json({ message: "" });
     }
 
killedBy: PUT /api/user/update-profile should return 400 for invalid user type
statusReason: expected '' to be 'Invalid user type in token.' // Object.is equality

[Killed] ObjectLiteral
routes/user.js:160:14
       return res.status(404).json({ message: 'User not found' });
     }
 
-    res.json({
-      message: 'Profile updated successfully!',
-      user: updatedUser,
-    });
+    res.json({});
   } catch (err) {
     console.error('Update profile error:', err);
killedBy: PUT /api/user/update-profile should update patient full profile successfully
statusReason: expected undefined to be 'Profile updated successfully!' // Object.is equality

[Killed] BlockStatement
routes/user.js:164:17
       message: 'Profile updated successfully!',
       user: updatedUser,
     });
-  } catch (err) {
-    console.error('Update profile error:', err);
-    if (err.name === 'ValidationError') {
-      let messages = Object.values(err.errors).map(val => val.message);
-      return res.status(400).json({ message: messages.join(', ') });
-    }
-    res.status(500).json({ message: 'Server Error' });
-  }
+  } catch (err) {}
 });
 
killedBy: PUT /api/user/update-profile should return 400 for validation errors
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
routes/user.js:166:9
     });
   } catch (err) {
     console.error('Update profile error:', err);
-    if (err.name === 'ValidationError') {
+    if (err.name !== 'ValidationError') {
       let messages = Object.values(err.errors).map(val => val.message);
       return res.status(400).json({ message: messages.join(', ') });
killedBy: PUT /api/user/update-profile should return 400 for validation errors
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
routes/user.js:166:9
     });
   } catch (err) {
     console.error('Update profile error:', err);
-    if (err.name === 'ValidationError') {
+    if (true) {
       let messages = Object.values(err.errors).map(val => val.message);
       return res.status(400).json({ message: messages.join(', ') });
killedBy: PUT /api/user/update-profile should return 500 on database error
statusReason: expected undefined to be 'Server Error' // Object.is equality

[Survived] StringLiteral
routes/user.js:168:60
     console.error('Update profile error:', err);
     if (err.name === 'ValidationError') {
       let messages = Object.values(err.errors).map(val => val.message);
-      return res.status(400).json({ message: messages.join(', ') });
+      return res.status(400).json({ message: messages.join("") });
     }
     res.status(500).json({ message: 'Server Error' });
