[Killed] LogicalOperator
routes/SummaryRoutes.js:38:22
   const severeSymptoms = appointment.severeSymptomsCheck || [];
 
   // ... (conditions logic) ...
-  const conditions = appointment.preExistingConditions || [];
+  const conditions = appointment.preExistingConditions && [];
   const conditionsOther = appointment.preExistingConditionsOther || '';
   const allConditions = [...conditions];
killedBy: GET /api/summary/appointment/:appointmentId generates comprehensive prompt with all sections and fallbacks
statusReason: expected 'Generate a concise clinical summary.\…' to contain '- Hypertension'
