[Killed] EqualityOperator
routes/doctors.js:18:9
 
     // By default, only return verified doctors to public clients.
     // Use `?includeUnverified=true` to explicitly request unverified doctors (admin/debug use).
-    if (req.query.includeUnverified !== 'true') {
+    if (req.query.includeUnverified === 'true') {
       query.isVerified = true;
     }
killedBy: Doctor Routes (Vitest) GET /api/doctors should include unverified doctors when includeUnverified=true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
routes/doctors.js:18:9
 
     // By default, only return verified doctors to public clients.
     // Use `?includeUnverified=true` to explicitly request unverified doctors (admin/debug use).
-    if (req.query.includeUnverified !== 'true') {
+    if (true) {
       query.isVerified = true;
     }
killedBy: Doctor Routes (Vitest) GET /api/doctors should include unverified doctors when includeUnverified=true
statusReason: expected false to be true // Object.is equality
