[Killed] BlockStatement
routes/reviews.js:8:45
 const Doctor = require('../models/Doctor');
 const Appointment = require('../models/Appointment');
 
-async function updateDoctorRating(doctorId) {
-  const reviews = await Review.find({ doctor: doctorId });
-
-  if (reviews.length === 0) {
-    await Doctor.findByIdAndUpdate(doctorId, {
-      averageRating: 0,
-      reviewCount: 0,
-    });
-    return;
-  }
-
-  // Calculate average rating - explicit steps for coverage
-  const totalRating = reviews.reduce((acc, review) => acc + review.rating, 0);
-  const averageRating = totalRating / reviews.length;
-  
-  // Update doctor with calculated values - explicit for coverage
-  const updateData = {
-    averageRating: averageRating,
-    reviewCount: reviews.length,
-  };
-  await Doctor.findByIdAndUpdate(doctorId, updateData);
-}
+async function updateDoctorRating(doctorId) {}
 
 router.post('/', authMiddleware, async (req, res) => {
killedBy: POST /api/reviews should create a review for a completed appointment successfully
statusReason: expected +0 to be 5 // Object.is equality

[Killed] BlockStatement
routes/reviews.js:11:29
 async function updateDoctorRating(doctorId) {
   const reviews = await Review.find({ doctor: doctorId });
 
-  if (reviews.length === 0) {
-    await Doctor.findByIdAndUpdate(doctorId, {
-      averageRating: 0,
-      reviewCount: 0,
-    });
-    return;
-  }
+  if (reviews.length === 0) {}
 
   // Calculate average rating - explicit steps for coverage
killedBy: updateDoctorRating function Coverage for uncovered lines should test updateDoctorRating when no reviews exist (cover line 20)
statusReason: Cast to Number failed for value "NaN" (type number) at path "averageRating"

[Killed] ArrowFunction
routes/reviews.js:20:38
   }
 
   // Calculate average rating - explicit steps for coverage
-  const totalRating = reviews.reduce((acc, review) => acc + review.rating, 0);
+  const totalRating = reviews.reduce(() => undefined, 0);
   const averageRating = totalRating / reviews.length;
   
killedBy: POST /api/reviews should create a review for a completed appointment successfully
statusReason: expected 500 to be 201 // Object.is equality

[Killed] ArithmeticOperator
routes/reviews.js:20:55
   }
 
   // Calculate average rating - explicit steps for coverage
-  const totalRating = reviews.reduce((acc, review) => acc + review.rating, 0);
+  const totalRating = reviews.reduce((acc, review) => acc - review.rating, 0);
   const averageRating = totalRating / reviews.length;
   
killedBy: POST /api/reviews should create a review for a completed appointment successfully
statusReason: expected -5 to be 5 // Object.is equality

[Killed] ArithmeticOperator
routes/reviews.js:21:25
 
   // Calculate average rating - explicit steps for coverage
   const totalRating = reviews.reduce((acc, review) => acc + review.rating, 0);
-  const averageRating = totalRating / reviews.length;
+  const averageRating = totalRating * reviews.length;
   
   // Update doctor with calculated values - explicit for coverage
killedBy: POST /api/reviews should update doctor rating correctly with multiple reviews
statusReason: expected 16 to be 4 // Object.is equality

[Killed] BlockStatement
routes/reviews.js:32:40
 }
 
 router.post('/', authMiddleware, async (req, res) => {
-  if (req.user.userType !== 'patient') {
-    return res.status(403).json({ message: 'Access denied. Not a patient.' });
-  }
+  if (req.user.userType !== 'patient') {}
 
   const { doctorId, appointmentId, rating, comment } = req.body;
killedBy: POST /api/reviews should return 403 if user is not a patient
statusReason: expected 500 to be 403 // Object.is equality

[Killed] EqualityOperator
routes/reviews.js:40:9
 
   try {
     const appointment = await Appointment.findById(appointmentId);
-    if (appointment.status !== 'completed') {
+    if (appointment.status === 'completed') {
       return res.status(400).json({ message: 'You can only review completed appointments.' });
     }
killedBy: POST /api/reviews should create a review for a completed appointment successfully
statusReason: expected 400 to be 201 // Object.is equality

[Killed] ObjectLiteral
routes/reviews.js:41:35
   try {
     const appointment = await Appointment.findById(appointmentId);
     if (appointment.status !== 'completed') {
-      return res.status(400).json({ message: 'You can only review completed appointments.' });
+      return res.status(400).json({});
     }
     if (appointment.patient.toString() !== req.user.userId) {
killedBy: POST /api/reviews should return 400 if appointment is not completed
statusReason: expected undefined to be 'You can only review completed appoint…' // Object.is equality

[Killed] ConditionalExpression
routes/reviews.js:43:9
     if (appointment.status !== 'completed') {
       return res.status(400).json({ message: 'You can only review completed appointments.' });
     }
-    if (appointment.patient.toString() !== req.user.userId) {
+    if (false) {
       return res.status(403).json({ message: 'You are not authorized to review this appointment.' });
     }
killedBy: POST /api/reviews should return 403 if patient is not authorized to review the appointment
statusReason: expected 201 to be 403 // Object.is equality

[Killed] ObjectLiteral
routes/reviews.js:47:49
       return res.status(403).json({ message: 'You are not authorized to review this appointment.' });
     }
 
-    const existingReview = await Review.findOne({ appointment: appointmentId });
+    const existingReview = await Review.findOne({});
     if (existingReview) {
       return res.status(400).json({ message: 'This appointment has already been reviewed.' });
killedBy: POST /api/reviews should update doctor rating correctly with multiple reviews
statusReason: expected 5 to be 4 // Object.is equality

[Killed] BlockStatement
routes/reviews.js:48:25
     }
 
     const existingReview = await Review.findOne({ appointment: appointmentId });
-    if (existingReview) {
-      return res.status(400).json({ message: 'This appointment has already been reviewed.' });
-    }
+    if (existingReview) {}
 
     const newReview = new Review({
killedBy: POST /api/reviews should return 400 if appointment has already been reviewed
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ObjectLiteral
routes/reviews.js:49:35
 
     const existingReview = await Review.findOne({ appointment: appointmentId });
     if (existingReview) {
-      return res.status(400).json({ message: 'This appointment has already been reviewed.' });
+      return res.status(400).json({});
     }
 
killedBy: POST /api/reviews should return 400 if appointment has already been reviewed
statusReason: expected undefined to be 'This appointment has already been rev…' // Object.is equality

[Killed] BlockStatement
routes/reviews.js:73:53
   }
 });
 
-router.get('/doctor/:doctorId', async (req, res) => {
-  try {
-    const reviews = await Review.find({ doctor: req.params.doctorId })
-      .populate('patient', 'fullName') 
-      .sort({ createdAt: -1 }); 
-
-    // Send reviews in response - explicit for coverage
-    const responseData = reviews;
-    res.json(responseData);
-  } catch (err) {
-    // Error handling - explicit for coverage
-    const errorMessage = 'Server Error';
-    console.error('Get Reviews Error:', err.message);
-    res.status(500).send(errorMessage);
-  }
-});
+router.get('/doctor/:doctorId', async (req, res) => {});
 
 module.exports = router;
killedBy: GET /api/reviews/doctor/:doctorId should get all reviews for a doctor
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
routes/reviews.js:74:7
 });
 
 router.get('/doctor/:doctorId', async (req, res) => {
-  try {
-    const reviews = await Review.find({ doctor: req.params.doctorId })
-      .populate('patient', 'fullName') 
-      .sort({ createdAt: -1 }); 
-
-    // Send reviews in response - explicit for coverage
-    const responseData = reviews;
-    res.json(responseData);
-  } catch (err) {
+  try {} catch (err) {
     // Error handling - explicit for coverage
     const errorMessage = 'Server Error';
killedBy: GET /api/reviews/doctor/:doctorId should get all reviews for a doctor
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
routes/reviews.js:75:39
 
 router.get('/doctor/:doctorId', async (req, res) => {
   try {
-    const reviews = await Review.find({ doctor: req.params.doctorId })
+    const reviews = await Review.find({})
       .populate('patient', 'fullName') 
       .sort({ createdAt: -1 }); 
killedBy: GET /api/reviews/doctor/:doctorId should handle invalid doctor ID gracefully
statusReason: expected 200 to be 500 // Object.is equality

[Killed] BlockStatement
routes/reviews.js:82:17
     // Send reviews in response - explicit for coverage
     const responseData = reviews;
     res.json(responseData);
-  } catch (err) {
-    // Error handling - explicit for coverage
-    const errorMessage = 'Server Error';
-    console.error('Get Reviews Error:', err.message);
-    res.status(500).send(errorMessage);
-  }
+  } catch (err) {}
 });
 
killedBy: GET /api/reviews/doctor/:doctorId should return 500 on server error
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
